[{"id":"bc0852bc-a647-4f04-9f2a-79fff084cd48","type":"Full Time","url":"https://jobs.github.com/positions/bc0852bc-a647-4f04-9f2a-79fff084cd48","created_at":"Tue Nov 19 09:36:28 UTC 2019","company":"Agile Content SA","company_url":"http:","location":"Barcelona","title":"Senior Java Developer","description":"\u003cp\u003eWe are looking for the best Senior Java Developer! Our future colleague can be based anywhere in Europe (preferably Spain) or LATAM.\u003c/p\u003e\n\u003cp\u003eYour key tasks will be:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou will be part of our Agile TV Product team to bring recognized products and services to market, building the best TV experience.\u003c/li\u003e\n\u003cli\u003eParticipate in the development of new products and evolvement of the existing ones while contributing in the architectural decisions (e.g.:  New Generation TV Platform).\u003c/li\u003e\n\u003cli\u003eCollaborate in designing and implementing new features required to support backend modules and platform functionality and releases.\u003c/li\u003e\n\u003cli\u003eAssist in delivering analysis and development for high performance, reliable, secure and scalable applications.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou must have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5 + years of experience in Java and web development.\u003c/li\u003e\n\u003cli\u003eStrong understanding of object-oriented fundamentals.\u003c/li\u003e\n\u003cli\u003eKnowledge in the Spring IO platform (Spring Boot, Spring MVC, Spring Data…).\u003c/li\u003e\n\u003cli\u003eExperience in software development best practices, including optimization, documentation and testing.\u003c/li\u003e\n\u003cli\u003eExperience in developing robust, highly scalable systems.\u003c/li\u003e\n\u003cli\u003eHandling software repositories and the GIT version control.\u003c/li\u003e\n\u003cli\u003eExperience in agile methodologies (SCRUM, Kanban ...).\u003c/li\u003e\n\u003cli\u003eB2 English level or equivalent.\u003c/li\u003e\n\u003cli\u003eKnowledge of SQL databases.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt would be great if you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAre familiar with:\u003c/li\u003e\n\u003c/ul\u003e\n\u003cul\u003e\n\u003cli\u003eContent Delivery Optimization (Ngnix, Varnish, Hazelcast).\u003c/li\u003e\n\u003cli\u003eDeployment solutions (Docker, Vagrant)\u003c/li\u003e\n\u003cli\u003eTV Technologies (streaming, DRM)\u003c/li\u003e\n\u003cli\u003eNon-sql technologies (MongoDB)\u003c/li\u003e\n\u003cli\u003eJS frameworks (React, React Native, NodeJS)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cul\u003e\n\u003cli\u003eHave:\u003c/li\u003e\n\u003c/ul\u003e\n\u003cul\u003e\n\u003cli\u003eCertificate of Higher Education in Computer Science or bachelor’s in computer science\u003c/li\u003e\n\u003cli\u003eExperiencie with TDD.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking forward to hearing from you if:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are a collaborative team player, self-motivated individual who takes ownership, eager to learn and willing to take challenges, hands on and flexible.\u003c/li\u003e\n\u003cli\u003eYou have good communication and organisation skills and solid analytical and problem-solving abilities.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhy join us?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThrilling projects and products are waiting for you. Lots of things to do, a bunch of talented people to work with and a real technological challenge. Ready to foster innovation?.\u003c/li\u003e\n\u003cli\u003eYour family and friends will see the outcomes of your job. How terrific is that!!!.\u003c/li\u003e\n\u003cli\u003eYou will be connected to some of the coolest brands and bigger companies worldwide.\u003c/li\u003e\n\u003cli\u003eBecause we believe your personal life is as important as your career, you can enjoy flexibility in terms of location, working hours...\u003c/li\u003e\n\u003cli\u003eYour colleagues will be from different nationalities, cultures and backgrounds.\u003c/li\u003e\n\u003cli\u003eWilling to be feel empowered in an ongoing learning environment? Would you like to attend industry events and summits? If so, this is the place for you.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your CV to \u003ca href=\"mailto:recruitment@agilecontent.com\"\u003erecruitment@agilecontent.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2QzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a1ea5d8f1f8807d842630fcc6ae17ac41a8f668b/agile_content_RGB_color_black_green.png"},{"id":"18f23319-0927-4d77-9aa9-5ba808c3a508","type":"Full Time","url":"https://jobs.github.com/positions/18f23319-0927-4d77-9aa9-5ba808c3a508","created_at":"Tue Nov 19 08:39:33 UTC 2019","company":"Baker Hughes, a GE company","company_url":"http://careers.bhge.com","location":"Delft","title":".NET Software Engineer (Radiant)","description":"\u003cp\u003e\u003cstrong\u003eAbout us:\u003c/strong\u003e\nAt Baker Hughes, we are transforming the future of energy. With operations in over 120 countries, we are developing and deploying industry-leading technologies and services to take energy forward.\u003c/p\u003e\n\u003cp\u003eFor more than a century, our inventions have revolutionized energy. Today, we are bringing our expertise to make oil and gas safer, cleaner, and more efficient.\u003c/p\u003e\n\u003cp\u003eOur people are the trusted experts, relied on to solve customer challenges big and small. We invest in the health and well-being of our workforce, train and reward talent, and develop leaders at all levels to bring out the best in each other.\u003c/p\u003e\n\u003cp\u003eWe believe in creating an environment of diversity and inclusion, without bias. We know we are better when all of our people are developed, engaged, and able to bring their whole authentic selves to work.\u003c/p\u003e\n\u003cp\u003eWe’re makers, inventors, and leaders who aren’t afraid of the tough challenges. We believe pushing boundaries will help to lead the way for a new energy future.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e.NET Software Engineer (Radiant)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur company is currently in search of several talented Software Developers to help increase our dynamic, growing Development Teams in Delft (Zuid-Holland). As part of one of our 10+ Scrum teams, you will be working together with the Product Owner and Domain Experts on our application, JewelSuite and our current platform, JewelEarth.\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://www.bhge.com/digital/field-planning-optimization/jewelearthtm?_ga=2.171903207.692022814.1573828138-245205280.1573828138\"\u003eJewelSuite™\u003c/a\u003e Subsurface Modeling application is an innovative, powerful tool to quickly create precise geological models—regardless of the reservoir’s structural complexity—in half the time as traditional solutions. The application can rapidly build multiple scenarios and accelerates analysis of alternative possible outcomes for determining optimal field development plans.\nThe \u003ca href=\"https://www.bhge.com/digital/field-planning-optimization/jewelearthtm?_ga=2.171903207.692022814.1573828138-245205280.1573828138\"\u003eJewelEarth™\u003c/a\u003e software platform provides (API) services, user interface components, domain objects, commands and serialization capabilities that are the foundational functionality for all \u003ca href=\"https://www.bhge.com/digital/field-planning-optimization/jewelearthtm?_ga=2.171903207.692022814.1573828138-245205280.1573828138\"\u003eJewelSuite™\u003c/a\u003e software applications. The JewelEarth™ SDK enables you to easily build your own differentiating software applications, create workflow standards through set workflow panels, and connect to proprietary databases or other subsurface applications.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou will help us deliver our products quickly and with high quality by:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTaking ownership of the software development process\u003c/li\u003e\n\u003cli\u003ePro-actively contributing to continuously improve our code and development processes\u003c/li\u003e\n\u003cli\u003eBeing passionate about working in a product development environment\u003c/li\u003e\n\u003cli\u003eShowing craftsmanship and being passionate about quality\u003c/li\u003e\n\u003cli\u003eBeing motivated by complex architecture and code\u003c/li\u003e\n\u003cli\u003eBeing passionate about helping our products to stay “future-proof”\u003c/li\u003e\n\u003cli\u003eAdding value to the team through your knowledge and programming skills. With your team grow in achieving unique and outstanding performance\u003c/li\u003e\n\u003cli\u003eEnjoying to learn from your motivated and skilled colleagues and in turn sharing your knowledge\u003c/li\u003e\n\u003cli\u003eNot afraid to ask questions and excel in your profession\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat are we looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelors’ degree or higher in Computer Science or equivalent with significant experience in software development\u003c/li\u003e\n\u003cli\u003eIn depth knowledge of Microsoft technologies including Visual Studio and C#\u003c/li\u003e\n\u003cli\u003eThorough knowledge of software architecture, object oriented design, unit testing, and best practices (e.g.: SOLID, TDD, BDD etc.)\u003c/li\u003e\n\u003cli\u003eExperience working with complex structures, multi-threading, design patterns\u003c/li\u003e\n\u003cli\u003eExperience with Scrum/Agile software development\u003c/li\u003e\n\u003cli\u003eExperience in technical or scientific software engineering is a plus\u003c/li\u003e\n\u003cli\u003eExcellent English communications skills (verbal and written)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s in it for you\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking in a multicultural and with multiple other teams in a project following Scrum/SAFe principles\u003c/li\u003e\n\u003cli\u003eWorking together with domain experts on exciting scientific software in the Oil \u0026amp; Gas domain\u003c/li\u003e\n\u003cli\u003eBeing part of a passionate community of development professionals\u003c/li\u003e\n\u003cli\u003eAccess to self-learning resources (e.g. PluralSight)\u003c/li\u003e\n\u003cli\u003eOur commitment for the long run (by providing trainings, career growth, knowledge sharing)\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eBonus program\u003c/li\u003e\n\u003cli\u003eHealthcare allowance (€ 138,70 gross per month)\u003c/li\u003e\n\u003cli\u003e25 Vacation days, the year after (if not been ill) 5 days extra\u003c/li\u003e\n\u003cli\u003eAs part of our Continuous Improvement we are open for your ideas\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBaker Hughes is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. \u003ca href=\"https://www.eeoc.gov/employers/upload/poster_screen_reader_optimized.pdf\"\u003eLearn more\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eIf you want to apply then leave your resume and motivation behind via our online \u003ca href=\"https://baker-hughes--a-ge-company.onlinevacatures.nl:443/en/job/147397/apply?jid=2021\"\u003eapplication form\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAcquisition as a result of this vacancy is not appreciated.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eKeywords: Software Engineer, Software Developer, Software Development, Computer Science, .NET Software Developer, Software Architecture\u003c/em\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1YzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--92895c306f1ceecd83a0ae6aff4dd4ed59447093/logo.jpg"},{"id":"2f334f6e-ec0e-4fef-a333-b6c1145adb9a","type":"Full Time","url":"https://jobs.github.com/positions/2f334f6e-ec0e-4fef-a333-b6c1145adb9a","created_at":"Mon Nov 18 17:17:34 UTC 2019","company":"Gartner Inc","company_url":"http:","location":"Barcelona, Spain","title":"Senior Backend Software Engineer (Ruby)","description":"\u003cp\u003eWhat makes Gartner a GREAT fit for you? When you join Gartner, you’ll be part of a fast-growing team that helps the world become smarter and more connected. We’re the world’s leading research and advisory company, achieving consistent double-digit growth by steering clients toward the right decisions with business and technology insights they can’t find anywhere else. Our associates enjoy a collaborative work environment, exceptional training and career development — as well as unlimited growth opportunities. If you like working with a curious, supportive, high-performing team, Gartner is the place for you.\u003c/p\u003e\n\u003cp\u003eAbout Gartner Digital Markets:\nGartner Digital Markets is a business unit within Gartner.  Our mission is to help small businesses make the right technology decisions and find the tools they need to grow, optimize, and become more effective at what they do.  The business is comprised of three leading brands—Capterra, Software Advice, and GetApp. For candidates interested in taking their next career step in the technology space, Gartner Digital Markets offers the fast pace and excitement of working for a startup, the stability and resources of a large, established organization, and the opportunity to be on the front lines of innovation in an industry that is always growing and transforming.\u003c/p\u003e\n\u003cp\u003eWhat we are looking for:\nGetApp is looking for a passionate Senior Backend Software Engineer to work with our highly skilled technology team located in central Barcelona.\u003c/p\u003e\n\u003cp\u003eThis position will make an impact on the design of backend architecture for our applications, whilst working closely with our designers and engineers to build a compelling product and implement exciting new features - all with the goal of ensuring a great experience for website users.\u003c/p\u003e\n\u003cp\u003eWhy you will want to come to the office everyday:\nYour primary responsibility will be development and maintenance of the backend part of the GetApp website codebase ensuring the highest quality experience for our users.\u003c/p\u003e\n\u003cp\u003eResponsible for the timely development of well-defined, larger product features/changes, expected to use judgement \u0026amp; apply functional knowledge of methodology/best practices; Develop code documentation as a reference.\u003c/p\u003e\n\u003cp\u003eBecome active participant in technical design process, expected to contribute own ideas for changes/new features; Capable of owning independent small-to-medium features all the way through from technical design to launch.\u003c/p\u003e\n\u003cp\u003eImproves operations by conducting systems analysis; recommending changes in policies and procedures.\u003c/p\u003e\n\u003cp\u003eChallenging projects: You will work on the main website, recommendation systems, chatbot and many other.\u003c/p\u003e\n\u003cp\u003eWeb technologies: Ruby is our language of choice, the stack is composed of MySQL, Solr, Redis, AWS (including Personalize), Google Cloud Services and others. We actively use Docker to power our infrastructure.\u003c/p\u003e\n\u003cp\u003eWhat you will bring to the team:\nA passion for technology and development, a hunger to learn, a desire to meet challenges, a commitment to applying engineering best practice to produce top quality solutions.\u003c/p\u003e\n\u003cp\u003e4 years+ experience in Ruby.\u003c/p\u003e\n\u003cp\u003eBachelor’s Degree in Computer Science or Computer Engineering.\u003c/p\u003e\n\u003cp\u003eKnowledge of software development methodology, techniques \u0026amp; standards.\u003c/p\u003e\n\u003cp\u003eUnderstanding of software design concepts, patterns, tools, best practices.\u003c/p\u003e\n\u003cp\u003eKnowledge of web frameworks (like Sinatra/Rails), testing frameworks (like Rspec/Minitest) and Javascript.\u003c/p\u003e\n\u003cp\u003eMySQL and Apache Solr is a plus.\u003c/p\u003e\n\u003cp\u003eVerbal English skills (we work in English!)\u003c/p\u003e\n\u003cp\u003eWhat we offer:\nLimitless growth and learning opportunities.\u003c/p\u003e\n\u003cp\u003eA collaborative and positive culture — join a diverse team of professionals that are as smart and driven as you.\u003c/p\u003e\n\u003cp\u003eA chance to make an impact — Your work will contribute directly to our strategy.\u003c/p\u003e\n\u003cp\u003eFrequent social activities such as laser tag, bowling, escape room, summer beach party, hiking \u0026amp; bbq, and more!\u003c/p\u003e\n\u003cp\u003eModern approach to work - Flexible hours, Friday afternoons free, remote work, and more.\u003c/p\u003e\n\u003cp\u003eOffice close to the beach in the fantastic, “innovation and tech” @22 district of sunny Barcelona.\u003c/p\u003e\n\u003cp\u003eFresh fruit, snacks, selection of teas and fair trade organic coffee.\u003c/p\u003e\n\u003cp\u003eRelocation Assistance - A specialist to help you with all the appointments and paperwork.\u003c/p\u003e\n\u003cp\u003eWhat you will get:\nCompetitive compensation.\u003c/p\u003e\n\u003cp\u003e23 days annual holiday, and additional days off for your birthday, 24th \u0026amp; 31st of December.\u003c/p\u003e\n\u003cp\u003ePrivate Medical and Dental Care.\u003c/p\u003e\n\u003cp\u003eLife and Disability Insurance.\u003c/p\u003e\n\u003cp\u003ePublic Transport Subsidy.\u003c/p\u003e\n\u003cp\u003eTicket Restaurant Card.\u003c/p\u003e\n\u003cp\u003eChildcare Vouchers (Ticket Guarderia).\u003c/p\u003e\n\u003cp\u003eIncentiFit - annual reimbursement for health-and-wellness-related activities.\u003c/p\u003e\n\u003cp\u003ePension Scheme.\u003c/p\u003e\n\u003cp\u003eTuition Reimbursement.\u003c/p\u003e\n\u003cp\u003eEmployee Stock Purchase Plan.\u003c/p\u003e\n\u003cp\u003eEmployee Assistance Program.\u003c/p\u003e\n\u003cp\u003eGartner Gives Charity Match.\u003c/p\u003e\n\u003cp\u003eWho we are:\nAction Oriented - Deliver fast, get great results. We embrace the vision, roadmap to success and the action it takes to make it happen.\u003c/p\u003e\n\u003cp\u003eIntellectually Curious - Seek to learn, love to teach. We’re humble and embrace respectful, radical candor with a mindset of ongoing professional and personal development.\u003c/p\u003e\n\u003cp\u003eCollaborative - One team, shared mission. We welcome feedback and understand the value of working together to accomplish more than what is possible individually.\u003c/p\u003e\n\u003cp\u003e#digitalmarkets\u003c/p\u003e\n\u003cp\u003ePLEASE NOTE:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eApplications must be submitted in English.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA valid EU visa/passport is required for this position.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBy submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence.\u003c/p\u003e\n\u003cp\u003eGartner Applicant Privacy Link: \u003ca href=\"https://jobs.gartner.com/applicant-privacy-policy\"\u003ehttps://jobs.gartner.com/applicant-privacy-policy\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via: \u003ca href=\"https://bit.ly/2CSVtcB\"\u003ehttps://bit.ly/2CSVtcB\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmwzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e648405a39bf327997067def75c4a22feb70b167/2018%20Gartner%20Logo.jpg"},{"id":"16722ee5-bc8c-40d5-80aa-6a5b413cb57d","type":"Full Time","url":"https://jobs.github.com/positions/16722ee5-bc8c-40d5-80aa-6a5b413cb57d","created_at":"Mon Nov 18 14:15:18 UTC 2019","company":"www.bwi-it.de","company_url":"http://www.bwi-it.de","location":"Bonn","title":"Abteilungsleiter (m/w/d) Anwendungsmanagement ERP/SAP","description":"\u003cp\u003eGestalten Sie mit uns eine der größten und komplexesten IT-Landschaften Deutschlands und unterstützen Sie unser Team als\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbteilungsleiter (m/w/d) Anwendungsmanagement ERP/SAP\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eab sofort und in Vollzeit in Bonn.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls IT-Partner der Bundeswehr und IT-Dienstleistungszentrum des Bundes bieten wir umfassende IT-Services aus einer Hand. Mit über 4.000 Mitarbeiterinnen und Mitarbeitern zählen wir zu den zehn größten IT-Service-Providern Deutschlands. Wir suchen authentische IT-Liebhaberinnen und IT-Liebhaber, die ihre Leidenschaft mit uns teilen wollen, auf der Suche nach anspruchsvollen IT-Herausforderungen sind und Deutschlands IT gestalten möchten.\u003c/p\u003e\n\u003cp\u003eDie Business Unit (BU) ERP ist der verlässliche sowie leistungsstarke Partner für alle Phasen von ERP Projekten – im Schwerpunkt SAP – insbesondere für die Abteilung G des Bundesamtes für Ausrüstung, Informationstechnik und Nutzung der Bundeswehr (BAAINBw) und zukünftig für die Behörden des Bundes. Die BU ERP Anwendungsmanagement umfasst das Application Management über den gesamten Produktlebenszyklus. Der Bereich treibt Innovationen zur SAP- und Non-SAP-Landschaft des Kunden verantwortlich voran. Aufgrund der hohen Verzahnung erfolgt eine enge Zusammenarbeit mit den Digitalisierungsprogrammen, der BU Bw sowie der Shared Service Delivery. Standardisierung, Re-Engineering und Automatisierung sind dabei wichtige Rahmenparameter.\u003c/p\u003e\n\u003cp\u003eErfahren Sie mehr in unserem \u003ca href=\"https://bwi-it.redirect.your-jobresponse.com/abteilungsleiter_m_w_d_anwendungsmanagement_erp_sap_bonn/258799/V819/anwenden\"\u003ePortfolio\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003eIhre Aufgaben:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eFachliche und disziplinarische Führung eines elfköpfigen Teams\u003c/li\u003e\n\u003cli\u003eSicherstellung einer qualitativ hochwertigen Vertragserfüllung durch störungsfreien SLA-konformen Applikationsbetrieb für das verantwortete Portfolio Legacy-Systeme und SAP\u003c/li\u003e\n\u003cli\u003eAktives Vorantreiben des Zukunftsprojektes SAP@Cloud im Rahmen des verantworteten Portfolios\u003c/li\u003e\n\u003cli\u003eVerantwortliche Umsetzung und Betrieb von standardisierten Lösungen im Rahmen der verantworteten Verfahren gemäß den Kundenanforderungen unter Einbindung externer Partner\u003c/li\u003e\n\u003cli\u003eIntensive Kundenkommunikation und Gremienvertretung\u003c/li\u003e\n\u003cli\u003eSicherstellung der fachlichen und prozessualen Abstimmung innerhalb der BWI in allen Fragen der Leistungserbringung des verantworteten Portfolios\u003c/li\u003e\n\u003cli\u003ePersonalverantwortliche Entwicklung und Förderung der MitarbeiterInnen sowie aktives Umsetzen der Unternehmensstrategien und Werte der BWI\u003c/li\u003e\n\u003cli\u003eSicherstellung des Skill-Aufbaus und Bereitstellung der für den Anwendungsbetrieb erforderlichen Ressourcen\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eIhr Profil:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossenes IT-bezogenes Hochschulstudium der Informatik oder Wirtschaftsinformatik bzw. Nachweise gleichwertiger Fähigkeiten\u003c/li\u003e\n\u003cli\u003eMindestens drei Jahre Berufserfahrung in der Führung eines Teams mit disziplinarischer Verantwortung\u003c/li\u003e\n\u003cli\u003eExpertise in der Managementberatung und im Portfoliomanagement\u003c/li\u003e\n\u003cli\u003eSehr gute praktische und theoretische Kenntnisse im Themenfeld SAP Anwendungsmanagement\u003c/li\u003e\n\u003cli\u003eUmfassende Kenntnisse und Erfahrungen im Integrationsmanagement großer Anwendungsentwicklungs-Projekte und Steuerung externer Partner\u003c/li\u003e\n\u003cli\u003eITIL-Kenntnisse mit entsprechenden Zertifizierungen\u003c/li\u003e\n\u003cli\u003eProfunde Kenntnisse im öffentlichen Vergaberecht\u003c/li\u003e\n\u003cli\u003eFließende Deutschkenntnisse\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWir bieten:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSpannende und abwechslungsreiche Aufgaben in einem innovativen und bedeutsamen Umfeld\u003c/li\u003e\n\u003cli\u003eVielfältige interne und externe Weiterbildungsmöglichkeiten sowie individuelle Karrieremodelle\u003c/li\u003e\n\u003cli\u003eCoaching-Angebote und Möglichkeiten zur Persönlichkeitsentwicklung in einer wertschätzenden Arbeitsatmosphäre\u003c/li\u003e\n\u003cli\u003eGratis Fitnessstudio-Mitgliedschaft über Interfit und weitere attraktive Mitarbeitervergünstigungen\nVertrauensarbeitszeit. Je nach Aufgabenfeld sind mobiles Arbeiten und flexible Arbeitszeitmodelle möglich\u003c/li\u003e\n\u003cli\u003eEin attraktives Vergütungspaket inkl. arbeitgeberfinanzierter betrieblicher Altersvorsorge\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSagen Sie's gerne weiter!\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eHaben wir Ihr Interesse geweckt?\u003c/h2\u003e\n\u003cp\u003eDann bewerben Sie sich hier über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eBei Fragen steht Ihnen das Recruiting-Team unter Angabe der Stellen-ID: 21703 gerne zur Verfügung. Tel.: 02225 988 3990\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://bwi-it.redirect.your-jobresponse.com/abteilungsleiter_m_w_d_anwendungsmanagement_erp_sap_bonn/258799/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://bwi-it.redirect.your-jobresponse.com/abteilungsleiter_m_w_d_anwendungsmanagement_erp_sap_bonn/258799/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBclYzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e2645e3099c94ea91547d6c293643e2237775229/BWI.jpg"},{"id":"e057f5bd-9c6b-4be3-ab8d-1c91750a2292","type":"Full Time","url":"https://jobs.github.com/positions/e057f5bd-9c6b-4be3-ab8d-1c91750a2292","created_at":"Mon Nov 18 13:34:00 UTC 2019","company":"BWI GmbH","company_url":"http://www.bwi-it.de","location":"Bonn","title":"Abteilungsleiter (m/w/d) Softwareentwicklung ERP/SAP","description":"\u003cp\u003eGestalten Sie mit uns eine der größten und komplexesten IT-Landschaften Deutschlands und unterstützen Sie unser Team als\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbteilungsleiter (m/w/d) Softwareentwicklung ERP/SAP\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eab sofort und in Vollzeit in Bonn.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls IT-Partner der Bundeswehr und IT-Dienstleistungszentrum des Bundes bieten wir umfassende IT-Services aus einer Hand. Mit über 4.000 Mitarbeiterinnen und Mitarbeitern zählen wir zu den zehn größten IT-Service-Providern Deutschlands. Wir suchen authentische IT-Liebhaberinnen und IT-Liebhaber, die ihre Leidenschaft mit uns teilen wollen, auf der Suche nach anspruchsvollen IT-Herausforderungen sind und Deutschlands IT gestalten möchten.\u003c/p\u003e\n\u003cp\u003eDie Business Unit (BU) ERP ist der verlässliche sowie leistungsstarke Partner für alle Phasen von ERP Projekten – im Schwerpunkt SAP – insbesondere für die Abteilung G des Bundesamtes für Ausrüstung, Informationstechnik und Nutzung der Bundeswehr (BAAINBw) und zukünftig für die Behörden des Bundes. Die BU ERP Anwendungsmanagement umfasst das Application Management über den gesamten Produktlebenszyklus. Der Bereich treibt Innovationen zur SAP- und Non-SAP-Landschaft des Kunden verantwortlich voran. Aufgrund der hohen Verzahnung erfolgt eine enge Zusammenarbeit mit den Digitalisierungsprogrammen, der BU Bw sowie der Shared Service Delivery. Standardisierung, Re-Engineering und Automatisierung sind dabei wichtige Rahmenparameter.\u003c/p\u003e\n\u003cp\u003eErfahren Sie mehr in unserem \u003ca href=\"www.bwi.de/portfolio\"\u003ePortfolio\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003eIhre Aufgaben:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eFachliche und disziplinarische Führung eines Teams aus 15 Mitarbeitern\u003c/li\u003e\n\u003cli\u003eSicherstellung einer qualitativ hochwertigen Vertragserfüllung durch Entwicklung und Förderung der MitarbeiterInnen sowie Neurekrutierung\u003c/li\u003e\n\u003cli\u003eVerantwortliche Weiterentwicklung und Optimierung der eingesetzten SAP-Lösung SASPF\nAktives Vorantreiben des Zukunftsprojektes SAP@Cloud sowie der Ablösestrategie der Non-SAP-Verfahren\u003c/li\u003e\n\u003cli\u003eMitgestaltung der Umsetzung von Entwicklungsanforderungen\u003c/li\u003e\n\u003cli\u003eUmsetzung der Unternehmensstrategien und Werte der BWI\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eIhr Profil:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossenes IT-bezogenes Hochschulstudium der Informatik oder Wirtschaftsinformatik bzw. Nachweise gleichwertiger Fähigkeiten\u003c/li\u003e\n\u003cli\u003eMindestens drei Jahre Berufserfahrung in der Führung eines Teams mit disziplinarischer Verantwortung\u003c/li\u003e\n\u003cli\u003eExpertise in der Managementberatung und im Portfoliomanagement\u003c/li\u003e\n\u003cli\u003eProfunde Kenntnisse in zukunftsorientierten Themen wie SAP Cloud, UI5 / FIORI, SAP S/4 HANA, Digitalisierung, DevOps\u003c/li\u003e\n\u003cli\u003eSehr gutes Knowhow im Integrationsmanagement komplexer Entwicklungsprojekte unter Anwendung agiler Methoden\u003c/li\u003e\n\u003cli\u003eErfahrungen im Re-Engineering und Migration\u003c/li\u003e\n\u003cli\u003eITIL-Kenntnisse mit entsprechenden Zertifizierungen\u003c/li\u003e\n\u003cli\u003eProfunde Kenntnisse im öffentlichen Vergaberecht\u003c/li\u003e\n\u003cli\u003eFließende Deutschkenntnisse\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWir bieten:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSpannende und abwechslungsreiche Aufgaben in einem innovativen und bedeutsamen Umfeld\u003c/li\u003e\n\u003cli\u003eVielfältige interne und externe Weiterbildungsmöglichkeiten sowie individuelle Karrieremodelle\u003c/li\u003e\n\u003cli\u003eCoaching-Angebote und Möglichkeiten zur Persönlichkeitsentwicklung in einer wertschätzenden Arbeitsatmosphäre\u003c/li\u003e\n\u003cli\u003eGratis Fitnessstudio-Mitgliedschaft über Interfit und weitere attraktive Mitarbeitervergünstigungen\u003c/li\u003e\n\u003cli\u003eVertrauensarbeitszeit. Je nach Aufgabenfeld sind mobiles Arbeiten und flexible Arbeitszeitmodelle möglich\u003c/li\u003e\n\u003cli\u003eEin attraktives Vergütungspaket inkl. arbeitgeberfinanzierter betrieblicher Altersvorsorge\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSagen Sie's gerne weiter!\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eHaben wir Ihr Interesse geweckt?\u003c/h2\u003e\n\u003cp\u003eDann bewerben Sie sich hier über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBei Fragen steht Ihnen das Recruiting-Team unter Angabe der Stellen-ID: 21782 gerne zur Verfügung. Tel.: 02225 988 3990\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://bwi-it.redirect.your-jobresponse.com/abteilungsleiter_m_w_d_softwareentwicklung_erp_sap_bonn/258757/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://bwi-it.redirect.your-jobresponse.com/abteilungsleiter_m_w_d_softwareentwicklung_erp_sap_bonn/258757/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBck4zIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c52966e3ebd814d3c0661a854d023560fe92d5d8/BWI.jpg"},{"id":"5b690c75-8779-46d7-af25-d24c0e83ca03","type":"Full Time","url":"https://jobs.github.com/positions/5b690c75-8779-46d7-af25-d24c0e83ca03","created_at":"Mon Nov 18 13:20:52 UTC 2019","company":"Anwendungsarchitekt (m/f/d) Portale/ Apps","company_url":"http://aareon.de/karriere","location":"Bundesweit","title":"Anwendungsarchitekt (m/f/d) Portale/ Apps","description":"\u003cp\u003eDie Aareon-Gruppe arbeitet mit ambitionierten Gründern zusammen, um neue Produkte und Dienstleistungen zu entwickeln. Jede neue Geschäftseinheit, die wir schaffen und finanzieren, zielt darauf ab, einen Mehrwert für unsere Kunden zu schaffen und das Lebens- und Arbeitserlebnis für Millionen von Menschen in Europa und darüber hinaus zu verbessern. Wir sind bestrebt, die Digitalisierung unserer Branche maßgeblich zu gestalten. Dazu entwickeln wir neue Geschäftsmodelle und investieren in Innovationen und neue Technologien.\u003c/p\u003e\n\u003cp\u003eFür unseren Digital Bereich suchen wir zum nächstmöglichen Zeitpunkt einen Anwendungsarchitekt (m/f/d) Portale/ Apps in unbefristeter Anstellung.\u003c/p\u003e\n\u003ch2\u003eIhre Aufgabe - funktionale und konzeptionelle Gestaltung sowie Pflege unserer digitalen Lösungen:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSie erarbeiten mit Entwicklern und Solution Managern Lösungskonzepte, Pflichtenhefte sowie Dokumentationen für moderne Anwendungen mit Web- , App- und Sprachschnittstellen unter Berücksichtigung der Kundenanforderungen\u003c/li\u003e\n\u003cli\u003eSie unterstützen Entwickler und Solution Manager beim Wissenstransfer für interne und externe Kunden\u003c/li\u003e\n\u003cli\u003eSie arbeiten eng mit internationalenTeams zusammen\u003c/li\u003e\n\u003cli\u003eSie analysieren und verwalten die Kundenanforderungen an die unterstützten Produkte\u003c/li\u003e\n\u003cli\u003eSie entwerfen und entwickeln Testfallkataloge, testen und dokumentieren Testfälle und arbeiten bei der Entwicklung von Testumgebungen mit\u003c/li\u003e\n\u003cli\u003eSie sind Experte für die Analyse von Anwendungsproblemen zusammen mit unseren Kunden und die Organisation von Fehlerbehebungen in komplexen Umgebungen\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eIhr Profil - Ein kreativer Denker und Problemlöser:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossenes Studium z.B. in (Wirtschafts-) Informatik, Betriebswirtschaftslehre oder vergleichbaren Bereichen; alternativ eine abgeschlossene Berufsausbildung im Bereich Webportale mit entsprechender Berufserfahrung.\u003c/li\u003e\n\u003cli\u003eUmfangreiche Erfahrung bei der Erstellung von technischen Konzepten und Spezifikationen\u003c/li\u003e\n\u003cli\u003eErfahrung in Webentwicklung, App-Entwicklung, REST- Services und Nutzung von Plattformen mit Microservice-Architekturen\u003c/li\u003e\n\u003cli\u003eErfahrung in der Implementierung von Web Security (z.B. OWASP)\u003c/li\u003e\n\u003cli\u003eKompetenz im Projektmanagement und in agilen Methoden\u003c/li\u003e\n\u003cli\u003eÜberzeugendes und selbstbewusstes Auftreten sowie starke Kommunikationsfähigkeit in allen Kundensituationen\u003c/li\u003e\n\u003cli\u003eErfahrung in der Immobilienbranche ist von Vorteil\u003c/li\u003e\n\u003cli\u003eFließende Deutschkenntnisse und ausgezeichnete Englischkenntnisse runden ihr Profil ab\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDas bieten wir: Benefits - Mehr als nur eine Stützposition\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMit Innovation und intelligenter Technologie verändern Sie den Umgang der Menschen mit Immobilien entlang der gesamten Wertschöpfungskette\u003c/li\u003e\n\u003cli\u003eGrenzen verschieben: Arbeiten Sie an unbekannten Herausforderungen und inspirieren Sie Ihre Kollegen\u003c/li\u003e\n\u003cli\u003eFreiraum und Flexibilität bei der persönlichen Arbeitszeitgestaltung, ein Outdoor-Office und die Möglichkeit zum mobilen Arbeiten mit modernen Betriebsmitteln, Teamgeist und eine offene Kommunikation in einer dynamischen internationalen Community\u003c/li\u003e\n\u003cli\u003eUmfassende, individuelle Weiterbildungs- und Entwicklungsmöglichkeiten und regelmäßiges Feedback\u003c/li\u003e\n\u003cli\u003eAttraktive Sozialleistungen (30 Tage Jahresurlaub sowie dienstfrei an Heiligabend, Silvester und Rosenmontag sowie vermögenswirksame Leistungen etc.)\u003c/li\u003e\n\u003cli\u003eDiverse Zusatzleistungen, wie ein gelebtes Gesundheitsmanagement und unser Betriebsrestaurant sowie Fahrradleasing\u003c/li\u003e\n\u003cli\u003eEine gute öffentliche Verkehrsanbindung sowie kostenlose Mitarbeiterparkplätze\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eNeugierig? Wir auch!\u003c/h2\u003e\n\u003cp\u003eBewerben Sie sich gleich online über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e oder unsere Homepage aareon.de/karriere und senden Sie Ihre aussagekräftigen Bewerbungsunterlagen, unter Angabe Ihrer Gehaltsvorstellung und Ihres nächstmöglichen Eintrittstermins, an Victoria Schneemann. Telefonisch steht sie Ihnen unter der Rufnummer +49 (0) 6131 / 301-290 gerne zur Verfügung.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://aareon.redirect.your-jobresponse.com/anwendungsarchitekt_m_f_d_portale_apps_mainz/258763/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://aareon.redirect.your-jobresponse.com/anwendungsarchitekt_m_f_d_portale_apps_mainz/258763/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckYzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bdcca9dee6cb5a4ffebb67c2965fb08d86a5e9f3/aareon.jpg"},{"id":"6cdfdc96-3b27-425d-ad23-a2855cb94876","type":"Full Time","url":"https://jobs.github.com/positions/6cdfdc96-3b27-425d-ad23-a2855cb94876","created_at":"Sat Nov 16 13:28:30 UTC 2019","company":"Quinn Inc","company_url":"http:","location":"Remote","title":"Full-stack developer","description":"\u003cp\u003eLooking for a full stack developer to take the lead on an existing project. The project is almost finished but has significant bugs.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBackend APIs — Ruby on Rails\u003c/li\u003e\n\u003cli\u003eFrontend — React JS + Redux\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail \u003ca href=\"mailto:caroline@tryquinn.com\"\u003ecaroline@tryquinn.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"f08320dd-ed1a-4752-b09d-6172db1594ca","type":"Contract","url":"https://jobs.github.com/positions/f08320dd-ed1a-4752-b09d-6172db1594ca","created_at":"Fri Nov 15 20:38:32 UTC 2019","company":"Hoefler\u0026Co.","company_url":"https://www.typography.com","location":"NYC (remote friendly)","title":"Contract Software Developer\u2028 for Web Applications","description":"\u003cp\u003eH\u0026amp;Co, the New York company that designs and publishes fonts, is looking for a smart, ambitious, and detail-oriented front-end developer who loves typography, and is ready to flex their muscles. Come and join us building the next generation of typography.com, and the award-winning discover.typography.com.\u003c/p\u003e\n\u003cp\u003eOur web applications serve a rare and refreshing audience: tech-savvy designers, the ones who are always running the latest nightly builds on the fastest hardware, but are the first to notice if animation gets triggered on window resize.\u003c/p\u003e\n\u003cp\u003eWe’re looking for a developer who’s up to the challenge of delivering intuitive, performant, and thoughtful experiences to users who know the difference, and have come to expect the best. If you’re looking for an opportunity to do all the things you wish you could at your current job, to join a team of people who share your enthusiasm for what’s possible, and to work for a company that values invention, care, and getting it right, read on.\u003c/p\u003e\n\u003cp\u003eIt goes without saying that we’re looking for candidates with impeccable chops: strong UX instincts, a sharp eye for detail, a mastery of current web technologies and practices, and an unshakable understanding of how the servers come together to deliver the site. You must be fluent in JavaScript using ReactJS and CSS3/HTML5, be familiar with a stylesheet language such as SASS, and live and breathe web standards and optimization. Come in with a list of technologies you’re excited to explore.\nHands-on experience with digital typography is desirable, but not required.\nThis is a contract position, available for either remote work, or working on-site at our New York office, or a combination of the two. The position is open to US citizens or those with authorization to work in the US.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKey Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with our creative team to develop, implement, refine, and deploy new features and functionality across our web properties (typography.com, discover.typography.com, and try.typography.com)\u003c/li\u003e\n\u003cli\u003eWork with our technology and product management team to review project requirements, define criteria for testing, and work with technical management to assess project feasibility within the allotted timetable and budget\u003c/li\u003e\n\u003cli\u003eDevelop and manage a web toolchain including build tools, preprocessors, and open- source libraries. You should be familiar with software such as React, Redux, Yarn, ES6, webpack, PostCSS, and other modern front-end development tools and methodologies\u003c/li\u003e\n\u003cli\u003eUnderstand user needs and behavior by utilizing site analytics, user testing, and data modeling, to refine and improve both web applications and back-office utilities\u003c/li\u003e\n\u003cli\u003eImplement refinements to existing services and create new ones, in order to address changes in standards, customer expectations, behavior patterns, and best practices\u003c/li\u003e\n\u003cli\u003eCoordinate version deployment within a quality assurance framework, using standards and processes that ensure that projects meet defined conditions and specifications\u003c/li\u003e\n\u003cli\u003eMaintain up-to-date knowledge of standards, emerging technologies, industry trends, and best practices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequired Qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA Bachelor's Degree in a technical or design field, or equivalent experience\u003c/li\u003e\n\u003cli\u003eIndustry experience developing with current versions of HTML, CSS\u003c/li\u003e\n\u003cli\u003eStrong command and professional experience in JavaScript, ES6, and React implemented with RESTful APIs\u003c/li\u003e\n\u003cli\u003eStrong command of web standards, responsive and adaptive design, progressive enhancement and graceful degradation, optimization techniques, dynamic content retrieval, state management, and techniques for accessibility and device-portability\u003c/li\u003e\n\u003cli\u003eExperience writing maintainable code with thorough test coverage, using git SCM and git flow\u003c/li\u003e\n\u003cli\u003eWork experience with Linux/Apache/MySQL/PHP development\u003c/li\u003e\n\u003cli\u003eExperience with CMS theming, multiple frameworks, and databases\u003c/li\u003e\n\u003cli\u003eWork experience with Amazon Web Services (AWS)\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease send a letter and résumé to Jimmy Mooney at \u003ca href=\"mailto:mooney@typography.com\"\u003emooney@typography.com\u003c/a\u003e. You’re welcome to include any other material that you feel distinguishes you as a candidate. Candidates only, no recruiters or third parties, please.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcTEzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--175e6db44aae3f5ffea51cd5e7a7c18588983d1f/icon-384x384.png"},{"id":"95ca1ef3-1140-4b86-b08a-855b1f612ae4","type":"Full Time","url":"https://jobs.github.com/positions/95ca1ef3-1140-4b86-b08a-855b1f612ae4","created_at":"Fri Nov 15 19:02:11 UTC 2019","company":"Yellowdig","company_url":"https://yellowdig.com/","location":"Philadelphia","title":"Frontend Developer","description":"\u003cp\u003eYellowdig is looking for a Frontend Developer to join the team and take on aspects of our user interface and customer experience. We're looking for a candidate who has a strong background with modern javascript and a keen sense of design and style.\u003c/p\u003e\n\u003cp\u003eWe are a dedicated team committed to solving some of the most challenging problems in education. How can today’s educators keep tomorrow’s students engaged and motivated? Our proven social learning platform has demonstrated higher engagement and learning outcome through collaboration, content curation and gamification.\u003c/p\u003e\n\u003cp\u003eYou will work with our rapidly growing customer base to translate their needs into well designed features and functionality.\u003c/p\u003e\n\u003cp\u003eYou:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eare a self-starter, independent and resourceful\u003c/li\u003e\n\u003cli\u003ehave shipped frontend code to end users\u003c/li\u003e\n\u003cli\u003ework well on in a startup environment\u003c/li\u003e\n\u003cli\u003eare interested in improving education\u003c/li\u003e\n\u003cli\u003eare flexible in sharing responsibility and wearing different hats\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTechnologies:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eES6 Javascript\u003c/li\u003e\n\u003cli\u003eReact\u003c/li\u003e\n\u003cli\u003eRedux\u003c/li\u003e\n\u003cli\u003eCSS/Sass\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus Points (not required):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eexperience with functional programming techniques\u003c/li\u003e\n\u003cli\u003eClojure/Clojurescript\u003c/li\u003e\n\u003cli\u003eDatomic\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCompensation:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive base\u003c/li\u003e\n\u003cli\u003eStock options\u003c/li\u003e\n\u003cli\u003eFully funded health, dental, vision and life insurance\u003c/li\u003e\n\u003cli\u003eOpportunity for rapid career growth\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLocation: Philadelphia, USA (Center City)\u003c/p\u003e\n\u003cp\u003eOpportunity to work with exceptionally talented peers in a fast paced start-up environment.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:brian@yellowdig.com\"\u003ebrian@yellowdig.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://github.com/bhurlow\"\u003ehttps://github.com/bhurlow\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXAzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a81c9f6539c7a4f2375e6e2f958a9715f156a976/yellowdig-logo.png"},{"id":"bb4ec848-c64c-4c91-8d2c-63d32832936c","type":"Full Time","url":"https://jobs.github.com/positions/bb4ec848-c64c-4c91-8d2c-63d32832936c","created_at":"Fri Nov 15 16:28:15 UTC 2019","company":"ATS Acoustics","company_url":"https://www.atsacoustics.com/","location":"Champaign IL","title":"Full LAMP Stack Developer","description":"\u003cp\u003eIf you have extensive developer experience and you prefer to work on IT systems from top to bottom in a small business environment, we might be looking for each other.\u003c/p\u003e\n\u003cp\u003eWe are a successful and growing manufacturing business of 30+ employees. In response to our business growth we are transitioning our IT department from a one-person shop to a small team. On this team you’ll have direct access to work on everything from Linux server administration to creating the next generation of our business applications, to web front-end development. You’ll interface directly with our team of 4 operational managers to learn their IT needs, and support the success of the business by modifying and extending our custom software systems.\u003c/p\u003e\n\u003cp\u003eSince this is a small team, we are looking for highly experienced, sharp, and interpersonally effective individuals who are eager and competent to take on significant responsibility and advanced technical challenges.\u003c/p\u003e\n\u003cp\u003eWe love agile development, simple and elegant technical solutions, and a user-focused philosophy of service and support. Our tech stack is LAMP-centric. If you love Linux and open-source tools, we’ll get along great. If you love Microsoft products, and the phrase “Windows server” doesn’t make you twitchy… well, we’re never going to understand each other.\u003c/p\u003e\n\u003cp\u003eWe hustle to get significant development work done every week. We work hard and focus from 8 to 5, Monday - Friday. We have lives/families too, and we don’t work evenings and weekends (with rare exceptions to address a downtime or security concern).\u003c/p\u003e\n\u003cp\u003eEssential Skills: Strong conceptual understanding of systems and coding logic. Strong PHP coding or similar. MySQL or other database-driven application development. HTML.\u003c/p\u003e\n\u003cp\u003eHelpful Skills: Perl coding, Linux administration, MySQL administration, Javascript, basic network configuration.\u003c/p\u003e\n\u003cp\u003eCompensation: Salary $100,000. Three weeks paid vacation. PTO, retirement, and QSEHRA health benefit.\u003c/p\u003e\n\u003cp\u003eWe celebrate diversity and we are committed to creating an inclusive environment for all employees. We encourage all interested candidates to apply.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSend your resume to \u003ca href=\"mailto:techteam@atsacoustics.com\"\u003etechteam@atsacoustics.com\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVozIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3eaa9ab32d62b8c3740a26d9057126af65f7cf34/ATSAcousticsLogoHorizontal.jpg"},{"id":"6b01cab3-911e-4d32-b195-bc42bc05e6cd","type":"Part Time","url":"https://jobs.github.com/positions/6b01cab3-911e-4d32-b195-bc42bc05e6cd","created_at":"Fri Nov 15 09:32:08 UTC 2019","company":"Geektastic","company_url":"https://geektastic.com/","location":"Remote","title":"Code Challenge Reviewer - 100% Remote - £50 per hour - Java, JavaScript, PHP, Python, C#, Ruby, CSS/HTML, SQL, Scala, iOS or Android","description":"\u003ch3\u003eFancy earning extra cash reviewing code challenge submissions from any location?\u003c/h3\u003e\n\u003cp\u003eWe pay you \u003cstrong\u003e£25\u003c/strong\u003e for each code challenge you review (30 minutes review time).  You can do as many or as few as you want per week.\u003c/p\u003e\n\u003cp\u003eWe are looking for highly talented Java, JavaScript, PHP, Python, C#, Ruby, Scala, iOS and Android developers\u003c/p\u003e\n\u003cp\u003ePlease read some comments made by our reviewers on \u003ca href=\"https://www.quora.com/How-reliable-is-Geektastic-Has-anyone-earned-a-reasonable-amount-by-being-a-code-reviewer\"\u003eQuora here\u003c/a\u003e \u003c/p\u003e\n\u003cp\u003eWe pay you via Transferwise, Revolut or Payoneer at the end of the month (unless you are in the UK, in which case we bank via bank transfer). \u003c/p\u003e\n\u003cp\u003eTo become part of the team you just need to register with us at \u003ca href=\"https://geektastic.com/?utm_source=github\u0026amp;utm_medium=jobad\u0026amp;utm_content=jobad\u0026amp;utm_campaign=1012\"\u003eGeektastic\u003c/a\u003e and take some code challenges. These are reviewed by our expert team (we need to know how great you are :))\u003c/p\u003e\n\u003cp\u003eOnce you are part of the distributed team you will then be notified on our Slack channel when a new challenge is ready to be reviewed.\u003c/p\u003e\n\u003cp\u003eFeel free to email \u003ca href=\"mailto:hello@geektastic.com\"\u003ehello@geektastic.com\u003c/a\u003e if you have any questions\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease register online @ \u003ca href=\"https://geektastic.com/?utm_source=github\u0026amp;utm_medium=jobad\u0026amp;utm_content=jobad\u0026amp;utm_campaign=1012\"\u003eGeektastic.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVIzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--11480b0c335acc8d7e24cafba06d1747870cc47e/geektastic-logo_Logo-Square-B-W-02%204500%20pix.png"},{"id":"7d300a20-f648-4d6c-9cf4-c24a5133e0d0","type":"Full Time","url":"https://jobs.github.com/positions/7d300a20-f648-4d6c-9cf4-c24a5133e0d0","created_at":"Fri Nov 15 04:17:06 UTC 2019","company":"Balto Software","company_url":null,"location":"St. Louis","title":"DevOps Engineer","description":"\u003cp\u003eAre you interested in joining a fast-growing tech startup in the heart of Downtown St. Louis? Balto is looking for our first DevOps engineer to join Balto on the ground-floor, grow alongside the organization, and ultimately nurture and develop the Balto DevOps team.\u003c/p\u003e\n\u003cp\u003eOn day one, you'll be tasked with monitoring Balto's production system. In addition, you’ll be expected to:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMake high-pressure decisions in critical situations, including outages.\u003c/li\u003e\n\u003cli\u003eWork alongside Balto's engineering team to help people understand how their code will run in a production environment.\u003c/li\u003e\n\u003cli\u003ePerform research and make decisions around Balto's production architecture, including process designs for our AWS security group to ultimately play a lead role in an eventual move to containerization. In the long term, we hope this person will help establish and lead Balto's Reliability Team.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou should have experience with the following systems:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLinux (Ubuntu Server).\u003c/li\u003e\n\u003cli\u003eAWS (EC2).\u003c/li\u003e\n\u003cli\u003eVMs and Containers.\u003c/li\u003e\n\u003cli\u003eUnixy tools like bash, git, and systems.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAdditional Skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbility to develop, follow, and roll out new processes that maintain and improve Balto’s reliability.\u003c/li\u003e\n\u003cli\u003eAbility to make critical decisions under pressure.\u003c/li\u003e\n\u003cli\u003ePrevious DevOps or engineering experience (2-3 years minimum).\u003c/li\u003e\n\u003cli\u003eBasic comfort with code and terminal environments.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSome of our benefits include\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEquity Stock Options\u003c/li\u003e\n\u003cli\u003ePTO and Paid Holidays\u003c/li\u003e\n\u003cli\u003eHealth Insurance, including Dental and Vision\u003c/li\u003e\n\u003cli\u003eLife and Disability Insurance\u003c/li\u003e\n\u003cli\u003eFree Parking/Commuter Benefits\u003c/li\u003e\n\u003cli\u003eT-REX membership\u003c/li\u003e\n\u003cli\u003eDog-friendly office\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBalto recently made an enormous investment to develop our DevOps environment. It's already a crucial component of our success and our ability to continue to build new and exciting features. We are incredibly excited to welcome our first DevOps engineer to the Balto team.\u003c/p\u003e\n\u003cp\u003eBalto is an artificial intelligence tool that transcribes and analyzes sales calls in real-time to deliver live recommendations to sales reps while they navigate their calls. Sales reps use Balto to improve their communication skills, better understand customers’ needs, and consistently remember the key points that they need to address on every call. At Balto, you will experience firsthand the limitless passion and critical strategy that go into building a technology company from the ground up.\u003c/p\u003e\n\u003cp\u003eBalto is headquartered in the T-REX incubator, an innovative space in downtown St. Louis that houses a community of technologists and entrepreneurs. If you are excited about contributing to a successful, early-stage startup, please apply.\u003c/p\u003e\n\u003cp\u003eBalto is an equal opportunity employer and does not discriminate against any applicant on the basis of race, color, religion, creed, national origin, sex, gender identity, sexual preference, age, and veteran or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eVisit \u003ca href=\"https://jobs.lever.co/baltosoftware/cc6612eb-d60e-4df9-b80a-9967e54451b6?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/baltosoftware/cc6612eb-d60e-4df9-b80a-9967e54451b6?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e to apply\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDkzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c88028a209331a43c726930dd5ebcffef3ae2433/Balto%20Logo.png"},{"id":"61a77109-af46-4d9b-8bf8-724b10db0455","type":"Full Time","url":"https://jobs.github.com/positions/61a77109-af46-4d9b-8bf8-724b10db0455","created_at":"Thu Nov 14 21:22:09 UTC 2019","company":"Red Hat","company_url":"https://www.redhat.com/en/jobs","location":"United States (East Coast Preferred) ","title":"Principal Software Engineer","description":"\u003cp\u003eCompany description\nAt Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.\u003c/p\u003e\n\u003cp\u003eJob summary\nThe Red Hat Engineering team is looking for a Principal Software Engineer to join us in Westford, MA to work on the KubeVirt project. In this role, you will design and implement virtualization solutions for containers and virtual machines (VMs), contributing to industry-leading technologies like Kubernetes, Red Hat OpenShift, libvirt, and QEMU. As a part of a geographically distributed team you will collaborate with multiple Red Hat engineering teams and open source communities around the globe. You’ll need to be motivated and curious with a passion for problem solving, Linux technologies, and open source.\u003c/p\u003e\n\u003cp\u003ePrimary job responsibilities\nPlay an active role in container and virtualization-related projects and communities, such as KubeVirt, Kubernetes, Red Hat OpenShift, libvirt, and QEMU\nCreate and guide new feature development; contribute to open source projects in Golang and Python\nIntegrate changes in multiple projects and services into a consumable feature\nSubmit patches for bug fixes to the community and review patches from other members\nWork with the Quality Engineering (QE) team to ensure projects are tested correctly\nPublicize the team's work through blogs, web postings, or conference talks\nRequired skills\nBachelor's degree in computer science or equivalent work experience\nInterest in the container ecosystem (Kubernetes, Red Hat OpenShift) and Golang\nExperience in storage and storage protocols, including NFS, iSCSI, etc.\n5+ years of experience in a Linux environment working with either Golang, Python, Java, or C or C++\nExperience in Linux system programming\nMulti-threaded programming and management of shared resources synchronization in complex environments\nMotivated with the ability to quickly learn new technologies\nGood written and verbal communication skills in English\nFamiliarity with virtualization, clusters, and container-related technologies like Kubernetes, Red Hat OpenShift, Kernel-based Virtual Machine (KVM), and Red Hat OpenStack Platform is a plus\nOpen source development experience is a plus\u003c/p\u003e\n\u003cp\u003eRed Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, veteran status, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.\u003c/p\u003e\n\u003cp\u003eRed Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply online at \u003ca href=\"https://red.ht/PrSWEKubevirt\"\u003ehttps://red.ht/PrSWEKubevirt\u003c/a\u003e\nEmail resume direct to \u003ca href=\"mailto:dedson@redhat.com\"\u003ededson@redhat.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"d7d97b77-09d6-4b93-a482-b0ad1f18eefa","type":"Full Time","url":"https://jobs.github.com/positions/d7d97b77-09d6-4b93-a482-b0ad1f18eefa","created_at":"Thu Nov 14 17:28:37 UTC 2019","company":"Standard","company_url":"https://standard.tv/pages/jobs","location":"Remote","title":"Senior Backend Engineer (Django)","description":"\u003cp\u003eAbout the Role\u003c/p\u003e\n\u003cp\u003eStandard is looking for a senior backend engineer to build, maintain, and shape the APIs that support our applications for online video creators. You’ll be joining a team of senior full stack and mobile engineers, and will have lots of autonomy and immediate impact in controlling the direction of the application and the technology decisions surrounding it. You’ll work with creators directly to help identify needs and deliver products to support their work.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOwn, develop, and maintain the APIs—written in Django with a sprinkling of Ruby—that support our applications for creators, sponsors, and end-users\u003c/li\u003e\n\u003cli\u003eOwn and develop the web application used by creators and sponsors currently built in React, Redux, SASS and Django\u003c/li\u003e\n\u003cli\u003eOwn and develop an analytics pipeline used to generate insides from various data sources (YouTube, Patreon, podcast analytics, et cetera)\u003c/li\u003e\n\u003cli\u003eHelp develop the technology roadmap going forward\u003c/li\u003e\n\u003cli\u003eTake new features from idea to shipped product\u003c/li\u003e\n\u003cli\u003eWork with creators and sponsors to identify improvements\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat We're Looking For\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of back-end engineering experience building and maintaining user-facing applications and APIs, preferably with Django\u003c/li\u003e\n\u003cli\u003eExperience building applications on AWS\u003c/li\u003e\n\u003cli\u003eFront end experience a plus, but not required (React, Redux, CSS)\u003c/li\u003e\n\u003cli\u003eExcited about online video and podcasts\u003c/li\u003e\n\u003cli\u003eGood communicator\u003c/li\u003e\n\u003cli\u003ePatient \u0026amp; considerate\u003c/li\u003e\n\u003cli\u003eIndependent \u0026amp; self-motivated\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePerks\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary, plus equity in Standard\u003c/li\u003e\n\u003cli\u003eFlexible work hours and vacation policy\u003c/li\u003e\n\u003cli\u003eDiverse, socially-minded team of nice people\u003c/li\u003e\n\u003cli\u003eAccess to our wonderful NYC and Denver offices\u003c/li\u003e\n\u003cli\u003eMedical, dental, and vision plans (for US-based employees)\u003c/li\u003e\n\u003cli\u003e401(k) and other benefits\u003c/li\u003e\n\u003cli\u003eYou'll get to work with some of the best creators on YouTube\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout Us\u003c/p\u003e\n\u003cp\u003eStandard is a sort of talent management agency and production company for thoughtful YouTubers and podcasters. We do a lot of things, so it's hard to explain it all in a single paragraph, but our mission is to empower independent creators. Most of our time is spent talking or working with the creators directly, one on one or in a group, coming up with better tools and toys for them.\u003c/p\u003e\n\u003cp\u003eWe're a distributed company. We have offices in NYC and Denver, but more than 50% of the team is remote, in exotic locations like the UK, the Netherlands, France, and Ohio.\u003c/p\u003e\n\u003cp\u003eBecause we're distributed and because most of our tasks aren't immediately time-sensitive we don't really have operating hours, per se. There are things to do and meetings to be had, but we pride ourselves on our flexibility. We think this makes Standard a great place to work for people with families, or whose productive hours tend to be outside of the 9-5. We care about what you do more than when you do it.\u003c/p\u003e\n\u003cp\u003eHow We Hire\u003c/p\u003e\n\u003cp\u003eWe think that diversity is important. Many of us have non-traditional backgrounds. We work in the online education space, so we understand how much can be learned on your own, on the Internet, outside of a classroom.\u003c/p\u003e\n\u003cp\u003eWe're looking for people who are curious and passionate. Our team should be made up of people of all sorts of colors, genders, and sizes, who can help to expand our perspective and improve our ability to treat our creators and our audience with thoughtfulness and empathy.\u003c/p\u003e\n\u003cp\u003eIf that sounds like you, we're happy to care less how many years of experience you have or where you went to school. Apply anyway. And if you have any feedback on how we could reach or appeal to a more diverse pool of talent, get in touch.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSend an email to \u003ca href=\"mailto:jobs@standard.tv\"\u003ejobs@standard.tv\u003c/a\u003e and include:\u003c/p\u003e\n\u003cp\u003e• The position.\u003c/p\u003e\n\u003cp\u003e• What excited you about the role.\u003c/p\u003e\n\u003cp\u003e• Your resume, obviously.\u003c/p\u003e\n\u003cp\u003e• Links to relevant work available online (github, etc).\u003c/p\u003e\n\u003cp\u003e• A note or two about your interests outside of work. This is usually more interesting than the resume part.\u003c/p\u003e\n\u003cp\u003eTip: \"tv\" is part of our domain, not our name.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDEzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cd4248692a86597902a2b806e7f6c2d090014c42/standard_star_blue.png"},{"id":"33999559-d55f-4326-bd63-e6c6fafc93ca","type":"Full Time","url":"https://jobs.github.com/positions/33999559-d55f-4326-bd63-e6c6fafc93ca","created_at":"Thu Nov 14 16:36:50 UTC 2019","company":"Delphian Systems, LLC","company_url":"https://delphiansystems.com/","location":"Buffalo Grove, IL","title":"Senior .NET Software Engineer","description":"\u003cp\u003eDelphian Systems, LLC is looking for a Senior .NET Developer to join our team and build functional applications and websites.\u003c/p\u003e\n\u003cp\u003eFounded in 2011 with a team of trailblazing IoT pioneers and an end-to-end solution in the Smart Building IoT space Delphian is in the process of scaling up its business with existing and new strategic OEM partners.\u003c/p\u003e\n\u003cp\u003eThe Delphian solution comprises a full IoT stack technology platform, a commercial smart product platform, and salient services that allow OEMs to migrate successfully their product offerings and business models to the new IoT market economy. Key benefits are market dominance with higher value product ecosystems, maximum speed-to-market, and lowest total life-cycle costs. Delphian successes and capabilities span applications in security, access control, safety, convenience, and intelligent automation for building managers, tenants, visitors, and service providers.\u003c/p\u003e\n\u003cp\u003eSenior .NET Developer responsibilities include object-oriented programming concepts, developing comprehensive unit tests, writing testable code and building IoT applications/systems.\u003c/p\u003e\n\u003cp\u003eUltimately, you'll use your software engineering skills to develop highly scalable, distributed systems and services.\u003c/p\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpert knowledge of SDLC processes and best practices.\u003c/li\u003e\n\u003cli\u003eExpert .NET Framework/.NET Core application architecture and C# skills.\u003c/li\u003e\n\u003cli\u003eExpert knowledge of object-oriented programming concepts.\u003c/li\u003e\n\u003cli\u003eExpert knowledge of various application architectures with a focus on Service Oriented\nArchitecture and building high-volume distributed systems.\u003c/li\u003e\n\u003cli\u003eExpert knowledge of database technologies, including but not limited to Microsoft SQL Server, SQL\nAzure, Cosmos DB and other database technologies.\u003c/li\u003e\n\u003cli\u003eExpert knowledge of O/RM technologies, including .NET Entity Framework, EFCore and\nNHibernate.\u003c/li\u003e\n\u003cli\u003eStrong experience with developing comprehensive unit tests and writing testable code.\u003c/li\u003e\n\u003cli\u003eStrong experience with Docker, DevOps procedures, CI/CD pipelines and source control systems.\u003c/li\u003e\n\u003cli\u003eStrong familiarity with Microsoft Azure offerings and some familiarity of AWS and GCP offerings.\u003c/li\u003e\n\u003cli\u003eExperience participating in Scrum ceremonies such as Daily Scrum, Spring Review \u0026amp;\nRetrospective.\u003c/li\u003e\n\u003cli\u003eFront-end development experience using ASP.NET MVC, React, Angular, HTML/CSS, Javascript\nand Typescript.\u003c/li\u003e\n\u003cli\u003eExperience with building IoT applications/systems.\u003c/li\u003e\n\u003cli\u003eKnowledge of UI patterns and best practices, including responsive and mobile-first.\u003c/li\u003e\n\u003cli\u003eSoftware as a Service (SaaS) experience.\u003c/li\u003e\n\u003cli\u003eKubernetes deployment/management experience.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree in computer science or a related field.\u003c/li\u003e\n\u003cli\u003e8+ years of experience as a software developer.\u003c/li\u003e\n\u003cli\u003eExperienced in the use of Agile Work item management tools such as JIRA and Azure DevOps.\u003c/li\u003e\n\u003cli\u003eExcellent interpersonal communications. Must have the ability to help product managers\nformulate/articulate decisions on the course of action.\u003c/li\u003e\n\u003cli\u003eComfortable in presenting to senior management and client representatives.\u003c/li\u003e\n\u003cli\u003eSelf-motivated to learn new tools, technology, \u0026amp; process, and be forward compatible.\u003c/li\u003e\n\u003cli\u003eExpertise in a wide variety of software architecture and engineering concepts, practices and\nprocedures, relying on extensive experience and judgment to plan and accomplish goals.\u003c/li\u003e\n\u003cli\u003eFlexible to shifting priorities.\u003c/li\u003e\n\u003cli\u003eLegally authorized to work in the US without sponsorship.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease send all resumes to: \u003ca href=\"mailto:office@jvapartners.com\"\u003eoffice@jvapartners.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFYzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--07e8091eb758add1a2b754db060297c5fd154108/DelphianSystems-Logo%202.jpg"},{"id":"a8bba8df-ee34-4084-bfd5-691639f18942","type":"Contract","url":"https://jobs.github.com/positions/a8bba8df-ee34-4084-bfd5-691639f18942","created_at":"Thu Nov 14 14:21:25 UTC 2019","company":"Bank for International Settlements","company_url":"http:","location":"Basel, Switzerland","title":"Senior .NET/Web Applications Developer","description":"\u003cp\u003eThe Bank for International Settlements is an international organisation which fosters international monetary and financial cooperation via wide-ranging banking, economic research and policy coordination activities.\u003c/p\u003e\n\u003cp\u003eYour contribution to our mission\u003c/p\u003e\n\u003cp\u003eThe Corporate Applications and Workflow (CAW) team is responsible for developing and maintaining software platforms that are used across the Bank to provide core shared services and automate business processes. These platforms help and enable the different business units (HR, Finance, Security and other shared services) to provide their services to the entire Bank.\u003c/p\u003e\n\u003cp\u003eYou will apply your deep knowledge in web and Microsoft technologies to deliver projects addressing a wide variety of business issues. You will work in a variety of applications, ranging from custom-built software to commercial off-the-shelf products. There will also be opportunities to supervise external developers in project work.\u003c/p\u003e\n\u003cp\u003eAs the team follow agile principles and techniques, you should be comfortable working in that type of environment and have prior experience with one of the major agile methodologies.\u003c/p\u003e\n\u003cp\u003ePrincipal accountabilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eProvides technical leadership and product management expertise for several corporate applications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProvides leadership in agile processes and rituals; mediates team discussions\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAnalyses business requirements, extracts technological needs from users’ requirements and translates them into workable product backlog items.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEnsures that the design meets business requirements and that stakeholders understand the benefits, drawbacks, risks, costs and time scales of design decisions.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProvides production support for designated applications on her/his own or with the help of internal or external resources.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCo-ownership of Microsoft Azure DevOps Server 2019, responsible for product management, support and enhancements.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eManages small projects and coordinates activities with team and stakeholders\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWork experience and skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAt least five years’ experience in designing and  implementing large scale .Net and web applications.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong hands-on experience with several of the following technologies: C#, Web API, Entity Framework, AngularJS, TypeScript, Javascript, SQL Server, Microsoft WF.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSolid knowledge of design and integration patterns\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSolid knowledge of multi-tier architectures and microservices\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIn depth understanding of best practices and tooling for CI/CD pipelines, Azure DevOps 2019, automated testing, code quality and package management.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHands on experience with containers is a plus.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGood knowledge of SOA and DDD.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience in business process modelling/implementation.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with secure software development lifecycle is a plus.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eVery good communication skills; ability to establish strong working relationships with business areas and infrastructure teams.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility to take the initiative and organise own work; flexibility; service orientation; ability to perform under pressure against tight deadlines.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGood problem solving and root cause analysis approach.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAdditional informations\u003c/p\u003e\n\u003cp\u003eEmployment - Duration: 3 years\nContract type: Fixed-term\nApplication Deadline: 30/11/2019\u003c/p\u003e\n\u003cp\u003eAll new staff members are recruited on a fixed-term basis without expectation either of any contract renewal or conversion. The contract may however be extended or converted to an open-ended one at the end of the term, subject to organisational needs and individual performance. The BIS is fully committed to equal opportunity employment and strives for diversity among its staff.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobstats.robopost.com/count/clic.php?v=216910\u0026amp;j=1994\"\u003ehttps://jobstats.robopost.com/count/clic.php?v=216910\u0026amp;j=1994\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEYzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d472b4c9f6662f6df73d3376de375ea871270c55/BIs.jpg"},{"id":"4ba15f3b-ae72-45b8-8a39-232d2ff0d8db","type":"Contract","url":"https://jobs.github.com/positions/4ba15f3b-ae72-45b8-8a39-232d2ff0d8db","created_at":"Thu Nov 14 14:14:52 UTC 2019","company":"Bank for International Settlements","company_url":"http:","location":"Basel, Switzerland","title":"Senior Solutions Architect - SharePoint and DevOps","description":"\u003cp\u003eThe Bank for International Settlements is an international organisation which fosters international monetary and financial cooperation via wide-ranging banking, economic research and policy coordination activities.\u003c/p\u003e\n\u003cp\u003eYour contribution to our mission:\u003c/p\u003e\n\u003cp\u003eThe Corporate Applications and Workflow (CAW) team is responsible for developing and maintaining software platforms that are used across the Bank to provide core shared services and automate business processes. These platforms help and enable the different business units (HR, Finance, Security and other shared services) to provide their services to the entire Bank.\u003c/p\u003e\n\u003cp\u003eYou will apply your deep knowledge in SharePoint and DevOps technologies to deliver projects addressing a wide variety of business issues. You will work in a variety of projects, ranging from small and tactical to Bank-wide strategic projects. There will also be opportunities to supervise external developers in project work.\u003c/p\u003e\n\u003cp\u003eAs the team follow agile principles and techniques, you will need to be comfortable working in that type of environment and have prior experience with one of the major agile methodologies.\u003c/p\u003e\n\u003cp\u003ePrincipal accountabilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eProvide technical leadership and product management expertise for the SharePoint platform\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProvide leadership in agile processes and rituals; mediates team discussions\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAnalyse business requirements, extract technological needs from users’ requirements and translates them into workable product backlog items\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEnsure that the design meets business requirements and that stakeholders understand the benefits, drawbacks, risks, costs and time scales of design decisions\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProvide production support for SharePoint\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCo-ownership of Microsoft Azure DevOps Server 2019, responsible for product management, support and enhancements\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eManages small projects and coordinates activities with team and stakeholders\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWork experience and required skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAt least five years’ experience in designing and  implementing large scale SharePoint installations\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIdeally a Microsoft professional certification on SharePoint 2016 and/or 2019\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with SharePoint 2019 and SharePoint application model is an asset\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong hands-on experience with several of the following technologies: C#, Web API, TypeScript, Javascript, SQL Server\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSolid knowledge of design and integration patterns\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSolid knowledge of multi-tier architectures and microservices\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIn depth understanding of best practices and tooling for CI/CD pipelines, Azure DevOps 2019, automated testing, code quality and package management\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with SharePoint 2019 upgrade projects, including gap analysis and migration and testing strategies\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience using SharePoint as Records Management solution or integrating SharePoint with Records Management solutions is considered an asset\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with automation testing, including frameworks, approaches and techniques\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with secure software development lifecycle\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eVery good communication skills; ability to establish strong working relationships with business areas and infrastructure teams\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility to take the initiative and organise own work; flexibility; service orientation; ability to perform under pressure against tight deadlines\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGood problem solving and root cause analysis approach\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility to formally document and communicate complex system specifications\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAdditional informations :\u003c/p\u003e\n\u003cp\u003eEmployment - Duration: 3 years\nContract type: Fixed-term\nApplication Deadline: 30/11/2019\u003c/p\u003e\n\u003cp\u003eAll new staff members are recruited on a fixed-term basis without expectation either of any contract renewal or conversion. The contract may however be extended or converted to an open-ended one at the end of the term, subject to organisational needs and individual performance. The BIS is fully committed to equal opportunity employment and strives for diversity among its staff.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobstats.robopost.com/count/clic.php?v=216905\u0026amp;j=1994\"\u003ehttps://jobstats.robopost.com/count/clic.php?v=216905\u0026amp;j=1994\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzkzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3c296ca1c9717c657629e0506ddbab40dce37029/BIs.jpg"},{"id":"e69fe62d-0172-41c2-9495-a0bf04e69973","type":"Full Time","url":"https://jobs.github.com/positions/e69fe62d-0172-41c2-9495-a0bf04e69973","created_at":"Thu Nov 14 14:14:41 UTC 2019","company":"Greenwheels GmbH","company_url":"https://www.greenwheels.com/nl/","location":"Dortmund","title":"Medior .Net Developer","description":"\u003cp\u003e\u003cem\u003eStädte lebenswerter machen,\u003c/em\u003e das ist unser Motto. Das setzen wir bei Greenwheels jeden Tag in die Tat um. Ein Greenwheels-Auto ersetzt 11 private Autos und so schaffen wir Platz in unseren immer voller werdenden Städten. Wir wissen nur allzu gut, dass man ein Auto nicht besitzen muss, um es nutzen zu können. Wir bieten unseren Service in Deutschland und den Niederlanden an, unser Büro in Deutschland ist in Dortmund, wo wir mit rund 8 Kollegen arbeiten.\u003c/p\u003e\n\u003cp\u003eDas Carsharing-Konzept basiert zu einem großen Teil auf unseren IT-Lösungen, und Du, als Medior .NET Developer, kannst uns bei der Weiterentwicklung von Greenwheels wesentlich helfen und das Greenwheels Angebot entscheidend verbessern!\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eMedior .Net Developer\u003c/em\u003e\u003c/h2\u003e\n\u003ch2\u003e\u003cem\u003e(Vollzeit – Dortmund)\u003c/em\u003e\u003c/h2\u003e\n\u003ch2\u003e\u003cem\u003eWas wirst Du tun?\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eAls Medior .Net Developer entwickelst und wartest Du die Systeme und Anwendungen, die von und für Greenwheels verwendet werden. Zusammen mit dem Team kreierst, analysierst und bewertest Du neue Lösungsmöglichkeiten, und setzt diese final um. Um ein gutes Endergebnis für unsere Kunden und Endverbraucher zu erzielen, arbeitest Du eng mit anderen Entwicklern (intern und extern), Testern und verschiedenen Produkt-Ownern zusammen. Unser reguläres IT-Team besteht heute aus acht Personen, von denen sechs in den Niederlanden (Rotterdam) arbeiten. Außerdem arbeiten wir mit externen Partnern in verschiedenen Teilen Europas zusammen.\nWir arbeiten agil, nach der Scrum-Methode, haben DevOps und Tester im Team, verwenden Tools wie Jira und Slack, und wir sind auf dem Weg zu Continuous Delivery und in die „Cloud“.\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eWen suchen wir?\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eAls unser Spitzenkandidat\n•Solltest Du mindestens eine technische Berufsausbildung abgeschlossen haben (Informatik ist von Vorteil)\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHast Du ein paar Jahre Erfahrung als .Net Developer\u003c/li\u003e\n\u003cli\u003eHast Du vorzugsweise Kenntnisse und Erfahrungen mit objektorientierten Programmiersprachen wie C#, .Net, SQL , JSON, REST und Micro Services\u003c/li\u003e\n\u003cli\u003eBist Du neugierig und lernwillig\u003c/li\u003e\n\u003cli\u003eBist Du proaktiv und gründlich bei Deiner Arbeit\u003c/li\u003e\n\u003cli\u003eFreust Du Dich auf die Arbeit in einem internationalen Team\u003c/li\u003e\n\u003cli\u003eKommunizierst Du mit Leichtigkeit, sowohl auf Deutsch als auch auf Englisch.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eWas bieten wir?\u003c/em\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eein marktgerechtes Gehalt\u003c/li\u003e\n\u003cli\u003e30 Urlaubstage im Jahr\u003c/li\u003e\n\u003cli\u003edie Möglichkeit, sich intern weiter zu entwickeln\u003c/li\u003e\n\u003cli\u003eein Rabatt auf ein Greenwheels-Abonnement, weil es toll ist, wenn Du auch ein Greenwheels-Auto fährst\u003c/li\u003e\n\u003cli\u003eflexible Arbeitszeiten, damit Du Deine Arbeit und Deine persönlichen Aktivitäten besser kombinieren kannst\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eWer sind wir?\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eSeit fast 25 Jahren arbeiten wir daran, unsere Städte durch unsere innovativen und nachhaltigen Lösungen zugunsten einer effizienten Mobilität lebenswerter zu machen. Wir sind ein informelles Unternehmen mit fast 50 Mitarbeitern, wo eigentlich jeder Tag ein Casual Friday ist. Wir haben unseren Sitz in den Niederlanden (Rotterdam) und in Dortmund (wo Du arbeiten würdest). Und wir wachsen schneller als je zuvor. Wir sind pragmatisch und bevorzugen kurze Wege bei unserer Arbeit. Endlose Meetings sind definitiv nicht unser Ding! Wir ziehen es vor, sofort anzupacken. Und wenn Du Fragen hast, kannst Du jederzeit bei Deinen Kollegen „vorbeigehen“ und sie fragen.\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eFragen? Oder willst Du Dich gleich bewerben?\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eFür Fragen zu diesem Stellenangebot stehen wir Dir gerne zur Verfügung. Bei Fragen zum Bewerbungsverfahren wende Dich bitte an Dorine Veelders (Personalberaterin) unter \u003ca href=\"mailto:hr@greenwheels.nl\"\u003ehr@greenwheels.nl\u003c/a\u003e. Bei Fragen zur konkreten Stelle kannst Du Dich an unseren IT-Manager (der damit auch Dein Manager würde), Sander Groenenberg, wenden unter \u003ca href=\"mailto:sander.groenenberg@greenwheels.nl\"\u003esander.groenenberg@greenwheels.nl\u003c/a\u003e. Sind Sie ein Recruiter, dann kontaktieren Sie uns bitte nicht, wir nehmen bei Bedarf zu Ihnen Kontakt auf!\u003c/p\u003e\n\u003cp\u003eMöchtest Du Dich jetzt bewerben? Du kannst Deinen Lebenslauf und Dein Anschreiben per E-Mail an Dorine senden unter \u003ca href=\"mailto:solliciteren@greenwheels.nl\"\u003esolliciteren@greenwheels.nl\u003c/a\u003e oder bewirb Dich jetzt über \u003ca href=\"https://vonq.io/370PsZ3\"\u003ediesen Link\u003c/a\u003e! Wir werden uns schnellstmöglich mit Dir in Verbindung setzen! Das gesamte Bewerbungsverfahren besteht aus zwei Interviews und zwei Tests (ein Programmierfall und ein Online-Assessment). Ohne Anschreiben eingereichte Lebensläufe werden wir nicht berücksichtigen, da wir wirklich erfahren wollen, warum Du mit uns zusammenarbeiten möchtest und warum Du glaubst, dass Du zu unserem Unternehmen passt.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/370PsZ3\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzUzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--82489336c8197912955d4f7913f2b9c113bac163/Greenwheels%20logo.png"},{"id":"1b3e439c-9f57-4b41-8546-c8ec502a1aaa","type":"Contract","url":"https://jobs.github.com/positions/1b3e439c-9f57-4b41-8546-c8ec502a1aaa","created_at":"Thu Nov 14 14:07:34 UTC 2019","company":"Bank for International Settlements","company_url":"http:","location":"Basel, Switzerland","title":"Cloud Infrastructure Architect","description":"\u003cp\u003eThe Bank for International Settlements is an international organisation which fosters international monetary and financial cooperation via wide-ranging banking, economic research and policy coordination activities.\u003c/p\u003e\n\u003cp\u003eYour contribution to our mission\u003c/p\u003e\n\u003cp\u003eThe Cloud Engineering team is part of the IT Applications and Platforms group within the Bank’s IT department (IMS). Partnering with other areas of the business, it is responsible for delivering the Bank’s core cloud platforms and services. You will have experience designing and implementing enterprise infrastructure solutions in the public cloud, using multi-vendor IaaS and PaaS services, to facilitate secure hybrid connectivity with existing on-premises infrastructure.\u003c/p\u003e\n\u003cp\u003eThis position is a key hire in a newly created cloud engineering team and will involve working with other areas of the business to enable the organisation to realise its strategic cloud goals. This position will report directly to the Head of Cloud Engineering and will be a key contributor to our enterprise cloud strategy.\u003c/p\u003e\n\u003cp\u003ePrincipal accountabilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eDesign and implement of cloud infrastructure roadmaps, with a focus on public cloud architecture\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContribute to the implementation of a bank-wide cloud adoption and governance framework\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCollate business requirements and translate them into technical solutions\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMaintain and support cloud platforms and services\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContribute toward cloud product management (service management, supplier management, budget preparation, management of enhancements pipeline, compliance with internal policies, release management)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eManage small to medium-size projects.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualification and work experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eMaster’s degree or equivalent experience in a related subject\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAt least five years of demonstrable hands-on experience with IaaS and PaaS, from delivering successful enterprise projects in the public cloud, preferably multi-vendor. Experience with Microsoft Azure is a must-have\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience in architecting public cloud solutions for enterprise level infrastructure workloads\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCloud cost management experience, including planning and optimising services to budget, whilst still being able to scale to performance expectations\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSolid experience in network design, including multi-site and external connectivity, firewall rules and routing protocols. ExpressRoute a plus.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHands-on experience with provisioning and configuration management tools (e.g. Terraform, Puppet, Chef, Ansible)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience designing and implementing cloud governance and controls\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequired skills and knowledge:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eDeep domain expertise of cloud infrastructure solutions; including Windows and Linux IaaS, security, management, storage, networking, monitoring, containers, infrastructure-as-code\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFluency in enterprise infrastructure, networking and security topics with the ability to comfortably work with SMEs from each, translating between both cloud and on-premises concepts\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA natural preference to DevOps orientated practices, with automation and reusability as standard (incl. ARM template and Blueprinting knowhow)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong Identity and Authentication knowledge, including AD/AAD and Federation, OAuth and OpenID\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFluency in scripting languages (e.g. PowerShell, Bash); very strong in PowerShell\nAbility to learn and adopt emerging cloud trends and technologies, across vendors\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAdditional informations:\u003c/p\u003e\n\u003cp\u003eEmployment - Duration: 3 years\nContract type: Fixed-term\nApplication Deadline: 30/11/2019\u003c/p\u003e\n\u003cp\u003eAll new staff members are recruited on a fixed-term basis without expectation either of any contract renewal or conversion. The contract may however be extended or converted to an open-ended one at the end of the term, subject to organisational needs and individual performance. The BIS is fully committed to equal opportunity employment and strives for diversity among its staff.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobstats.robopost.com/count/clic.php?v=216904\u0026amp;j=1994\"\u003ehttps://jobstats.robopost.com/count/clic.php?v=216904\u0026amp;j=1994\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2wzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5e5b835a675c17a44c77ef4b4cedc7aa69e28396/BIs.jpg"},{"id":"3604e65c-373f-436d-9659-ced77c5a1d7f","type":"Part Time","url":"https://jobs.github.com/positions/3604e65c-373f-436d-9659-ced77c5a1d7f","created_at":"Thu Nov 14 12:26:45 UTC 2019","company":"Solera Nederland","company_url":"http://www.solera.com/","location":"Zeist","title":"Software Developer - Vastgoed","description":"\u003cp\u003eMomenteel ontwikkelen we volop nieuwe oplossingen voor de schadeafhandeling van vastgoedobjecten. Dit is een business line die hard groeit. We hebben een gedreven Developer nodig die deze groei samen met het team mogelijk weet te maken. Past dit bij jou?\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eWaarom pas jij bij Solera?\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eSolera NL is onderdeel van het wereldwijd opererende Solera, dat jaarlijks 230 miljoen transacties verwerkt. Met 180.000 klanten in meer dan 90 landen beogen wij de klantervaring te verrijken, voor de 10% van de berijders die jaarlijks schade rijdt maar zeker ook voor de 90% die dat niet doet.\u003c/p\u003e\n\u003cp\u003eVandaag de dag reikt ons platform voorbij de schadeclaim en leveren we oplossingen voor alle momenten in de levenscyclus van een auto, maar gaan door naar de garage waarin je die parkeert én ook het huis dat ernaast staat. We zijn begonnen aan een missie om het goed, beter en anders te doen en op die weg gaan we verder.\u003c/p\u003e\n\u003cp\u003eVanuit Zeist leveren we slimme IT-diensten op het gebied van communicatie, informatie en schades. Dankzij onze diensten kunnen klanten efficiënter communiceren, samenwerken, nauwkeurige risicoanalyses maken en betrouwbare schadeberekeningen opstellen, voor auto én huis. We zetten standaarden neer, leveren vaste bouwstenen en ontwikkelen nieuwe oplossingen. Hier kun jij als ervaren Developer een significante bijdrage aan leveren!\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eWees welkom in een mooi team\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eJe wordt een belangrijk onderdeel van ons development-team. Dit team is bezig om een innovatieve oplossing voor de afhandeling van schades aan huizen te ontwikkelen: een hub tussen alle betrokken partijen (consument, verzekeraar, intermediair, hersteller, expert) die Straight Through Processing (STP) maximaal faciliteert.\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eWat jou kenmerkt? Specialistische kennis, ondernemerschap en innovatiekracht\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eSamen met het team van Developers, een Business Analyst en een Product Owner worden nieuwe diensten en uitbreidingen aan bestaande software gerealiseerd. In het development-team ben je een belangrijke kracht voor het realiseren van onze nieuwe diensten. Ons team werkt agile en is in staat om snel en flexibel op te leveren. Dit vergt intensieve samenwerking tussen collega’s, waarbij we altijd streven naar de juiste mix in kennis en ervaring binnen een team. We zoeken iemand die zich hierin herkent:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMinimaal hbo-niveau en werkzaam op senior niveau;\u003c/li\u003e\n\u003cli\u003eAnalytisch sterk;\u003c/li\u003e\n\u003cli\u003eEnthousiast en gedreven om samen resultaten te boeken;\u003c/li\u003e\n\u003cli\u003eEen innovatieve, creatieve en nieuwsgierige instelling, en goed in staat om zelfstandig te werken;\u003c/li\u003e\n\u003cli\u003eGedreven om kennis en ervaring met anderen te delen;\u003c/li\u003e\n\u003cli\u003eGoede beheersing van de Nederlandse en de Engelse taal.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDaarnaast ben je vertrouwd met onderstaande stack:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMicrosoft Visual Studio, C#, .NET Core;\u003c/li\u003e\n\u003cli\u003eHTML5, JavaScript, SCSS;\u003c/li\u003e\n\u003cli\u003eXML, XML Schema, JSON, JSON Schema, REST API development;\u003c/li\u003e\n\u003cli\u003eMongoDB.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eWij bieden uitstekende arbeidsvoorwaarden, zoals:\u003c/em\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eFlexibele werktijden;\u003c/li\u003e\n\u003cli\u003eAandacht voor vitaliteit, o.a. door korting op een sportabonnement;\u003c/li\u003e\n\u003cli\u003eRuime mogelijkheden voor persoonlijke ontwikkeling d.m.v. training en opleiding;\u003c/li\u003e\n\u003cli\u003eSalarisindicatie per jaar o.b.v. 40u €45.000 – 55.000 all-in (afhankelijk van ervaring).\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eHelp jij onze dienstverlening verder naar een volgend niveau?\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eHerken je jezelf in het profiel? We zien dit graag terug in je CV en een korte motivatie, die kun je sturen naar Sander Huininga (recruiter) via de \u003ca href=\"https://vonq.io/3524a06\"\u003edeze link\u003c/a\u003e. We streven ernaar om binnen twee weken feedback te geven op jouw sollicitatie!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3524a06\"\u003eKlik hier om te solliciteren!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbjUzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9f305aa858b5afc6f108e1fcc278ea879896cb75/Solera%20logo.jpg"},{"id":"82d0832b-05df-4119-87ec-0dcb587df0a2","type":"Full Time","url":"https://jobs.github.com/positions/82d0832b-05df-4119-87ec-0dcb587df0a2","created_at":"Thu Nov 14 09:54:06 UTC 2019","company":"Hochschule Ruhr West","company_url":"http://www.hochschule-ruhr-west.de/","location":"Mülheim an der Ruhr","title":"Wissenschaftliche*r Mitarbeiter*in Sensorik und Infrastruktur  Autonomes Fahren","description":"\u003cp\u003eDie Hochschule Ruhr West wurde im Mai 2009 als staatliche Hochschule gegründet. An unseren Standorten Mülheim an der Ruhr und Bottrop bieten wir Studiengänge aus Technik und Wirtschaft an.\u003c/p\u003e\n\u003cp\u003eWir suchen ab sofort für das Kompetenzzentrum Autonomes Fahren eine* n motivierte* n\u003c/p\u003e\n\u003ch2\u003eWissenschaftliche * n Mitarbeiter * in Sensorik und Infrastruktur – Autonomes Fahren (m/w/d)\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eKennziffer 120-2019, in Vollzeit, Vergütung TV-L bis E 13\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMit dem Kompetenzzentrum Autonomes Fahren soll eine zentrale Anlaufstelle aufgebaut werden, die relevante Themen aufgreift, bündelt und die Mobilitätsakteure u.a. mit Informations- und Beratungsangeboten unterstützt. Im Mittelpunkt stehen dabei die Initiierung eines Lern- und Wissenstransferprozesses über alle Ebenen des Innovationssystems sowie die Anwendung und Verbreitung von Lösungen für die Umsetzung des autonomen Fahrens.\u003c/p\u003e\n\u003ch2\u003eIhre Aufgaben:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eVerantwortliche Konzeption, Organisation, Durchführung und Auswertung der Projektaufgaben im Bereich Sensorik und Infrastrukturerfordernisse\u003c/li\u003e\n\u003cli\u003eEntwicklung und Erprobung von Sensorprototypen und Datenverarbeitung in den Reallaboren\u003c/li\u003e\n\u003cli\u003eUnterstützung der Weiterentwicklung der Simulationsumgebung mit erhobenen Sensordaten und Umfeldmodellen\u003c/li\u003e\n\u003cli\u003eUnterstützung des kontinuierlichen Technologiemonitorings im Projekt (Schwerpunkt: Sensorik und weitere Infrastrukturtechnologien)\u003c/li\u003e\n\u003cli\u003eUnterstützung bei Transferaufgaben\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eIhr Profil:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossene Hochschulausbildung (Bachelor oder Master) in Informatik, Informationstechnik, Elektrotechnik, Wirtschaftsinformatik, Mensch-Technik-Interaktion oder vergleichbarem Studiengang\u003c/li\u003e\n\u003cli\u003eKenntnisse in mindestens einem der folgenden Bereiche: Sensorik, Infrastruktur, Signalverarbeitung, Automotive, Maschinelles Lernen, Bildverarbeitung\u003c/li\u003e\n\u003cli\u003eKenntnisse im Verfassen von (wissenschaftlichen) Veröffentlichungen sowie Pressemitteilungen und Fachbeiträgen\u003c/li\u003e\n\u003cli\u003eKommunikationsstärke in Wort und Schrift (deutsch und englisch) sowie sicheres Auftreten\u003c/li\u003e\n\u003cli\u003eErfahrungen und ausgeprägtes Interesse an digitalen Zukunftsthemen und Automotive\u003c/li\u003e\n\u003cli\u003eInterdisziplinäre Projekterfahrung vorteilhaft\u003c/li\u003e\n\u003cli\u003eProgrammiererfahrung in Python, C++ oder Matlab wünschenswert\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWir bieten:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eArbeit auf einem neuen und modernen Campus\u003c/li\u003e\n\u003cli\u003eEine interessante, abwechslungsreiche und herausfordernde Tätigkeit in einem netten Team\u003c/li\u003e\n\u003cli\u003eEin gestaltbares Arbeitsfeld, in das Sie sich aktiv einbringen können\u003c/li\u003e\n\u003cli\u003eWork-Life-Balance dank flexibler Arbeitszeiten und 30 Urlaubstagen zu Ihrer persönlichen Erholung\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge\u003c/li\u003e\n\u003cli\u003eEin umfangreiches Weiterbildungsprogramm\u003c/li\u003e\n\u003cli\u003eUnd was immer Sie brauchen, um sich neuen Herausforderungen zu stellen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDie Stelle ist zunächst bis zum 31.08.2022 befristet.\u003c/p\u003e\n\u003cp\u003eWir sind eine weltoffene Hochschule und freuen uns über Bewerbungen aus allen Kulturkreisen. Wir fördern die Vereinbarkeit von Familie und Beruf, Bewerber und Bewerberinnen mit Kindern sind willkommen. Falls Sie hierzu Fragen haben, können Sie gern mit der Gleichstellungsbeauftragten Birgit Weustermann (E-Mail: \u003ca href=\"mailto:birgit.weustermann@hs-ruhrwest.de\"\u003ebirgit.weustermann@hs-ruhrwest.de\u003c/a\u003e) Kontakt aufnehmen.\u003c/p\u003e\n\u003cp\u003eEine Teilzeitbeschäftigung ist grundsätzlich möglich.\u003c/p\u003e\n\u003cp\u003eBewerbungen schwerbehinderter Menschen werden bei gleicher Eignung bevorzugt berücksichtigt.\u003c/p\u003e\n\u003cp\u003eWir freuen uns auf Ihre \u003cstrong\u003eaussagekräftige Online-Bewerbung\u003c/strong\u003e (in einer PDF-Datei) bis zum \u003cstrong\u003e15.12.2019\u003c/strong\u003e über das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e oder an \u003ca href=\"mailto:karriere@hs-ruhrwest.de\"\u003ekarriere@hs-ruhrwest.de\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDie Vorstellungsgespräche sind für den 20.01.2020 terminiert.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://hochschule-ruhr-west.redirect.your-jobresponse.com/wissenschaftliche_r_mitarbeiter_in_sensorik_und_infrastruktur_autonomes_fahren_muelheim_an_der_ruhr/258587/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003eBei fachlichen Fragen:\u003c/h2\u003e\n\u003cp\u003eProf. Dr. Anselm Haselhoff\u003c/p\u003e\n\u003cp\u003eInstitut Informatik\u003c/p\u003e\n\u003cp\u003eTelefon: 0208 882 54-829\u003c/p\u003e\n\u003cp\u003eE-Mail: \u003ca href=\"mailto:anselm.haselhoff@hs-ruhrwest.de\"\u003eanselm.haselhoff@hs-ruhrwest.de\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003eBei allgemeinen Fragen zur Bewerbung und Beschäftigung:\u003c/h2\u003e\n\u003cp\u003eJohanna Peters\u003c/p\u003e\n\u003cp\u003ePersonalservice\u003c/p\u003e\n\u003cp\u003eTelefon: 0208 882 54-230\u003c/p\u003e\n\u003cp\u003eE-Mail: \u003ca href=\"mailto:johanna.peters@hs-ruhrwest.de\"\u003ejohanna.peters@hs-ruhrwest.de\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://hochschule-ruhr-west.redirect.your-jobresponse.com/wissenschaftliche_r_mitarbeiter_in_sensorik_und_infrastruktur_autonomes_fahren_muelheim_an_der_ruhr/258587/V819/anwenden\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbngzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--faa1e229590711f5a505fe8e42467d837b8a57dd/hochschule%20ruhr%20west.jpg"},{"id":"f615891a-d3ca-4792-bf8d-c4ffd33cb96d","type":"Contract","url":"https://jobs.github.com/positions/f615891a-d3ca-4792-bf8d-c4ffd33cb96d","created_at":"Thu Nov 14 09:48:50 UTC 2019","company":"European XFEL","company_url":"https://www.xfel.eu/","location":"Germany","title":"Web Software Developer supporting Data Science (f/m/d)","description":"\u003cp\u003eEuropean XFEL is an international non-profit company located in the Hamburg area in Germany. It operates a 3.4 km long X-ray laser, which produces X-rays of unique quality for studies in physics, chemistry, the life sciences, materials research and other disciplines. The diverse scientific facilities at European XFEL enable scientists from across the globe to carry out a wide range of experimental techniques. Early user operation started in September 2017.\u003c/p\u003e\n\u003cp\u003eIn the context of the PaNOSC (Photon and Neutron Open Science Cloud, \u003ca href=\"http://www.panosc.eu\"\u003ewww.panosc.eu\u003c/a\u003e, github.com/panosc-eu) project which is funded by the European Union’s Horizon 2020 research and innovation programme (grant agreement number 823852)\u003c/p\u003e\n\u003cp\u003ewe are looking for a\nWeb Software Developer supporting Data Science (f/m/d)\u003c/p\u003e\n\u003cp\u003eThe Position\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003edesign and development of new and existing web applications required for supporting European XFEL in the context of the PaNOSC project\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eintegration of new data reduction strategies into the existing operational services (catalogue, web services, data transfer)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eparticipation in testing, maintenance, documentation, and support of the products developed and later upgrades\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003epreparation of documentation related to the projects deliverables\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003ebachelor in Information Systems or related field, or equivalent experience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eideally, have minimum 2 years of experience with Ruby on Rails or other web Frameworks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eexperience in management of large scientific datasets is an asset\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ea strong background and knowledge of RESTful, CSS, and MySQL\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eknowledge of PHP, Python or Javascript would be an advantage\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003egood knowledge of Linux\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003every good communication skills in English\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor additional information please contact Krzysztof Wrona (\u003ca href=\"mailto:krzysztof.wrona@xfel.eu\"\u003ekrzysztof.wrona@xfel.eu\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eWorking place will be Schenefeld in the Hamburg metropolitan area. General information on working in Germany, the Hamburg area and the European XFEL can be found here.\u003c/p\u003e\n\u003cp\u003eOur Offer\nBecome part of a vibrant international and multicultural team of scientists, engineers, technical, and administrative staff. Be involved in cutting edge scientific and technical progress, participate in our international networks, and shape your life upon trust-based flexible working times and telecommuting options. Experience our atmosphere of tolerance and respect.\u003c/p\u003e\n\u003cp\u003eRemuneration\nSalary and benefits are similar to those of public service organizations in Germany. In addition, European XFEL provides a non-contributory company pension scheme, broad relocation benefits, a subsidized job-ticket for the local public transportation system, as well as our brand-new company restaurant BeamStop. The European XFEL GmbH employs a diverse, broadly international staff. Non-German candidates hired from abroad receive an international allowance.\u003c/p\u003e\n\u003cp\u003eReference number: E-237\u003c/p\u003e\n\u003cp\u003eDuration: This appointment is limited to 3 years.\u003c/p\u003e\n\u003cp\u003eApplication\nPlease apply online and provide a cover letter next to a CV in English, as well as your work certificates in one single pdf-file.\nHandicapped persons will be given preference over other equally qualified applicants. The European XFEL GmbH is an equal opportunity and affirmative action employer and encourages applications from women.\u003c/p\u003e\n\u003cp\u003eDeadline: December 12th 2019\u003c/p\u003e\n\u003cp\u003eEuropean XFEL GmbH\nHolzkoppel 4, 22869 Schenefeld, Germany\n\u003ca href=\"http://www.xfel.eu\"\u003ewww.xfel.eu\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://122.rexx-server.com/rexx-hr/xfel/jobportal/Application/E-237-web-software-developer-supporting-data-scien/Init/1-600.html\"\u003ehttps://122.rexx-server.com/rexx-hr/xfel/jobportal/Application/E-237-web-software-developer-supporting-data-scien/Init/1-600.html\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmgzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6c873564eebfebae06d03f1ff7daef2c91d29241/XFEL-Logo-RGB-133px.png"},{"id":"e5d4f0b3-5732-4d0c-9cd0-ba07e08fc564","type":"Full Time","url":"https://jobs.github.com/positions/e5d4f0b3-5732-4d0c-9cd0-ba07e08fc564","created_at":"Thu Nov 14 08:39:50 UTC 2019","company":"De VakantieDiscounter","company_url":"https://www.vakantiediscounter.nl","location":"Amsterdam","title":"Senior Scala Engineer","description":"\u003cp\u003e\u003cstrong\u003eVakantieDiscounter (Elmar Reizen BV) is the leading online travel agency in The Netherlands where our customers experience an easier and more comfortable way of booking their holiday: \u003ca href=\"https://www.vakantiediscounter.nl\"\u003ewww.vakantiediscounter.nl\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for a Senior Software Engineer that will join our growing development department, where you will be part of an agile feature team. Your talent and experience with software development on the JVM will help us become more innovative, improve our productivity, and continue to live up to our high standards. Your focus will be on the Travel Platform that connects Tour Operator inventories to our website by processing large amounts of data for efficient search in our search solution and facilitates booking via our API integration layer.\u003c/p\u003e\n\u003cp\u003eAll systems are built in-house with our own international development teams leverage technologies such as:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eScala, Akka HTTP and the Play framework for a scalable stateless REST back-end\u003c/li\u003e\n\u003cli\u003eApache Spark, for distributed data processing\u003c/li\u003e\n\u003cli\u003eHELM, Kubernetes for running our systems on GCP\u003c/li\u003e\n\u003cli\u003eClojure/ClojureScript for our website\u003c/li\u003e\n\u003cli\u003eA/B experiments, for sensible decision making\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou will be writing lots of high-quality code that goes to production continuously and spend ±10% on R\u0026amp;D to find the next big thing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour skills and qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are a seasoned Scala Engineer (4+ years) with solid experience working in an Agile environment\u003c/li\u003e\n\u003cli\u003eYou have a deep understanding of the JVM and code optimizations\u003c/li\u003e\n\u003cli\u003eYou have experience with Spark, Hadoop, or other distributed data processing platforms\u003c/li\u003e\n\u003cli\u003eYou have experience with DevOps and improving CI/CD pipelines\u003c/li\u003e\n\u003cli\u003eYou know functional programming and have a passion for learning and sharing your knowledge\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe consider it a plus if you have experience with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCats, Scalaz, functional programming libraries\u003c/li\u003e\n\u003cli\u003eKubernetes, Docker, container-based deployments\u003c/li\u003e\n\u003cli\u003eClojure and/or ClojureScript\u003c/li\u003e\n\u003cli\u003eOpen Source; because we contribute back to the ecosystem\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive remuneration package\u003c/li\u003e\n\u003cli\u003eA developer-focused workspace at our Amsterdam office\u003c/li\u003e\n\u003cli\u003eA fast-growing and flat organization with the possibility of flexible working hours and benefits in terms - of health, pension, and fun initiatives, team buildings, and events\u003c/li\u003e\n\u003cli\u003eThe opportunity to develop through courses, conferences, and events\u003c/li\u003e\n\u003cli\u003e24 paid holidays and 6 ATV days\u003c/li\u003e\n\u003cli\u003eDiscount on your holiday trips\u003c/li\u003e\n\u003cli\u003eSupport with relocation (visa, housing, 30% tax ruling)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout De VakantieDiscounter\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe VakantieDiscounter (Elmar Reizen BV) is an online travel agency from the Benelux and was founded over 20 years ago. From 2009 to 2019, the company has grown its revenue 50x. At the moment, VakantieDiscounter is embarking on an internationalization journey, starting with Germany and further expanding into several other countries in Europe.\u003c/p\u003e\n\u003cp\u003eThe company is continuously focused on innovative improvements and quality, not only with regards to the platform but also in terms of channels to reach and support the customer. The ever-prevailing goal is to make it easier and more comfortable for the customer to select a nice holiday.\u003c/p\u003e\n\u003cp\u003eThe vibrant VakantieDiscounter office, with an international team of 90 people, is located on the Amsterdam canals in the center of the city. The organization is flat, democratic and based on trust, and employees have a lot of freedom in achieving success through their own preferred approach.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQuestions?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIs this the job for you? Respond quickly to this vacancy! We would like to receive your CV via the application button below. Do you have any questions? Then contact our CTO, Sjors Grijpink at \u003ca href=\"mailto:sgrijpink@elmar.nl\"\u003esgrijpink@elmar.nl\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail you resume to \u003ca href=\"mailto:sgrijpink@elmar.nl\"\u003esgrijpink@elmar.nl\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBblIzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6d63387a3d74130bb21a824be65651ffda791387/IWkIK.png"},{"id":"929b69e6-101c-4fdf-8643-27e6661d3ab9","type":"Full Time","url":"https://jobs.github.com/positions/929b69e6-101c-4fdf-8643-27e6661d3ab9","created_at":"Wed Nov 13 23:09:35 UTC 2019","company":"Scale Inc","company_url":"http:","location":"Sherman Oaks","title":"Senior Full Stack Developer (PHP)","description":"\u003cp\u003eScale is a tech-driven,direct-to-consumer platform that develops and deploys cutting-edge consumer brands from concept to scale, efficiently, profitably and quickly. We are obsessed with perfecting our proprietary technology, processes and methodologies that allow for rapid growth, from inception to SCALE.\u003c/p\u003e\n\u003cp\u003eTogether we have a lifetime of experience in health, nutrition, entertainment, advertising, creative, media buying, strategy, performance optimization, and leadership. We have achieved success that has resulted in thousands of lives changed and millions of dollars in revenue.\u003c/p\u003e\n\u003cp\u003eWe use an analytical approach and technology to power our growth engine, and are looking for  an experienced senior full-stack engineer to join and help build and improve our web properties. You’ll work with our team of engineers to build and maintain features that create rich and compelling experiences for our customers, and expand the platform that drives our business operations.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cp\u003eWrite and maintain code primarily in PHP and JavaScript (along with other languages as needed)\nDesign / architect / build new applications, features, and tools\nHelp improve system performance and scalability\nHelp track down and fix system bugs\nHelp mentor junior developers\nQualifications:\n5+ years experience developing web applications\n3+ years of PHP experience with an MVC framework\nExperience with frontend Javascript libraries/frameworks (jQuery, React, Angular)\nExperience building and consuming APIs and web services\nExperience working with relational databases such as MySQL containing large amounts of data\nStrong grasp of technologies across the stack from the browser to the server\nStrong understanding of the browser DOM\nStrong communication skills both written and verbal\u003c/p\u003e\n\u003cp\u003eBonus Qualifications:\u003c/p\u003e\n\u003cp\u003eExperience with Node.js\nExperience with additional languages such as Go, Python, Java, etc.\nHands on experience with containerization and orchestration (Docker / Kubernetes)\nContributions to open source projects\u003c/p\u003e\n\u003cp\u003eWho We Are:\u003c/p\u003e\n\u003cp\u003eScale owns and operates several brands in the health and beauty verticals (our biggest - \u003ca href=\"https://1md.org\"\u003ehttps://1md.org\u003c/a\u003e, \u003ca href=\"https://hairlavie.com\"\u003ehttps://hairlavie.com\u003c/a\u003e). We formulate best-in-class supplement and care products based on clinical studies and in partnership with doctors and medical labs.\nWe sell our products online on eCommerce websites that are powered by our in-house eCommerce platform, built with the Zend Framework (LEMP stack). Our eCommerce platform controls every aspect of our websites as well as many of our business operations, such as customer service, inventory management, deep reporting and analytics and much more.\u003c/p\u003e\n\u003cp\u003eWhat We Offer:\u003c/p\u003e\n\u003cp\u003eCompetitive Salary Commensurate with Years of Experience\nMedical, dental, vision and life insurance\nGym Membership\nOffice Snacks\nYoga, meditation and dance breaks\nCasual Dress\nCompany Outings\nPaid time off\u003c/p\u003e\n\u003cp\u003eLocal Candidates Highly Preferred\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply: Please email resume to \u003ca href=\"mailto:amanda.h@scale.tech\"\u003eamanda.h@scale.tech\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"9852ff36-0591-4be0-9d43-00ee40fd6b94","type":"Full Time","url":"https://jobs.github.com/positions/9852ff36-0591-4be0-9d43-00ee40fd6b94","created_at":"Wed Nov 13 23:27:06 UTC 2019","company":"Limelight Health","company_url":"https://limelighthealth.com/","location":"Remote","title":"Software Engineer III","description":"\u003cp\u003e\u003cstrong\u003eWho We Are:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Limelight Health Software Platform is changing the employee benefits industry with its revolutionary, SaaS-based, mobile/desktop, enterprise solution.\u003c/p\u003e\n\u003cp\u003eWork as a team in a technical, creative, driven environment with other engineers as we reinvent health insurance quoting!\u003c/p\u003e\n\u003cp\u003eThe Limelight Platform is an end-to-end, cloud-based, desktop and mobile insurance quoting and underwriting solution for B2B insurance professionals that is leading the technical revolution of the industry.\u003c/p\u003e\n\u003cp\u003eLimelight Health is largely remote with offices in San Francisco, Redding, and Des Moines with a flexible work environment and atmosphere. Visit us at (\u003ca href=\"https://limelighthealth.com\"\u003ehttps://limelighthealth.com\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat We Offer:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRemote work option available\u003c/li\u003e\n\u003cli\u003eCompetitive base salary\u003c/li\u003e\n\u003cli\u003eEquity (via stock options)\u003c/li\u003e\n\u003cli\u003eUnlimited PTO (paid time off)\u003c/li\u003e\n\u003cli\u003eTop shelf technology and tools\u003c/li\u003e\n\u003cli\u003eKnowing your product is making a difference\u003c/li\u003e\n\u003cli\u003eWidespread demonstrated appreciation\u003c/li\u003e\n\u003cli\u003eDirect working relationship with original founders\u003c/li\u003e\n\u003cli\u003eThe knowledge that investors are using the product\u003c/li\u003e\n\u003cli\u003eStart-up environment\u003c/li\u003e\n\u003cli\u003eFun, collaborative, flexible, and remote environment\u003c/li\u003e\n\u003cli\u003eCompany happy hours and future events planned\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSoftware Engineer III Overview:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCandidates are expected to have full stack Javascript experience and contribute to the success of Limelight Health by taking ownership of key product areas and developing functionality in an agile CI/CD environment. Must be able to continue to develop your own knowledge and skill-set to bring value as we grow.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree (BS/BA) in Computer Information Systems, Software Engineering or a related field preferred or equivalent experience.\u003c/li\u003e\n\u003cli\u003eSuccessful completion of a code school like Makersquare, Hack Reactor, etc. or equivalent - experience.\u003c/li\u003e\n\u003cli\u003e3-5+ years in an operational role with proven success.\u003c/li\u003e\n\u003cli\u003e1-2+ years in a team leadership role.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eFactors that may contribute to success in this role:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eResponsive Web Application development\nCross browser compatibility\nUnit testing (Jasmine/Karma)\nNodeJS\nJavascript ECMA 6+\nTypeScript\nAngularJS\nAngular Material\nNPM\nExpress\nPromises with Q node\nPromises with $q\nBreezeJS\nLodash\nPostgres\nAWS \u0026amp; AWS CLI\nRESTful Services\nUnderstanding of containerization (Docker)\nIndustry experience a plus\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEssential Functions:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLead a team of engineers in day-to-day activities.\u003c/li\u003e\n\u003cli\u003eProvide leadership and mentoring of junior engineers\u003c/li\u003e\n\u003cli\u003eOwning functional product areas and become a subject matter expert\u003c/li\u003e\n\u003cli\u003eDeveloping and supporting a large enterprise application in production with significant daily usage.\u003c/li\u003e\n\u003cli\u003eSupporting and implementing the latest standards in securing data at rest and in transit\u003c/li\u003e\n\u003cli\u003eDeveloping and managing a robust set of RESTful APIs\u003c/li\u003e\n\u003cli\u003eExecuting full lifecycle software development\u003c/li\u003e\n\u003cli\u003eProgramming well-designed, testable, efficient code\u003c/li\u003e\n\u003cli\u003eDocument and maintain software functionality\u003c/li\u003e\n\u003cli\u003eTroubleshoot, debug and patch existing systems\u003c/li\u003e\n\u003cli\u003eProduce clean, efficient code based on specifications\u003c/li\u003e\n\u003cli\u003eIntegrate software components and third-party APIs\u003c/li\u003e\n\u003cli\u003eCreate technical documentation for reference and reporting\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePlease do not apply to this job unless you are authorized to work in the US. We are unable to offer sponsorship at this time.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eLimelight Health is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply on our website at (\u003ca href=\"https://limelight-health.breezy.hr\"\u003ehttps://limelight-health.breezy.hr\u003c/a\u003e).\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbkYzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3ec7f11e733b48bad707c2137730fde157e407ff/LLH%20-%20Logo.jpg"},{"id":"6f250215-4d27-4d7f-bc14-c4faf5dd785a","type":"Full Time","url":"https://jobs.github.com/positions/6f250215-4d27-4d7f-bc14-c4faf5dd785a","created_at":"Wed Nov 13 20:00:38 UTC 2019","company":"Trillium Technical","company_url":"http:","location":"Michigan","title":"Software Engineer","description":"\u003cp\u003eMultiple Software Engineering opportunities available in the Midwestern United States\u003c/p\u003e\n\u003cp\u003eOur company has supported automotive suppliers and OEMs throughout the Midwest for more than 35 years. We have multiple active openings for Hardware and Software Engineers.\u003c/p\u003e\n\u003cp\u003eOur clients have multiple needs for experienced Embedded Software Developers who have at least 2 years of experience coding complex embedded software for automotive applications. Our clients also look for candidates with the following skill sets:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHMI Development\u003c/li\u003e\n\u003cli\u003eEmbedded C\u003c/li\u003e\n\u003cli\u003eSDLC/Software Quality\u003c/li\u003e\n\u003cli\u003eAUTOSAR\u003c/li\u003e\n\u003cli\u003eQNX\u003c/li\u003e\n\u003cli\u003eRTOS\u003c/li\u003e\n\u003cli\u003eADAS\u003c/li\u003e\n\u003cli\u003eASPICE\u003c/li\u003e\n\u003cli\u003eCloud Computing\u003c/li\u003e\n\u003cli\u003eCybersecurity\u003c/li\u003e\n\u003cli\u003eMobile- Android/iOS Development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThese positions are all full-time positions with comprehensive benefits. All positions require a bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering or Software Engineering. Relevant experience (Internships, Co-ops or full-time work experience) is required.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eE-mail your resume to \u003ca href=\"mailto:cbuchanan@trilliumtechnical.com\"\u003ecbuchanan@trilliumtechnical.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXQzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4959846770e85a278d233dcf7555b548c95b7bd8/trillium_technicallogo3.JPG"},{"id":"9022913c-a028-4f85-a241-73488c296065","type":"Full Time","url":"https://jobs.github.com/positions/9022913c-a028-4f85-a241-73488c296065","created_at":"Wed Nov 13 16:33:40 UTC 2019","company":"Matrix42","company_url":"https://www.matrix42.com/de/","location":"Frankfurt am Main","title":"(Junior) Software Developer C# (m/w/d)","description":"\u003ch2\u003e\u003cem\u003eDEIN JOB BEI UNS\u003c/em\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eUnsere Scrum Teams bestehen aus fünf Developern (m/w/d), einem Product Owner und einem Scrum Master.\u003c/li\u003e\n\u003cli\u003eKonkret geht es bei dieser Stelle um die Entwicklung unseres Produkts „Unified Endpoint Management Client“.\u003c/li\u003e\n\u003cli\u003eDas Team aus Developern, Scrum Master und Product Owner arbeitet an der Definition und Umsetzung neuer Features eng zusammen.\u003c/li\u003e\n\u003cli\u003eDu übernimmst Verantwortung für einzelne Komponenten unserer Software und passt individuell bestehende Anwendungen an.\u003c/li\u003e\n\u003cli\u003eNeben Software-Entwicklung bist du an allen Aufgaben beteiligt, die ein SCRUM Team abdeckt um ein lieferbares Produkt zu erstellen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eDAS BIST DU\u003c/em\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEin erfolgreich abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation und bereits erste Berufserfahrung in der Softwareentwicklung\u003c/li\u003e\n\u003cli\u003eSehr gute Kenntnisse in .NET 4.5, .NET Core, C#, ASP.NET MVC \u0026amp; Entity Framework\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse in der Web-Entwicklung (HTML 5, CSS3, JS, AngularJS, RESTful Webservices)\u003c/li\u003e\n\u003cli\u003eGute Datenbank-Kenntnisse (MS SQL DB) und Erfahrung mit Azure oder AWS\nAnalytisches und lösungsorientiertes Denken\u003c/li\u003e\n\u003cli\u003eSpaß und Engagement bei der gemeinsamen Entwicklung und Umsetzung von neuen Ideen\u003c/li\u003e\n\u003cli\u003eAusgeprägter Teamgeist und hohe Kommunikationsfähigkeit auf Deutsch und Englisch\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eDAS GIBT´S BEI UNS\u003c/em\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eFlache Hierarchien, kurze und offene Entscheidungswege und Moderne Technologien\u003c/li\u003e\n\u003cli\u003eWir optimieren unseren Motor kontinuierlich in Improvement Cycles\u003c/li\u003e\n\u003cli\u003eWeiterbildung in deinem Alltag, z.B. in einer Community of Practice oder auf Konferenzen\u003c/li\u003e\n\u003cli\u003eEntfaltung deiner Kreativität, u.a. in der Hack Week oder am Exploration Day\u003c/li\u003e\n\u003cli\u003eSpannende Firmenevents, wie unsere Kick-Off Woche, GetTogether und unsere Inside Meetings\u003c/li\u003e\n\u003cli\u003eUm den Kopf frei zu bekommen, geh’ doch eine Runde Kickern, in unser Kino oder zock eine Runde auf der PS4 oder Wii U.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eDU BIST IMMER NOCH DA?\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eDann wird es Zeit, dass wir Dich kennenlernen. Sende uns Deine vollständigen Bewerbungsunterlagen unter Angabe Deiner Gehaltsvorstellung sowie Deines frühestmöglichen Eintrittstermins bevorzugt über \u003ca href=\"https://matrix42.redirect.your-jobresponse.com/junior_software_develeoper_c_m_w_d_frankfurt_am_main/258507/V819/apply\"\u003ediesen Link\u003c/a\u003e oder unser Online-Bewerbungsportal an Herrn Thomas Gruber.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://matrix42.redirect.your-jobresponse.com/junior_software_develeoper_c_m_w_d_frankfurt_am_main/258507/V819/apply\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWQzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4413f678e598aea223162c58a5e34f4415545eed/Matrix42%20logo.jpeg"},{"id":"82f5b8b2-1c87-40d7-9d06-5c7897887b8e","type":"Full Time","url":"https://jobs.github.com/positions/82f5b8b2-1c87-40d7-9d06-5c7897887b8e","created_at":"Wed Nov 13 16:01:13 UTC 2019","company":"moovel Group GmbH (REACH NOW)","company_url":"https://www.moovel.com/de/DE","location":"Berlin","title":"Backend Engineer (f/m/d) for Mobility Service Provider Squad","description":"\u003ch2\u003e\u003cem\u003eHi,\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eWe are Anton, Ben, Bernd, Delia, Mark, Ulf, Patrick and Philip from the Mobility Service Provider (MSP) Squad. As an interdisciplinary team we focus on integrating mobility service providers for car-sharing, scooters, bike-sharing and ride-hailing such as car2go, TIER or FREE NOW (formerly mytaxi) into our urban mobility platform. We care greatly about quality, scalability, ease of use and a great user experience. We’re looking for a backend-focused engineer to join our squad.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eFirst a quick look at us\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eThe subject of mobility is evolving at a startling pace. Fundamentals are being questioned, new ways of getting around are emerging and challenging the established ones. At moovel (becomes REACH NOW), we aim to take part in shaping that future. Software is eating the world and mobility is certainly no exception. Ultimately, we want to help cities become smarter by building on the operational wisdom of city administrations and mobility service providers. We don't want to disrupt, but augment the means of getting around by employing contemporary technology.\u003c/p\u003e\n\u003cp\u003eThe problems we are engaging are manifold and from the real world. Our solutions do not only have an impact on a single industry branch, but also aim to transform the city. They involve fields like routing, searching, AI, innovative UX and much more. Things are very dynamic in the mobility space and thus we devote ourselves to a lot of exploratory work.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eHow the role works\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eWe are building services that provide a fully fledged feature set of urban mobility service providers. Our backend enables the moovel mobility app to find nearby mobility options like car or bike-sharing as well as scooters and ride-hailing services. It also allows booking functionality and handles payment.\u003c/p\u003e\n\u003cp\u003eOur services interact with moovel’s mobility platform as well as external APIs. Many of our services are also exposed to external partners, so they have to be well documented, stable and easy to use. Implementing new services in a consistent way is also very important to us.\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eSome of the things you will do\u003c/em\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWork in the Mobility Service Provider (MSP) Squad together with other backend engineers, mobile engineers, QA engineers and designers\u003c/li\u003e\n\u003cli\u003eBuild microservices with Node.js written in TypeScript and deployed on AWSdesign and implement APIs for discovering mobility points, booking flows and payment for mobility services\u003c/li\u003e\n\u003cli\u003eDesign and implement APIs for discovering mobility points, booking flows and payment for mobility services.\u003c/li\u003e\n\u003cli\u003eIntegrate APIs from third-party mobility service providers into our platform.\u003c/li\u003e\n\u003cli\u003eAs we follow agile principles, you will participate in defining our products and building them. Your input is valued!\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eAbout you\u003c/em\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou are an experienced backend-focussed software engineer and like building services using well-defined APIs\u003c/li\u003e\n\u003cli\u003eYou know about Node.js (ideally TypeScript) or are willing to learn it. We believe in hiring great engineers, not programming language experts.\u003c/li\u003e\n\u003cli\u003eYou know how to operate services in production: deploying, performance monitoring, tracing problems, and optimization are part of the things you have done in the past\u003c/li\u003e\n\u003cli\u003eWe run our services on Amazon Web Services (AWS) and monitor them with New Relic and Kibana. Knowledge with those technologies is a plus, but not mandatory.\u003c/li\u003e\n\u003cli\u003eYou are able to communicate verbally and written in English (we communicate mostly in English).\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eChoose your own hardware\u003c/li\u003e\n\u003cli\u003eWorking with newest technologies \u0026amp; microservices\u003c/li\u003e\n\u003cli\u003eBe part of an interdisciplinary team of experts\u003c/li\u003e\n\u003cli\u003eWorking on products with a high impact on society\u003c/li\u003e\n\u003cli\u003eInternational teams\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eFree breakfast, good coffee \u0026amp; fresh fruits\u003c/li\u003e\n\u003cli\u003eMonthly mobility budget\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf this caught your attention, then we can not wait to meet you soon! Just click \u003ca href=\"https://moovelgroup.redirect.your-jobresponse.com/backend_engineer_f_m_d_for_mobility_service_provider_squad_berlin/258565/V819/anwenden\"\u003ethis link\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eYours,\u003c/p\u003e\n\u003cp\u003eAnton, Ben, Bernd, Delia, Mark, Ulf, Patrick and Philip\u003c/p\u003e\n\u003cp\u003eIf you have any questions or are in need for further information feel free to contact Mrs. Nicole Armatowski +49 176 3095 3172\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://moovelgroup.redirect.your-jobresponse.com/backend_engineer_f_m_d_for_mobility_service_provider_squad_berlin/258565/V819/anwenden\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUozIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b5e371ebb7b4a27097825a849cc6a7ae17f1794d/companyLogo-moovelbecomes-withmoovellogo_CMYK_v_Blue.png"},{"id":"2a6eedca-1cb3-42a6-b469-78b43750366b","type":"Full Time","url":"https://jobs.github.com/positions/2a6eedca-1cb3-42a6-b469-78b43750366b","created_at":"Wed Nov 13 11:53:54 UTC 2019","company":"Blackbox Company (UK) Ltd.","company_url":"https://www.blackbox-co.com","location":"Crowthorne","title":"Front-End Developer","description":"\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003eBlackbox is looking for a strong front-end developer to join our UK dev team, to help build the next generation of information control systems for the rail industry.\u003c/p\u003e\n\u003cp\u003eYou’ll initially be working alongside our front-end and back-end teams, planning and implementing features within our main UI application\u003c/p\u003e\n\u003cp\u003eWe don’t have a large team, and we aren’t looking for someone to be anonymous. Passion and opinions count and will be welcomed. In return you’ll be a whole lot closer to the decision making, and in the sort of environment where people and careers grow quickly.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSalary £50,000 - £55,000\u003c/em\u003e\u003c/p\u003e\n\u003ch2\u003eThings you'll need\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eStrong HTML, CSS (Sass), and Javascript skills\u003c/li\u003e\n\u003cli\u003eExtensive experience working with MVVM frameworks such as Aurelia or Angular\u003c/li\u003e\n\u003cli\u003eExperience working within Single Page Applications\u003c/li\u003e\n\u003cli\u003eA real passion for good quality, well-structured, clean code\u003c/li\u003e\n\u003cli\u003eProficiency in building and maintaining reusable web components\u003c/li\u003e\n\u003cli\u003eWorking knowledge of various asynchronous data retrieval and operating methodologies (WebSockets, XMLHttpRequests, Promises, etc.)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eThings we'd like you to have\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Typescript\u003c/li\u003e\n\u003cli\u003eWorking knowledge of task runners such as Gulp or Grunt\u003c/li\u003e\n\u003cli\u003eFamiliarity with transpilation and bundling processes\u003c/li\u003e\n\u003cli\u003eExperience with Azure\u003c/li\u003e\n\u003cli\u003eExperience with Jira or DevOps\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAbout Blackbox\u003c/h2\u003e\n\u003cp\u003eWe’re all about trying to improve the experience for people who travel by train, by improving how information about their journey is made available to them (online, on platform, on train, on social media). More like the experience you get when flying.\u003c/p\u003e\n\u003cp\u003eIt’s a broad mix that covers control room applications, data acquisition and management, integration to rail industry systems, externally-facing APIs, digital signage and audio, mobile apps, and more.\nWe live in Azure, our front-ends run on Aurelia, code in TypeScript, plan using DevOps Boards, and deploy using DevOps Pipelines. Our back-ends run on Service Fabric (though now migrating to AKS), and are developed in C#.\u003c/p\u003e\n\u003cp\u003eWe are a fairly young, privately-owned company. But we’re making a big noise in the industry. That’s because we hire smart people, and we expect them to take our vision and run with it.\u003c/p\u003e\n\u003ch2\u003eWhat it's like working here\u003c/h2\u003e\n\u003cp\u003eAll our non-dev people are in the UK along with most of our dev team, though we do have a small dev team in Canada. Our UK office is near Bracknell, but we’re pretty comfortable with home-working. We get together when we need to - sometimes a trip to the office is required for discussions, design meetings, etc. The rest of the time we live and breathe Slack.\u003c/p\u003e\n\u003cp\u003eDon’t expect to be spoon-fed. We’re involved in some sizable, exciting projects and we need people who are comfortable taking ownership of whatever they are doing. Good people earn respect very quickly here. It’s fast-paced, and we wouldn’t have it any other way!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:jobs@blackbox-co.com\"\u003ejobs@blackbox-co.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2gzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--482f93948fc8f680f874a7a28aaaa366b8a428e3/bbx-logo-black.png"},{"id":"9c9146b3-3ac8-42d7-a1f6-870a5adaf078","type":"Full Time","url":"https://jobs.github.com/positions/9c9146b3-3ac8-42d7-a1f6-870a5adaf078","created_at":"Wed Nov 13 12:19:04 UTC 2019","company":"Elinvar GmbH","company_url":"http://http","location":"Berlin","title":"Senior DevOps Engineer (m/f/div)","description":"\u003cp\u003e\u003cstrong\u003eSenior DevOps Engineer (m/f/div)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eElinvar enables Asset \u0026amp; Wealth Managers to digitalize their business model. By combining cutting-edge technology and the regulatory expertise of a licensed financial portfolio manager we offer our partners a comprehensive range of services. The platform's flexibility enables the customized solution for each partner.\u003c/p\u003e\n\u003cp\u003eWorking at Elinvar is like our platform: straightforward and focused on excellence.\nAs a B2B2C provider, we work with portfolio managers who manage billions of Euros in assets under management and have accordingly high expectations of us. Our team of dedicated technology and financial experts work hard to jointly meet and exceed those expectations.\u003c/p\u003e\n\u003cp\u003eAbout the technical stack: the platform consists of dozens of microservices which are mainly based on Java 8. They communicate through Kafka and a GraphQL. Data is stored in PostgreSQL and Couchbase. The services are running in Docker containers on three AWS data centers in a high availability mode, managed by Kubernetes. The frontend is based on React.js. We are using GitLab for source control and continuous integration. The development process is based on Scrum with 2-week sprints.\u003c/p\u003e\n\u003cp\u003eSounds interesting? We're now looking for a Senior DevOps Engineer (m/f/div) to join our team at Elinvar.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat will keep you challenged?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExtending our monitoring and alerting with a focus on business processes.\u003c/li\u003e\n\u003cli\u003eAssisting the integration of 3rd parties like custodians banks.\u003c/li\u003e\n\u003cli\u003eConstantly improving the security of the platform.\u003c/li\u003e\n\u003cli\u003eWorking on the Continuous Integration / Continuous Delivery process.\u003c/li\u003e\n\u003cli\u003eEnhancing our highly accessible platform while using the latest technologies like AWS, Kubernetes, Ansible, Docker, Prometheus, Couchbase and Kafka.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy Elinvar?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBased in Berlin, Elinvar is the comprehensive, digital and customized solution for wealth managers.\u003c/li\u003e\n\u003cli\u003eOur partners manage billions and expect excellence. We empower employees to reshape finance and look for talented and dedicated people.\u003c/li\u003e\n\u003cli\u003eOur co-founders share tremendous industry expertise and together with the team are dedicated to ensuring Elinvar's long-term success.\u003c/li\u003e\n\u003cli\u003eWe believe hard work and success deserve to be celebrated - both in and out of the office.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUniversity degree or an equivalent education.\u003c/li\u003e\n\u003cli\u003eExperience with configuration management tools like Ansible, Chef or Puppet.\u003c/li\u003e\n\u003cli\u003eExperience with Linux and scripting languages like BASH, Python.\u003c/li\u003e\n\u003cli\u003eKnowledge of Docker, Kubernetes, AWS is a plus.\u003c/li\u003e\n\u003cli\u003eFluent in English.\u003c/li\u003e\n\u003cli\u003eYou advocate DevOps philosophy and emphasize effective communication and collaboration between engineering, product, and operations.\u003c/li\u003e\n\u003cli\u003eYou never stop learning and are particularly passionate about technology.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAre you up for the challenge?\u003c/strong\u003e\nApply now via 'How to apply'.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/9edfb1c5f99f1383c1baf90797c6059fc6b2871e/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313333303835\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now via the \u003ca href=\"https://ltpx.nl/DTO95wO\"\u003e\u003cstrong\u003eapplication form\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazEzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--99e5904faa08b526763a3da501ebda30ed42ee07/elinvar-logo-positive.png"},{"id":"f3bae9b5-c72d-4b63-8a6a-f057a9c34931","type":"Full Time","url":"https://jobs.github.com/positions/f3bae9b5-c72d-4b63-8a6a-f057a9c34931","created_at":"Wed Nov 13 10:38:21 UTC 2019","company":"Sioux Technologies","company_url":"https://vacancy.sioux.eu/","location":"Eindhoven","title":"Software Designer .NET/Java","description":"\u003cp\u003e\u003cstrong\u003eSioux develops and produces state-of-the-art technology for the top end of the international high-tech community. We raise the bar high and we often achieve the impossible. We do so together, as a team of enthusiastic electronics, software, mechatronics and mathematics specialists. At Sioux, it’s all about laying the entire puzzle. And we can’t do that without you, a driven software designer .NET/Java.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFANTASTIC WORK GUARANTEE\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eworking on the most innovative projects in multidisciplinary teams\u003c/li\u003e\n\u003cli\u003ethe possibility to work in various domains\u003c/li\u003e\n\u003cli\u003espace to develop your leadership and to take the technical lead\u003c/li\u003e\n\u003cli\u003egathering and sharing knowledge and sparring with smart colleagues\u003c/li\u003e\n\u003cli\u003espace to continuously develop your talents\u003c/li\u003e\n\u003cli\u003ea choice of a 32 to 40-hour working week\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTHIS IS WHAT WE’RE LOOKING FOR\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou love your job and you have an unmistakable passion for developing software for advanced systems. You also enjoy working in a team and getting the maximum out of it together.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eyou have a background in computer science on a higher professional or university education level and at least five years of work experience\u003c/li\u003e\n\u003cli\u003eyou are familiar with the Windows-platform, .NET framework and C# programming language\u003c/li\u003e\n\u003cli\u003eyou have experience with various development methods and technologies\u003c/li\u003e\n\u003cli\u003eit would be preferred if you are able to coach junior colleagues on the basis of your experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTHIS IS SIOUX\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur employees are our strength and together, we want to get the maximum out of it. That starts by offering attractive terms and conditions of employment that are in line with your needs. According to our employees, it’s the personal attention at Sioux that makes the difference. And that’s something we’re proud of. After all, to us, success is more than just a good salary. It's also about being appreciated, about being given responsibility and the ability to develop. That’s why every employee receives a personal development budget of €6,000 for training or the purchase of books. We also offer you a pizza budget, for instance, when you work on innovative study projects in our expertise groups. Obviously, the employees are the best source of information if you want to find out what it's like to work for Sioux.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eInterested? Send your CV and motivation letter to Hans Odenthal via \u003ca href=\"mailto:jobs@sioux.eu\"\u003ejobs@sioux.eu\u003c/a\u003e. We will respond to you within three days. If you have any questions, just give us a call on +31 (0)40 2677100.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBangzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--304d0327b1a431813a90ff15780c13521b8eef9d/sioux_logo_fullcolor_100x100px.png"},{"id":"e95b03c9-f094-436d-8d5e-a058d214cbba","type":"Full Time","url":"https://jobs.github.com/positions/e95b03c9-f094-436d-8d5e-a058d214cbba","created_at":"Wed Nov 13 10:30:05 UTC 2019","company":"Ministerie van Justitie en Veiligheid","company_url":"http:","location":"Den Haag","title":"Forensisch software-engineer","description":"\u003cp\u003e\u003cstrong\u003eFunctie­omschrijving\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHet Nederlands Forensisch Instituut ontwikkelt software die van groot belang is voor het forensisch onderzoek. Wat wij maken móet goed zijn, omdat de toekomst van mensen ervan afhangt. Wordt iemand vrijgesproken of schuldig bevonden? Dankzij innovatieve applicaties en softwarebibliotheken kunnen daders van misdrijven sneller opgespoord en vervolgd worden. Aan jou als software-engineer de uitdaging om mee te werken aan de doorontwikkeling en verbetering van deze applicaties.\u003c/p\u003e\n\u003cp\u003eBij het team Forensische Software-engineering ontwikkel jij diverse complexe applicaties, die binnen en buiten het Nederlands Forensisch Instituut gebruikt worden voor opsporing en bewijsvoering. Jij werkt mee aan het uitwerken en beschikbaar maken van nieuwe forensische analysetechnieken op het gebied van datarecovery, data-analyse, DNA, chemische analyses, (kogel)krassporen, verkeersongevallen, cryptografie, exploits en statistiek. Denk aan software voor het detecteren van kleine afwijkingen in digitale foto's om de unieke camera te achterhalen of een applicatie voor het doorzoeken van gegevensdragers op strafbaar beeldmateriaal. Jij duikt in lowlevel-datastructuren en algoritmiek en haalt de betekenis tot de laatste bit boven water, bijvoorbeeld bij het parsen van een bestandssysteem of het aansturen van geheugenchips.\u003c/p\u003e\n\u003cp\u003eIn een hecht team van gedreven software-engineers en testengineers ben jij betrokken bij het gehele ontwikkeltraject, van een idee dat je soms zelf hebt bedacht tot de hulp bij het gebruik van de software. Deze software ontwikkel je voornamelijk in Java, maar ook in C++, OpenCL en diverse webapplicatie-frameworks. Ook draag je bij aan de verbetering van het vakgebied software-engineering; je denkt mee over een efficiënte inrichting van het ontwikkelproces, waarbij de forensische kennis zo goed mogelijk geborgd wordt. Denk ook aan testautomatisering en onze buildtooling op basis van Bamboo, Maven, Jenkins en OpenShift.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFunctie-eisen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e• Je hebt een hbo-bacheloropleiding afgerond, bijvoorbeeld in de richting (technische) informatica of software-engineering.\u003c/p\u003e\n\u003cp\u003e• Je hebt aantoonbare ervaring in een vergelijkbare functie.\u003c/p\u003e\n\u003cp\u003e• Je hebt meerdere jaren ervaring met diverse programmeertalen en -tools, waaronder Java.\u003c/p\u003e\n\u003cp\u003e• Je hebt ervaring of affiniteit met (lowlevel-)computertechniek en reverse-engineering.\u003c/p\u003e\n\u003cp\u003e• Je bent in staat om zelfstandig technisch onderzoek uit te voeren op het gebied van reverse-engineering en algoritmiek.\u003c/p\u003e\n\u003cp\u003eCompetenties\u003c/p\u003e\n\u003cp\u003e• Accuraat werken\u003c/p\u003e\n\u003cp\u003e• Analyseren\u003c/p\u003e\n\u003cp\u003e• Plannen en organiseren\u003c/p\u003e\n\u003cp\u003e• Samenwerken\u003c/p\u003e\n\u003cp\u003e• Zelfontwikkeling\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat vinden wij nog meer belangrijk\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJe bent een enthousiaste puzzelaar die zich graag vastbijt in complexe uitdagingen. Daarnaast heb je een passie voor software-engineering waarbij je je eigen ervaring inbrengt en een expertiserol kunt vervullen. Je deelt graag je kennis en ervaringen en bent nieuwsgierig naar de ideeën van anderen. Je bent analytisch sterk en kunt goed met deadlines omgaan. Je bent communicatief vaardig, zowel mondeling als schriftelijk. Je bent kritisch en in staat om de haalbaarheid van de wens te onderzoeken en te onderbouwen. Indien mogelijk kom je met innovatieve en creatieve oplossingen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eArbeids­voorwaarden\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSalaris­niveau schaal 10, schaal 11\nSalaris­omschrijving Op deze functie is het Functiegebouw Rijk van toepassing. Inschaling vindt plaats op basis van je opleiding en ervaring. De mogelijkheid bestaat dat je in beginsel via een aanvangsschaal wordt aangesteld. Deze kan één schaal lager zijn dan de betreffende functieschaal.\u003c/p\u003e\n\u003cp\u003eVoor de functie geldt een tijdelijke markttoelage van 8% die aan het vermelde maandsalaris wordt toegevoegd.\nMaand­salaris Min €2.683 – Max. €4.905 (bruto)\nDienst­verband Tijdelijke aanstelling met uitzicht op vaste aanstelling\nContract­duur Tijdelijke aanstelling voor de duur van één jaar met uitzicht op vast\nMinimaal aantal uren per week 32\nMaximaal aantal uren per week 36\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOverige arbeids­voorwaarden\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNaast het salaris en vakantiegeld kun je rekenen op een eindejaarsuitkering, de zogeheten dertiende maand. De Rijksoverheid hecht sterk aan persoonlijke groei en loopbaanontwikkeling en biedt daarvoor tal van mogelijkheden. Tot de secundaire arbeidsvoorwaarden behoren onder meer maximaal 60% betaald ouderschapsverlof (onder voorwaarden), studiefaciliteiten, een extra verlofregeling voor ouderen en een vergoeding woon-werkverkeer. Bovendien kun je je arbeidsvoorwaardenpakket deels zelf samenstellen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBijzonderheden\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e• Solliciteren? Nadat je via de \u003cstrong\u003e'sollicitatie'\u003c/strong\u003e button hebt gereageerd kun je jouw motivatie en cv als Word- of pdf-bestand uploaden. We nodigen je graag uit om in je motivatiebrief ook iets over jezelf te vertellen.\u003c/p\u003e\n\u003cp\u003e• Het toetsen van de integriteit van onze nieuwe collega’s is voor het NFI van groot belang. Voor deze functie geldt dat er een veiligheidsonderzoek B moet worden opgestart bij de Algemene Inlichtingen- en Veiligheidsdienst. Ook een geheimhoudingsverklaring maakt deel uit van het sollicitatieproces. Wanneer je als rijksambtenaar een beroep doet op een voorrangspositie, stuur dan ook een kopie van je beschikking mee.\u003c/p\u003e\n\u003cp\u003e• Een assessment (psychologische en vaardigheidstest) kan deel uitmaken van het\nsollicitatieproces, net als het opvragen van referenties en het inzetten van een (online) screening.\u003c/p\u003e\n\u003cp\u003e• Wanneer je als rijksambtenaar een beroep doet op een voorrangspositie, stuur dan ook een kopie van je beschikking mee.\u003c/p\u003e\n\u003cp\u003e• Voor medewerkers binnen de (Rijks)overheid behoort een detacheringsovereenkomst tot de mogelijkheden.\u003c/p\u003e\n\u003cp\u003e• Het inwinnen van referenties behoort tot de mogelijkheden\u003c/p\u003e\n\u003cp\u003e• Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/p\u003e\n\u003cp\u003e• Aan deze vacaturetekst kunnen geen rechten worden ontleend.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eKlik hier om te solliciteren!: \u003ca href=\"https://ministerievanjustitieveiligheid.redirect.your-jobresponse.com/forensisch_software_engineer_den_haag/258519/V819/solliciteren\"\u003ehttps://ministerievanjustitieveiligheid.redirect.your-jobresponse.com/forensisch_software_engineer_den_haag/258519/V819/solliciteren\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalIzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2ca79d23db2c9a04242856bc6c64cf4191ed415a/Ministerie_van_Justitie_en_Veiligheid_Logo%20(1).png"},{"id":"a7e6f1e2-9052-43c4-bcbe-860cfd004913","type":"Full Time","url":"https://jobs.github.com/positions/a7e6f1e2-9052-43c4-bcbe-860cfd004913","created_at":"Wed Nov 13 03:10:05 UTC 2019","company":"Carbonated","company_url":"http://www.carbonated.com","location":"Los Angeles, CA","title":"Software Engineer (AI)","description":"\u003cp\u003e\u003cstrong\u003eWHO WE ARE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCarbonated is a games studio based in El Segundo, CA and only a 15 minute walk to the beach. The company was founded in 2015 by industry veterans who’ve built and run some of the biggest games in the world at companies like EA, Sony, Zynga and Blizzard. Our aspiration is to build a company where people want to spend their entire careers.\u003c/p\u003e\n\u003cp\u003eOur culture is largely based around a shared love of playing and building games as well as continuously learning and experimenting together. Unsurprisingly, we're focused on folks who share our key values:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eTalent\u003c/strong\u003e (you're a subject matter expert and amazing individual contributor!)\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eAttitude\u003c/strong\u003e (you want to win! sure, experience is important, but that’s only part of what makes a great contributor, great)\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWillingness to try new and sometimes scary things\u003c/strong\u003e (so we can ship something we're all proud of!)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRight now we’re fortunate enough to be working on our dream game, a real-time social pvp battler (think if \u003cem\u003eThe Division\u003c/em\u003e had a baby with \u003cem\u003eEve Online\u003c/em\u003e) with a few fun twists!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHO YOU ARE\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbove all else, making games is your jam\u003c/li\u003e\n\u003cli\u003eA Software Engineer with a specific focus on Game AI.  Seeing characters come to life and do interesting \u0026amp; fun things is what gets you up in the morning.\u003c/li\u003e\n\u003cli\u003eSomeone who wants to take creative risks and enjoys finding clever solutions to difficult problems\u003c/li\u003e\n\u003cli\u003eAt your best when working with others\u003c/li\u003e\n\u003cli\u003eNot afraid to speak up, take critique, or push for and take charge of something you passionately believe in\u003c/li\u003e\n\u003cli\u003ePossess a sense of humor - we’re not kidding\u003c/li\u003e\n\u003cli\u003eIs this all you?  It is?  Well then, we’d like to hear from you\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU’LL DO\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou’ll write code:  design, build, test, and debug client-side game features and systems\u003c/li\u003e\n\u003cli\u003eYou’ll research:  New games, prototypes, technologies, gameplay ideas, etc.\u003c/li\u003e\n\u003cli\u003eYou’ll push and challenge:  Everyone.  Juniors, mid-levels, seniors, and ... beyond\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT’S REQUIRED\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cem\u003eYou’ve built AI for multiple shipped games, with experience in character behaviours, pathing, squad tactics, etc.\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e5+ years Software Development experience in C/C++\u003c/li\u003e\n\u003cli\u003eExperienced in Object-Oriented Software Design \u0026amp; Implementation\u003c/li\u003e\n\u003cli\u003eExperience with native engines:  Unreal, CryEngine, Lumberyard and/or proprietary engines\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eStrong math skills with emphasis on 3D math, linear algebra and statistical methodologies\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003eProficient with data structures and algorithms\u003c/li\u003e\n\u003cli\u003eCapable of collaborating across different disciplines to design \u0026amp; implement effective solutions\u003c/li\u003e\n\u003cli\u003eAbility to own a project from beginning to end\u003c/li\u003e\n\u003cli\u003eProficient in Agile/Scrum development\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science, Math or AI-related discipline(s)\u003c/li\u003e\n\u003cli\u003eYou enjoy playing games when you can\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWORST \u0026amp; BEST PARTS OF THE JOB\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe work very hard\u003c/li\u003e\n\u003cli\u003eWe're making something new which has the chance to be massive (also, we offer competitive benefits like Nearly Unlimited PTO)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eEXTRA CREDIT\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou like working on a small team that works fast and iterates often\u003c/li\u003e\n\u003cli\u003eYou’re not afraid to roll up your sleeves and really dig in to make something awesome\u003c/li\u003e\n\u003cli\u003eYou think working in a cool building near the beach sounds like fun\u003c/li\u003e\n\u003cli\u003eYou like human-powered \u0026amp; electric bikes/Onewheels, dogs and/or kids\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSOUND LIKE YOU?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReally? Awesome! Send your resume and cover letter to \u003ca href=\"mailto:jobs@carbonated.com\"\u003ejobs@carbonated.com\u003c/a\u003e!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eCarbonated is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eIf you require assistance or an accommodation due to a disability, please let us know so we can make your visit with us as enjoyable as possible.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eemail your resume and cover letter to \u003ca href=\"mailto:jobs@carbonated.com\"\u003ejobs@carbonated.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWgzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e440e173c9de6707b29d42709d9ad7758d0c9578/Carb_logo_final_black_100x100.png"},{"id":"8359c2ca-c56e-4698-abb5-df72e54823a2","type":"Full Time","url":"https://jobs.github.com/positions/8359c2ca-c56e-4698-abb5-df72e54823a2","created_at":"Wed Nov 13 03:01:52 UTC 2019","company":"Carbonated","company_url":"http://www.carbonated.com","location":"Los Angeles","title":"Senior Software Engineer (client side)","description":"\u003cp\u003e\u003cstrong\u003eWHO WE ARE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCarbonated is a games studio based in El Segundo, CA and only a 15 minute walk to the beach. The company was founded in 2015 by industry veterans who’ve built and run some of the biggest games in the world at companies like EA, Sony, Zynga and Blizzard. Our aspiration is to build a company where people want to spend their entire careers.\u003c/p\u003e\n\u003cp\u003eOur culture is largely based around a shared love of playing and building games as well as continuously learning and experimenting together. Unsurprisingly, we're focused on folks who share our key values:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eTalent\u003c/strong\u003e (you're a subject matter expert and amazing individual contributor!)\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eAttitude\u003c/strong\u003e (you want to win! sure, experience is important, but that’s only part of what makes a great contributor, great)\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWillingness to try new (and sometimes scary) things\u003c/strong\u003e (so we can ship something we're all proud of!)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRight now we’re fortunate enough to be working on our dream game, a real-time social pvp battler (think if The Division had a baby with Eve Online) with a few fun twists!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMORE ON WHO YOU ARE\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA Senior Software Engineer (client side)\u003c/li\u003e\n\u003cli\u003ePassionate about making games (it’s your jam) and pushing the ever changing technical boundaries of mobile games as we create a new gaming genre\u003c/li\u003e\n\u003cli\u003eLove all the pieces of game programming: graphics, networking, physics, simulation, UI, ... the seemingly endless list goes on. New languages? Bring it. New engines? Sounds grand! New devices, GPUs, and CPUs? Can’t wait!\u003c/li\u003e\n\u003cli\u003eSomeone who wants to take creative risks and enjoys finding clever solutions to difficult problems\u003c/li\u003e\n\u003cli\u003eAt your best when working with others\u003c/li\u003e\n\u003cli\u003eNot afraid to speak up, take critique, or push for and take charge of something you passionately believe in\u003c/li\u003e\n\u003cli\u003ePossess a sense of humor - we’re not kidding\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU’LL DO\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLead the charge on new features and systems, mentor juniors and eventually give our CTO a run - - for his money\u003c/li\u003e\n\u003cli\u003eWrite code: design, build, test, and debug client-side game features and systems\u003c/li\u003e\n\u003cli\u003eOptimize code: 60FPS what? Let’s roll!\u003c/li\u003e\n\u003cli\u003eResearch: New games, prototypes, technologies, gameplay ideas, etc.\u003c/li\u003e\n\u003cli\u003ePush and challenge: Everyone. Juniors, mid-levels, seniors, and ... beyond\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT’S REQUIRED\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of professional mobile app development experience\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eYou’ve shipped multiple games\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003e5+ years Software Development experience in C/C++\u003c/li\u003e\n\u003cli\u003eExperienced in Object-Oriented Software Design \u0026amp; Implementation\u003c/li\u003e\n\u003cli\u003eExperience with native engines: Unreal, CryEngine, Lumberyard and/or proprietary engines\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eStrong math skills with emphasis on 3D Mathematics\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003eCapable of collaborating across different disciplines to design and implement effective solutions\u003c/li\u003e\n\u003cli\u003eAbility and drive to contribute and advance all aspects of a game\u003c/li\u003e\n\u003cli\u003eAbility to own a project from beginning to end\u003c/li\u003e\n\u003cli\u003eProficient in Agile/Scrum development\u003c/li\u003e\n\u003cli\u003eYou enjoy playing games when you can\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWORST \u0026amp; BEST PARTS OF THE JOB\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe work very hard\u003c/li\u003e\n\u003cli\u003eWe're making something new which has the chance to be massive (also, we offer competitive benefits like \u003cem\u003eNearly Unlimited PTO\u003c/em\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eEXTRA CREDIT\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou like working on a small team that works fast and iterates often\u003c/li\u003e\n\u003cli\u003eYou’re not afraid to roll up your sleeves and really dig in to make something awesome\u003c/li\u003e\n\u003cli\u003eYou think working in a cool building near the beach sounds like fun\u003c/li\u003e\n\u003cli\u003eYou like human-powered \u0026amp; electric bikes/Onewheels, dogs and/or kids\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSOUND LIKE YOU?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReally? Awesome! Send your resume and cover letter to \u003ca href=\"mailto:jobs@carbonated.com\"\u003ejobs@carbonated.com\u003c/a\u003e!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e*Carbonated is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\u003c/p\u003e\n\u003cp\u003eIf you require assistance or an accommodation due to a disability, please let us know so we can make your visit with us as enjoyable as possible.*\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:jobs@carbonated.com\"\u003ejobs@carbonated.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVIzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--83e611a7bbe7bc597be550fde083561e4badc6e8/Carb_logo_final_black_100x100.png"},{"id":"1d42d586-2848-47dc-b18b-7ef115420093","type":"Full Time","url":"https://jobs.github.com/positions/1d42d586-2848-47dc-b18b-7ef115420093","created_at":"Tue Nov 12 21:15:52 UTC 2019","company":"J.B. Hunt Transport","company_url":"http://jbhunt.jobs","location":"Lowell, AR","title":"Software Engineer III","description":"\u003cp\u003eThe J.B. Hunt engineering team is looking for Software Engineers to join us in the development of our next-generation transportation management platform. We are investing heavily in our future as a technology company that specializes in transportation. If you’re ready to disrupt the industry and work with a team of talented engineers, then join our Engineering \u0026amp; Technology team!\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLead development efforts in a scrum development environment.\nImplements web designs that provide a rich user experience.\u003c/li\u003e\n\u003cli\u003eLead development and implementation of new features that meet J.B. Hunt’s standards in performance, reliability, and maintainability.\u003c/li\u003e\n\u003cli\u003eTroubleshoot and solves production issues related to performance and reliability with assistance from other team members.\u003c/li\u003e\n\u003cli\u003eCreates unit/integration tests that align to architecture standards; and documentation of current or future tasks in a work tracking system (Azure Dev Ops).\u003c/li\u003e\n\u003cli\u003eLead team members in execution and release of builds using continuous integration and deployment using CI/CD pipelines and processes.\u003c/li\u003e\n\u003cli\u003eWork within a collaborative environment and contributes to team goals by offering open and honest communication and helping to meet deadlines.\u003c/li\u003e\n\u003cli\u003eActs as a technical consultant to the team's leadership by leveraging technical and business knowledge to address questions.\u003c/li\u003e\n\u003cli\u003eProvides technical leadership to the team and others through coaching and mentorship.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMinimum Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of experience in software development AND\u003c/li\u003e\n\u003cli\u003eBachelor’s degree in Computer and Information Science, Engineering, or Management Information Systems, or related, or foreign equivalent OR\u003c/li\u003e\n\u003cli\u003eA suitable combination of education, experience, and training; plus 6 year of experience in Software Development or Engineering.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePreferred Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with the latest version of Angular\u003c/li\u003e\n\u003cli\u003eExperience with object-oriented languages (such as Java or C#)\u003c/li\u003e\n\u003cli\u003eExperience with modern front-end web frameworks (JavaScript, TypeScript, Angular, React)\u003c/li\u003e\n\u003cli\u003eExperience with relational and NoSQL database management systems (MSSQL \u0026amp; Cosmo DB)\u003c/li\u003e\n\u003cli\u003eExperience with designing mobile applications with React Native.\u003c/li\u003e\n\u003cli\u003eExperience with automated unit, integration, and front-end testing frameworks\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTechnologies: java, springboot, docker, angular, azure\u003c/p\u003e\n\u003cp\u003e*Position is based in Lowell, Arkansas. Relocation package available.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.jbhunt.com/careers/techjobs/talent-community/?utm_source=HR\u0026amp;utm_medium=GitHub\u0026amp;utm_campaign=HR_GitHub_JobPosting_SoftwareEngineer3\u0026amp;source=HR_GitHub_JobPosting_SoftwareEngineer3\"\u003ehttps://www.jbhunt.com/careers/techjobs/talent-community/?utm_source=HR\u0026amp;utm_medium=GitHub\u0026amp;utm_campaign=HR_GitHub_JobPosting_SoftwareEngineer3\u0026amp;source=HR_GitHub_JobPosting_SoftwareEngineer3\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGwzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7aab2af287719dcd0d03b30c7a02e45b94478b08/JBH.jpg"},{"id":"8a634859-f463-4a9a-9683-32ec6bb3fea4","type":"Full Time","url":"https://jobs.github.com/positions/8a634859-f463-4a9a-9683-32ec6bb3fea4","created_at":"Tue Nov 12 21:08:58 UTC 2019","company":"J.B. Hunt Transport","company_url":"http://jbhunt.jobs","location":"Lowell, AR","title":"Expert Software Engineer","description":"\u003cp\u003eChange Transportation With Us.\u003c/p\u003e\n\u003cp\u003eJ.B. Hunt is building an entirely new platform to enable their internal and external potential. The position documents programs, develops and implements new features, and supports critical web applications' layer architecture and various back end systems supporting the platform and other digital initiatives. This position applies advanced programming techniques and concepts during the solution design and development. The position is also responsible for setting and ensuring the team's compliance with J.B. Hunt's architectural standards.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContributes to bringing new technology to the organization.\u003c/li\u003e\n\u003cli\u003eProvides technical leadership across application teams (e.g. conducts training, develops learning sessions, contributes to the Architecture Review Board).\u003c/li\u003e\n\u003cli\u003eContributes to application or platform architecture standards through standards committees.\u003c/li\u003e\n\u003cli\u003eDesigns web designs that are asynchronous, responsive, and provide a rich user experience.\u003c/li\u003e\n\u003cli\u003eLeads team members in execution and release of builds using continuous integration and deployment using our current CI/CD applications and processes.\u003c/li\u003e\n\u003cli\u003eLeads analysis and designs tasks with the Agile team using software development lifecycle concepts.\u003c/li\u003e\n\u003cli\u003eWorks within a collaborative environment and contributes to team goals by offering open and honest communication and helping to meet deadlines.\u003c/li\u003e\n\u003cli\u003eActs as a technical consultant to the team's management by leveraging technical and domain knowledge to answer questions.\u003c/li\u003e\n\u003cli\u003eProvides technical leadership to the team and others through coaching and mentorship.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelors degree in Computer and Information Science, Engineering, Management Information Systems, or related, or foreign equivalent, or suitable combination of education, experience and training; plus 8 years of experience in Software Development or Engineering. Preferred experience with the latest version of Java (J2EE)\u003c/li\u003e\n\u003cli\u003ePreferred experience with the latest version of Angular\u003c/li\u003e\n\u003cli\u003eExperience with object-oriented languages (such as Java, C#, or Python)\u003c/li\u003e\n\u003cli\u003eExperience with modern front-end web frameworks (such as HTML and Java Script)\u003c/li\u003e\n\u003cli\u003eExperience with database management systems\u003c/li\u003e\n\u003cli\u003eExperience with designing mobile applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e*Position requires relocation to J.B. Hunt Corporate Office in Lowell, Arkansas. Relocation package available.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.jbhunt.com/careers/techjobs/talent-community/?utm_source=HR\u0026amp;utm_medium=GitHub\u0026amp;utm_campaign=HR_GitHub_JobPosting_ExpSoftwareEngineer\u0026amp;source=HR_GitHub_JobPosting_ExpSoftwareEngineer\"\u003ehttps://www.jbhunt.com/careers/techjobs/talent-community/?utm_source=HR\u0026amp;utm_medium=GitHub\u0026amp;utm_campaign=HR_GitHub_JobPosting_ExpSoftwareEngineer\u0026amp;source=HR_GitHub_JobPosting_ExpSoftwareEngineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGQzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--156a6cfda013b59ed36ef34b3be814fb9e8c10dd/JBH.jpg"},{"id":"1ddae3dd-0a77-47ac-a382-6389b88f10e2","type":"Full Time","url":"https://jobs.github.com/positions/1ddae3dd-0a77-47ac-a382-6389b88f10e2","created_at":"Tue Nov 12 21:05:04 UTC 2019","company":"J.B.Hunt Transport","company_url":"http://jbhunt.jobs","location":"Lowell, AR","title":"Senior Software Engineer","description":"\u003cp\u003eJ.B. Hunt is building an entirely new platform to enable their internal and external potential. The position is responsible for development tasks assigned during the Agile sprint. The position documents programs, develops and implements new features, and supports critical web applications' layer architecture and various back end systems supporting the platform and other digital initiatives. This position applies advanced programming techniques and concepts during the solution design and development. The position is also responsible for ensuring the team's compliance with J.B. Hunt's architectural standards.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLeads development efforts in an Agile development environment, daily stand ups, sprint planning, backlog grooming, retrospectives, and sprint demos.\u003c/li\u003e\n\u003cli\u003eImplements web designs that are asynchronous, responsive and provide a rich user experience.\u003c/li\u003e\n\u003cli\u003eLeads development and implementation of new features that meet J.B. Hunt’s standards in performance, reliability, and maintainability .\u003c/li\u003e\n\u003cli\u003eTroubleshoots and solves production issues related to performance and reliability throughout the software stack with assistance from other team members.\u003c/li\u003e\n\u003cli\u003ePerforms application debugging using their IDE of choice; unit testing using architecture standards; and documentation of current or future work tasks with a visual modeling application and/or an integrated README.\u003c/li\u003e\n\u003cli\u003eLeads team members in execution and release of builds using continuous integration and deployment using our current CI/CD applications and processes..\u003c/li\u003e\n\u003cli\u003eLeads analysis and design tasks with the Agile team using software development lifecycle concepts.\u003c/li\u003e\n\u003cli\u003eWorks within a collaborative environment and contributes to team goals by offering open and honest communication and helping to meet deadlines.\u003c/li\u003e\n\u003cli\u003eActs as a technical consultant to the team's management by leveraging technical and domain knowledge to answer questions.\u003c/li\u003e\n\u003cli\u003eProvides technical leadership to the team and others through coaching and mentorship.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree in Computer Science, Information Systems, Engineering, or a related field, or foreign equivalent, or suitable combination of education, training and experience; and five years of experience in Software Development using programs such as Java/J2EE, .Net/.Net Core, React/React Native, Webservices (SOAP or REST), Spring, Tomcat SQL, Eclips, IDEA, Intellij, Angular JS/Angular 2, EXT JS, Android, or iOS.\u003c/li\u003e\n\u003cli\u003ePreferred experience with the latest version of Angular, any other duties or technologies.\u003c/li\u003e\n\u003cli\u003eExperience with object-oriented languages (such as Java, C#, or Python)\u003c/li\u003e\n\u003cli\u003eExperience with modern front-end web frameworks (such as HTML and Java Script)\u003c/li\u003e\n\u003cli\u003eExperience with database management systems\u003c/li\u003e\n\u003cli\u003eExperience with designing mobile applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout this job\u003c/p\u003e\n\u003cp\u003eLocation options: Visa sponsor, Paid relocation to Lowell, Arkansas\u003c/p\u003e\n\u003cp\u003eTechnologies: java, .net-core, angular, react-native, javascript\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.jbhunt.com/careers/techjobs/talent-community/?utm_source=HR\u0026amp;utm_medium=GitHub\u0026amp;utm_campaign=HR_GitHub_JobPosting_SenSoftwareEngineer\u0026amp;source=HR_GitHub_JobPosting_SenSoftwareEngineer\"\u003ehttps://www.jbhunt.com/careers/techjobs/talent-community/?utm_source=HR\u0026amp;utm_medium=GitHub\u0026amp;utm_campaign=HR_GitHub_JobPosting_SenSoftwareEngineer\u0026amp;source=HR_GitHub_JobPosting_SenSoftwareEngineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFYzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6d0010b4bbaa6f77b0d09711da07a35fdcb9fecd/JBH.jpg"},{"id":"00382ec1-efa5-41f5-aa5f-0487f306515b","type":"Full Time","url":"https://jobs.github.com/positions/00382ec1-efa5-41f5-aa5f-0487f306515b","created_at":"Tue Nov 12 21:02:58 UTC 2019","company":"Clemson University","company_url":"https://www.clemson.edu","location":"Clemson, South Carolina","title":"Web Developer","description":"\u003cp\u003eClemson University\u003c/p\u003e\n\u003cp\u003eJob ID:104672\u003c/p\u003e\n\u003cp\u003eLocation:Clemson University\u003c/p\u003e\n\u003cp\u003eFull/Part Time:Full-Time\u003c/p\u003e\n\u003cp\u003eRegular/Temporary:Regular\u003c/p\u003e\n\u003cp\u003eJOB SUMMARY:\u003c/p\u003e\n\u003cp\u003eProvide technical management support for PSA/CAFLS websites, and project management for development of websites. Other duties as assigned.\u003c/p\u003e\n\u003cp\u003eJOB DUTIES:\u003c/p\u003e\n\u003cp\u003e40% - Essential - Content management system administration, including style sheets, templates, user management, usability and accessibility.\u003c/p\u003e\n\u003cp\u003e25% - Essential - Research, evaluate, recommend and implement software enhancements, procedures and emerging technologies to improve PSA/CAFLS websites for site visitors, content providers and unit web masters; ensure PSA/CAFLS websites meet current and developing technological and usability trends and standards; ensure that hardware and software comply with university guidelines.\u003c/p\u003e\n\u003cp\u003e25% - Essential - Design and produce web pages for assigned PSA/CAFLS clients; provide technological consultation to assigned PSA/CAFLS clients and administrators; research and implement workflow technology to enhance team collaboration and efficiency.\u003c/p\u003e\n\u003cp\u003e10% - Essential - Maintain positive and professional relationships with coworkers, clients, university personnel and outside suppliers; contribute to other organizational projects as needed.\u003c/p\u003e\n\u003cp\u003eMINIMUM REQUIREMENTS:\u003c/p\u003e\n\u003cp\u003eEducation - A bachelor's degree in computer science or a related field and experience in information technology. Related experience may be substituted for the bachelor's degree on a year-for-year basis. (For example: An Associates Degree with 3 years of experience will be considered.)\u003c/p\u003e\n\u003cp\u003eRESPONSIBILITIES:\u003c/p\u003e\n\u003cp\u003eJOB KNOWLEDGE\nFirm Job Knowledge - Firm working knowledge of concepts, practices and procedures and ability to use in varied situations\u003c/p\u003e\n\u003cp\u003eSUPERVISORY RESPONSIBILITIES\nNo Supervisory Duties - Not responsible for supervising employees.\u003c/p\u003e\n\u003cp\u003eBUDGETARY RESPONSIBILITIES\nNo Budget Responsibilities - No fiscal responsibility for the department's budget.\u003c/p\u003e\n\u003cp\u003eWORKING CONDITIONS:\u003c/p\u003e\n\u003cp\u003eNoise\u003c/p\u003e\n\u003cp\u003eWORK SCHEDULE:\u003c/p\u003e\n\u003cp\u003eStandard Hrs: 37.5; Band: 06\u003c/p\u003e\n\u003cp\u003eJOB LOCATION:\u003c/p\u003e\n\u003cp\u003eClemson, SC\u003c/p\u003e\n\u003cp\u003eAPPLICATION DEADLINE:\u003c/p\u003e\n\u003cp\u003eDecember 2, 2019\u003c/p\u003e\n\u003cp\u003eCLOSING STATEMENT:\u003c/p\u003e\n\u003cp\u003eClemson University is an AA/EEO employer and does not discriminate against any person or group on the basis of age, color, disability, gender, pregnancy, national origin, race, religion, sexual orientation, veteran status or genetic information. Clemson University is building a culturally diverse faculty and staff committed to working in a multicultural environment and encourages applications from minorities and women.\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2Apply.net/vc5wv4dft4r3fh2n\"\u003ehttp://www.Click2Apply.net/vc5wv4dft4r3fh2n\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI115427101\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply Here:\u003ca href=\"http://www.Click2Apply.net/vc5wv4dft4r3fh2n\"\u003ehttp://www.Click2Apply.net/vc5wv4dft4r3fh2n\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"335db31a-6d32-4036-ba42-c8cd16cdaba3","type":"Full Time","url":"https://jobs.github.com/positions/335db31a-6d32-4036-ba42-c8cd16cdaba3","created_at":"Tue Nov 12 20:06:51 UTC 2019","company":"Monterey Park Corporate Center","company_url":"https://www.montereypark.ca.gov/","location":"Monterey Park, California","title":"Senior Web Software Engineer","description":"\u003cp\u003eOverview\nThe Senior Web Software Engineer will be responsible for the analysis, design, development, testing, documenting and support of information systems.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesigns and delivers web applications with emphasis on security and performance\u003c/li\u003e\n\u003cli\u003eAble to develop complex modules with little to no supervision.\u003c/li\u003e\n\u003cli\u003eConducts system analysis and development, with limited support, to keep systems current with changing technologies\u003c/li\u003e\n\u003cli\u003eDiagnoses current applications and designs solutions to problematic programming\u003c/li\u003e\n\u003cli\u003eDevelops, tests, and reviews code to ensure accurate and efficient solutions; provides assistance to junior developers\u003c/li\u003e\n\u003cli\u003eAnalyzes system specifications and translates system requirements to task specifications for junior developers\u003c/li\u003e\n\u003cli\u003eResponds promptly and professionally to defect reports\u003c/li\u003e\n\u003cli\u003eReviews and repairs legacy code\u003c/li\u003e\n\u003cli\u003eResearches and utilizes tools that assist with development, security, and performance\u003c/li\u003e\n\u003cli\u003eBe the subject matter expert for software solutions as they relate to healthcare\u003c/li\u003e\n\u003cli\u003eMaintains positive relations with all peers, stakeholders, and clients\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eBA/BS in related field (computer science, information systems, etc.) or equivalent experience\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of OOP principles and design patterns\u003c/li\u003e\n\u003cli\u003e7+ years of formal .NET web application development in C#, Visual Studio, and TFS\u003c/li\u003e\n\u003cli\u003e2+ years of ASP.NET MVC development\u003c/li\u003e\n\u003cli\u003e5+ years of full stack development on all layers of a web application\u003c/li\u003e\n\u003cli\u003eStrong experience with HTML5, CSS3, Bootstrap, Less/Sass, AngularJS, TypeScript\u003c/li\u003e\n\u003cli\u003eExperience with JavaScript libraries (jQuery, Modernizr, etc.)\u003c/li\u003e\n\u003cli\u003eExperience resolving production and infrastructure issues\u003c/li\u003e\n\u003cli\u003eExperience researching and presenting technologies and solutions\u003c/li\u003e\n\u003cli\u003eExperience and ability to lead, teach, and instruct teams\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eContact Us: \u003ca href=\"mailto:jpfellenberg@altamed.org\"\u003ejpfellenberg@altamed.org\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI115426057\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eContact Us:\u003ca href=\"mailto:jpfellenberg@altamed.org\"\u003ejpfellenberg@altamed.org\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"c2d2030c-7af8-40c2-96c6-267e1b5885ac","type":"Full Time","url":"https://jobs.github.com/positions/c2d2030c-7af8-40c2-96c6-267e1b5885ac","created_at":"Tue Nov 12 15:10:31 UTC 2019","company":"ESI Software Germany GmbH","company_url":"https://virtualreality.esi-group.com/","location":"Stuttgart or Darmstadt, Germany","title":"Software Developer Virtual Reality (f/m/d)","description":"\u003cp\u003eBecome a software developer in our team and shape the future of our Virtual Reality software IC.IDO. You can focus on different aspects and forms of software development.\u003c/p\u003e\n\u003cp\u003eJob Profile:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou will work together with our team on developing our VR software IC.IDO.\u003c/li\u003e\n\u003cli\u003eYou can focus on different aspects of software development:\no\tCore development\no\tArchitectural aspects\no\tOptimization\no\tImmersive technologies\no\tUser-oriented application development\no\tCloud deployment technologies\u003c/li\u003e\n\u003cli\u003eDepending on your field of interest, you will meet and collaborate with product managers and technical experts to validate designs and make improvements.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Profile:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a degree in Computer Science, or a related field?\u003c/li\u003e\n\u003cli\u003eYou have experience in coding in C++?\u003c/li\u003e\n\u003cli\u003eYou have basic knowledge in multi-threading, code optimization, UI design and development (with Qt), or front-end web technologies (HTML, CSS, REST, JS, Ajax)?\u003c/li\u003e\n\u003cli\u003ePlease note that the required skills depend on your field of interest from the above.\u003c/li\u003e\n\u003cli\u003eYou like to work independently and to extend your knowledge?\u003c/li\u003e\n\u003cli\u003eYou are fluent in English?\u003c/li\u003e\n\u003cli\u003eSounds good? Come join us!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is what we offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAn ambitious and innovative technical environment\u003c/li\u003e\n\u003cli\u003eExciting projects with international teams and customers\u003c/li\u003e\n\u003cli\u003eInteresting work in an international company with great colleagues and office environment\u003c/li\u003e\n\u003cli\u003eModern offices that are well-equipped with latest VR technologies\u003c/li\u003e\n\u003cli\u003eTraining opportunities\u003c/li\u003e\n\u003cli\u003eUnlimited contract\u003c/li\u003e\n\u003cli\u003eFlexible working hours and 30 days annual leave\u003c/li\u003e\n\u003cli\u003eFree fruit and drinks (hot drinks, water, juice)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAre you interested?\nWe are looking forward to receiving your application including earliest start date and salary expectations.\nYour contact: Lara Brenner - Recruiter at ESI Germany\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail to \u003ca href=\"mailto:jobs.EMEA@esi-group.com\"\u003ejobs.EMEA@esi-group.com\u003c/a\u003e\nor visit our application tool at\n\u003ca href=\"https://www.esi-group.com/company/join-esi/apply/job-openings\"\u003ehttps://www.esi-group.com/company/join-esi/apply/job-openings\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEYzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3a0aff773ff9a67e8a503854d2ddf0e285767d13/esi_full%20colour_tagline_cmyk_160px.jpg"},{"id":"31af1729-ba6f-4d03-aab7-0d9018ba35d2","type":"Full Time","url":"https://jobs.github.com/positions/31af1729-ba6f-4d03-aab7-0d9018ba35d2","created_at":"Tue Nov 12 14:40:32 UTC 2019","company":"Tetrate","company_url":"https://tetrate.io","location":"Boston","title":"Service Mesh Engineer - Tetrate","description":"\u003cp\u003eJoin a team of world-class engineers at a series A Silicon Valley startup. Seeking backend software engineers experienced in building distributed systems using Golang and gRPC.\u003c/p\u003e\n\u003cp\u003eWe are building a secure, and highly available service mesh platform for mission critical enterprise applications for Fortune 500 companies, spanning both the legacy and modern infrastructure. We solve hard problems involving application centric networking \u0026amp; authorization building on Istio \u0026amp; Envoy. Our team consists of senior maintainers in \u003ca href=\"https://github.com/envoyproxy/envoy\"\u003eEnvoy\u003c/a\u003e and founders of  \u003ca href=\"https://github.com/istio/istio\"\u003eIstio service mesh\u003c/a\u003e, one of the fastest growing projects in all of Github according to the \u003ca href=\"https://octoverse.github.com/\"\u003eoctoverse\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIf you get a kick out of building distributed systems and enjoy solving hairy networking and access control problems in tightly controlled enterprise environments, you will thoroughly enjoy this position. Familiarity with technologies like Kubernetes, Istio, and Envoy, as well as open contributions would be a plus.\u003c/p\u003e\n\u003cp\u003eVery competitive pay and benefits included. Send an email to \u003ca href=\"mailto:hr@tetrate.io\"\u003ehr@tetrate.io\u003c/a\u003e with a resume or a link to your github profile. We have offices in SF, Boston, Barcelona, and Jakarta, and we are open to remote positions as well.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:hr@tetrate.io\"\u003ehr@tetrate.io\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3gzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--289c4fa1cfba75bc3ddcb96edede5cee1084b3a2/logo-1.png"},{"id":"5521084c-c174-4f32-a25e-53068157d2e6","type":"Full Time","url":"https://jobs.github.com/positions/5521084c-c174-4f32-a25e-53068157d2e6","created_at":"Tue Nov 12 13:21:33 UTC 2019","company":"anynines GmbH","company_url":"https://ww.anynines.com","location":"Saarbrücken","title":"Softwareentwickler (m/w/d)","description":"\u003cp\u003eAls Teil des Cloud-native App Development Teams bist du in die Planung, Erstellung der Architektur und der Realisierung von Cloud-nativen Softwareprojekten auf Basis von Ruby on Rails involviert.\u003c/p\u003e\n\u003cp\u003eDu arbeitest in engem und stetigem Austausch mit unseren Kunden an der Realisierung und Veröffentlichung von Features.\u003c/p\u003e\n\u003cp\u003eDeine Tätigkeitsfelder erstrecken sich dabei von der Datenbankebene über Backends, geschrieben in verschiedenen Programmiersprachen, bis hin zum Frontend, welches du mit JavaScript Libraries wie ReactJS programmierst.\u003c/p\u003e\n\u003cp\u003eWir bieten:\u003c/p\u003e\n\u003cp\u003e-Ein innovatives, international agierendes Unternehmensumfeld, in dem unabhängiges Denken gefördert und geschätzt wird\u003c/p\u003e\n\u003cp\u003e-Vertiefe dein Wissen über Entwicklungsmethoden wie Continuous Integration, Continuous Delivery und Testautomatisierung\u003c/p\u003e\n\u003cp\u003e-Individuelle und flexible Arbeitszeitgestaltung inklusive Home Office/Remote-Arbeit\u003c/p\u003e\n\u003cp\u003e-Deutsch- bzw. Englischunterricht in kleinen Gruppen während der Arbeitszeit\u003c/p\u003e\n\u003cp\u003e-Familienfreundliches Arbeitsklima - Hunde sind ebenfalls willkommen\u003c/p\u003e\n\u003cp\u003e-Wechsel auf Wunsch zwischen unseren Offices in Berlin und Saarbrücken\u003c/p\u003e\n\u003cp\u003e-Regelmäßige Besuche von Konferenzen und Meetups\u003c/p\u003e\n\u003cp\u003e-MacBook Pro inklusive benötigtem Zubehör\u003c/p\u003e\n\u003cp\u003eDas bringst du mit:\u003c/p\u003e\n\u003cp\u003e-Dein Technology Stack\u003c/p\u003e\n\u003cp\u003e-Ruby on Rails ●●●●●\u003c/p\u003e\n\u003cp\u003e-HTML ●●●●○\u003c/p\u003e\n\u003cp\u003e-CSS ●●●●○\u003c/p\u003e\n\u003cp\u003e-JavaScript ●●●○○\u003c/p\u003e\n\u003cp\u003e-Dies entspricht nicht deinem Tech Stack? Erfahrung mit ähnlichen Technologien ist selbstverständlich möglich\u003c/p\u003e\n\u003cp\u003e-Kenntnisse in Design Patterns, Clean Code und Erfahrung im Umgang mit agilen Entwicklungsmethoden\u003c/p\u003e\n\u003cp\u003e-Gute bis sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eBewirb dich jetzt unter:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.anynines.com/karriere/software-developer\"\u003ehttps://www.anynines.com/karriere/software-developer\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3","type":"Full Time","url":"https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3","created_at":"Sat Aug 03 00:50:23 UTC 2019","company":"Game Closure","company_url":"http://gameclosure.com","location":"San Francisco, Mountain View, Tokyo, Remote","title":"Senior Game Engineer (REMOTE)","description":"\u003cp\u003eGAME CLOSURE\u003c/p\u003e\n\u003cp\u003eSan Francisco, Mountain View, Tokyo, Remote  -  Full Time\u003c/p\u003e\n\u003cp\u003eGame Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!\u003c/p\u003e\n\u003cp\u003eGame Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.\u003c/p\u003e\n\u003cp\u003eIt's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe responsible for designing, developing and deploying major game features\u003c/li\u003e\n\u003cli\u003eOwn game feature areas from end-­to­-end\u003c/li\u003e\n\u003cli\u003eBe the champion for the user!\u003c/li\u003e\n\u003cli\u003eInsist on the highest standards and create functional and engaging features that will delight our users\u003c/li\u003e\n\u003cli\u003eBe part of a tight game development team looking to iterate fast on a fun concept and then building it out\u003c/li\u003e\n\u003cli\u003eHave real input on end-user product\u003c/li\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements\u003c/li\u003e\n\u003cli\u003eHands­ on architect and coder for sophisticated client/server systems for mobile gaming\u003c/li\u003e\n\u003cli\u003eInnovate and iterate on process, systems and technology to deliver world­-class social games\u003c/li\u003e\n\u003cli\u003eBe a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience, working on cross functional teams.\u003c/li\u003e\n\u003cli\u003eProven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).\u003c/li\u003e\n\u003cli\u003eCapable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\u003c/li\u003e\n\u003cli\u003eProficient at using script debuggers like Chrome Debugger.\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eAdvanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with analytics and A/B testing in mobile games\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn or other VCS.\u003c/li\u003e\n\u003cli\u003eSelf starter, analytical and creative\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\u003c/li\u003e\n\u003cli\u003eCheck out Everwing on Facebook Instant Games in Messenger. Can you build this game?\u003c/li\u003e\n\u003cli\u003eUnderstanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCanvas animation work\u003c/li\u003e\n\u003cli\u003e2+ years of game development experience with multiple shipped titles\u003c/li\u003e\n\u003cli\u003eSpecialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\u003c/li\u003e\n\u003cli\u003eExpert knowledge of TypeScript\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eGC Perks:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical, Dental, \u0026amp; Vision: Top quality insurance options with 100% of premiums covered\u003c/li\u003e\n\u003cli\u003eSocial Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more\u003c/li\u003e\n\u003cli\u003eCommuter Pass + Free Parking: Your commute and parking to the office is on us!\u003c/li\u003e\n\u003cli\u003ePTO: Unlimited vacation policy\u003c/li\u003e\n\u003cli\u003eMeals: Free daily lunches, well stocked kitchen, healthy snacks and drinks\u003c/li\u003e\n\u003cli\u003ePet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTV1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b586f79a85322f93304aae975ae4ae8556e35bfe/GClogo_small.png"},{"id":"eff197ca-d276-45d7-83ae-8c0b2cf1e67c","type":"Full Time","url":"https://jobs.github.com/positions/eff197ca-d276-45d7-83ae-8c0b2cf1e67c","created_at":"Mon Nov 11 17:26:23 UTC 2019","company":"University of Pennsylvania","company_url":"https://www.upenn.edu/","location":"Philadelphia, PA, USA","title":"Senior Web Designer, Undergraduate Admissions","description":"\u003cp\u003eSenior Web Developer, Undergraduate Admissions\u003c/p\u003e\n\u003cp\u003eUniversity Overview\nThe University of Pennsylvania, the largest private employer in Philadelphia, is a world-renowned leader in education, research, and innovation. This historic, Ivy League school consistently ranks among the top 10 universities in the annual U.S. News and World Report survey. Penn has 12 highly-regarded schools that provide opportunities for undergraduate, graduate and continuing education, all influenced by Penn’s distinctive interdisciplinary approach to scholarship and learning.\u003c/p\u003e\n\u003cp\u003ePenn offers a unique working environment within the city of Philadelphia. The University is situated on a beautiful urban campus, with easy access to a range of educational, cultural, and recreational activities. With its historical significance and landmarks, lively cultural offerings, and wide variety of atmospheres, Philadelphia is the perfect place to call home for work and play.\u003c/p\u003e\n\u003cp\u003eThe University offers a competitive benefits package that includes excellent healthcare and tuition benefits for employees and their families, generous retirement benefits, a wide variety of professional development opportunities, supportive work and family benefits, a wealth of health and wellness programs and resources, and much more.\u003c/p\u003e\n\u003cp\u003ePosted Job Title\nSenior Web Developer, Undergraduate Admissions\u003c/p\u003e\n\u003cp\u003eJob Profile Title\nWeb Designer Senior\u003c/p\u003e\n\u003cp\u003eJob Description Summary\nReporting to the Associate Dean of Communications in the Office of Undergraduate Admissions, Sr. Web Developer will be the lead in-house coder and developer for the Admissions website (Drupal and WordPress), including security and workflow, accessibility and solutions that improve usability. The Sr. Web Developer will be the lead project manager for all web-based projects that require an understanding of best practices of web development and design. They will lead the continued optimization of relevant features within Drupal 8, the expansion of our efforts with SLATE’s PING (an analytics service that records user-specific web traffic), as well as the expansion of our lead-generation landing pages. They will develop significant aspects of the website’s responsive design. As a key member of the Marketing and Communications team, lead the integration of all digital channels into the new website, implement an SEO strategy, improve user experience, and user interface design, utilize Google Analytics and produce standardized reports, implement front-end development work by designing and coding themes and plugins, and managing content.\nThe Sr Web Developer will project manage multi-year initiatives across work teams relating to web development, content strategy, marketing analytics, and web-based applications. In this capacity they will have significant input regarding the generation of a multi-year budget. They will maintain websites and ensure the reliable operation with prompt reaction and resolution to production problems. This position will create innovative approaches to improving the end-user experience by working to improve the usability, usefulness, and aesthetics of the web.\u003c/p\u003e\n\u003cp\u003eJob Description\nResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eLead coder and developer of the website (Drupal and WordPress), including security, accessibility, workflow, and solutions to improve usability.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eImplement best practices of web development and design, leading the migration to an open source platform\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLead project manager for multi-year, web-based projects, including developing lead-generation landing pages, continued optimization of relevant features within Drupal 8, and the continued expansion of our use of SLATE’s analytics service to record and analyize user-specific web traffic. This role includes significant input regarding the generation of a multi-year budget.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eImprove UX and UI by developing innovative design solutions, including assuring web and video accessibility for people with disabilities.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLead the integration of all digital channels into the new website, implement an SEO strategy, advise on user experience, and user interface design, utilize Google Analytics and produce standardized reports, implement front end development work by designing and coding themes and plugins, and managing content.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOther duties as assigned.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\nBachelor's Degree required with a minimum of 2 years of experience in web development, web management or web technologies or equivalent combination of education and experience. Additional experience in Content Management System solutions and project management skills around their deployment. Demonstrated skills in CMS management, security, and workflows in Drupal or WordPress, experience with project management, HTML development tools and other applicable authoring tools, web production, front-end development. Familiarity with PHP, CSS, and JavaScript. Must be able to integrate design into program rules and system architecture and must be familiar with platform/browser compatibility and basic usability issues. Strong working knowledge of web generators and photographic libraries. Knowledge of web accessibility guidelines and Search Engine Optimization. Experience working with multiple constituencies in a team setting to understand and articulate business processes, data, and priorities required. Excellent time management and organizational skills. Solution-orientation.\u003c/p\u003e\n\u003cp\u003eJob Location - City, State\nPhiladelphia, Pennsylvania\u003c/p\u003e\n\u003cp\u003eDepartment / School\nProvost's Center\u003c/p\u003e\n\u003cp\u003ePay Range\n$50,684.00 - $138,391.00\u003c/p\u003e\n\u003cp\u003eAffirmative Action Statement\nPenn adheres to a policy that prohibits discrimination on the basis of race, color, sex, sexual orientation, gender identity, religion, creed, national or ethnic origin, citizenship status, age, disability, veteran status, or any other legally protected class.\u003c/p\u003e\n\u003cp\u003eSpecial Requirements\nBackground check required after a conditional job offer is made. Consideration of the background check will be tailored to the requirements of the job.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo Apply\n\u003ca href=\"https://apptrkr.com/1694025\"\u003ehttps://apptrkr.com/1694025\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjkyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d851065a3fe92d21f40350882cb3a96f841bee23/University%20of%20Pennsylvania.png"},{"id":"776824e8-e1f8-4a2b-aa30-29a1a49c3d5f","type":"Full Time","url":"https://jobs.github.com/positions/776824e8-e1f8-4a2b-aa30-29a1a49c3d5f","created_at":"Mon Nov 11 15:51:01 UTC 2019","company":"VONQ","company_url":"http://www.vonq.com","location":"Rotterdam","title":"DevOps engineer","description":"\u003cp\u003e\u003cstrong\u003eDevOps Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you a DevOps, System or Cloud Engineer who can’t wait to be part of a growing team and to make actual impact? At VONQ we are building the best engineering team of Rotterdam, and build awesome things like our flagship product the Job Marketing Platform, tools and APIs that serve global customers. Are you ready to get your hands dirty in the design, implementation and testing of various platform services that are used by our development teams? Apply at VONQ for DevOps Engineer in Rotterdam!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDevOps Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRotterdam, fulltime, ASAP\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBe part of our journey and bring our development process, infrastructure and engineering practices to the next level.\u003c/strong\u003e\nAs our DevOps Engineer you will be leading critical platform development efforts. What you’ll actually be contributing to? Our core platform, the Job Marketing Platform (JMP). It’s a data-driven application with a recommendation engine that is advising recruiters how they should reach their target audience online.\u003c/p\u003e\n\u003cp\u003eWe have an ambitious roadmap for the upcoming period. Where do you come in? Enable our development teams to deliver great stuff in a reliable and scalable way, and improving our DevOps practices every day.\u003c/p\u003e\n\u003cp\u003eYou will be part of an international and experienced Product \u0026amp; Engineering department consisting of Backend and Frontend Developers, Data Engineers, Agile Coach and a CTO.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour day-to-day job in a nutshell\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLive and advocate our DevOps principles: simplicity, be in control, continuous improvement!\u003c/li\u003e\n\u003cli\u003eEnsure that our infrastructure and application landscape improve every day and are in great shape.\u003c/li\u003e\n\u003cli\u003eProvide guidance and support on platform \u0026amp; application architecture to the development teams as we move to a cloud and container based platform.\u003c/li\u003e\n\u003cli\u003eEnsure a smooth flow of work for all of our development teams, evangelise and show continuous delivery practices.\u003c/li\u003e\n\u003cli\u003eEnable fast clear feedback for our development team (and the wider business) on application changes, by providing clear logging, metrics and supporting the team's testing infrastructure.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat our perfect picture looks like\nThis describes the ideal candidate, but above all we value people that are eager to grow, love to work together, and love to get things done! Furthermore we think you need:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years relevant experience\u003c/li\u003e\n\u003cli\u003eGreat understanding of DevOps \u0026amp; continuous delivery practices\u003c/li\u003e\n\u003cli\u003eExperience with AWS and Docker, and DevOps \u0026amp; provisioning tooling (we use Terraform, Ansible, Jenkins, Datadog)\u003c/li\u003e\n\u003cli\u003eExperience with some of our middleware and databases: NGINX, PHP-FPM, Elasticsearch, RabbitMQ, MySQL, MongoDB, Apache Spark\u003c/li\u003e\n\u003cli\u003eExperience of working in a scrum team\u003c/li\u003e\n\u003cli\u003eExcellent communication skills in English\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLast but not least, you are able to get your hands dirty on legacy infrastructure, maintain it and migrate it to the new environment.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBonus points\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with application development (e.g. PHP, Scala)\u003c/li\u003e\n\u003cli\u003eExperience with data engineering (e.g. Apache Spark, Scala, Databricks)\u003c/li\u003e\n\u003cli\u003eWorked as part of an international team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThis is why you should join our team\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA good salary and 8% holiday allowance\u003c/li\u003e\n\u003cli\u003e100% commuting expenses compensation\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eUnlimited (paid!) holidays\u003c/li\u003e\n\u003cli\u003ePension contribution\u003c/li\u003e\n\u003cli\u003eWorking in the most progressive city of NL\u003c/li\u003e\n\u003cli\u003eYou get to work for a European leading company in the recruitment industry\u003c/li\u003e\n\u003cli\u003eTime and budget for training, and plenty of talented colleagues to learn from!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOh, and we have legendary company outings, beers on Friday and a lot of FUN!\u003c/p\u003e\n\u003cp\u003eUp for the challenge? Join VONQ as DevOps Engineer and make things happen! Apply by clicking on the \u003ca href=\"https://vonq.redirect.your-jobresponse.com/devops_engineer_rotterdam/252033/V819/apply\"\u003elink\u003c/a\u003e. Questions? You can reach out to Laura (recruiter) +31 6 22143366 or sent an e-mail to \u003ca href=\"mailto:lauravandenberg@vonq.com\"\u003elauravandenberg@vonq.com\u003c/a\u003e!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.redirect.your-jobresponse.com/devops_engineer_rotterdam/252033/V819/apply\"\u003eclick here to apply\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjEyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3479c61baddb1bb216bf4bf66cc4c2d06a767231/vonq.jpg"},{"id":"4b17ca2b-1a93-479e-82bf-3af5fd8c3158","type":"Full Time","url":"https://jobs.github.com/positions/4b17ca2b-1a93-479e-82bf-3af5fd8c3158","created_at":"Wed Oct 09 19:16:29 UTC 2019","company":"Table XI","company_url":"https://www.tablexi.com/","location":"Chicago","title":"Full Stack Software Developer","description":"\u003cp\u003e\u003cstrong\u003eWhat We're Looking For\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTable XI looks for team members who can see both the forest and the trees. Developing great products is about being equally concerned with building the right thing as building it well.\u003c/p\u003e\n\u003cp\u003eAs a senior full stack developer at Table XI, we'd want you to:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eLead projects, provide technical guidance, identify risks, proactively learn and share, and mentor more junior team members.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExpertly develop both back-end and front-end code\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnderstand client's business, build relationships with clients, and guide strategic decisions to make client successful\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCommunicate professionally and empathetically, solicit and provide feedback, actively offer help, and make sure everyone is aligned\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGuide architecture and implementation discussions, help unblock other developers, establish best practices for maintainability, and strategically balance test coverage, risk and budget\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eTake responsibility (even when no one asks)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork collaboratively on a cross-functional team of developers, designers, and business analysts.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLearn from everyone, no matter what their title is.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf you’re curious, talented and hungry, we want to hear from you.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur Tech Stack\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eBack-end: we primarily create applications in Ruby on Rails, though we have a small number of applications with other setups: Elixir and Phoenix, Node and Sails or Express, and even some old Perl apps.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFront-end: we either use Bulma or craft CSS from scratch following the ideas of ITCSS. For Javascript, we generally use React, though we have some apps that use Stimulus for when React is too big of a hammer.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMobile: we support native iOS development in both Objective-C and Swift. These days, though, almost all of our apps are being built in React Native.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eInfrastructure: nearly all of our infrastructure is on AWS and managed by Terraform and chef. We are in the process of migrating to Docker containers in Kubernetes (EKS).\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDon't hesitate if you don't have specific experience with our tech stack. We have a preference for folks with Ruby on Rails experience, but if you’re a strong developer with experience in related tools, we want to hear from you!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho We Are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Table XI, our product is our people. To deliver the best solutions, we need as many bright and diverse minds in the room as possible, and we need to be able to learn from them once they’re there. That’s why we’re working to create an environment that’s comfortable and inclusive for everyone. We know the tech industry isn't always as welcoming as it should be. But we're happy to do the work of making it better, both at our company and in our community.\u003c/p\u003e\n\u003cp\u003eOur team is important to us and we're excited to have been recognized as both one of Built in Chicago's 50 Best Small Companies to Work For in Chicago 2019 and Inc. Magazine's America's Best Workplaces of 2019.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur Approach\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor 16 years, we've built our software development consultancy around three small words and one big idea: tech done right. To us, it means more than clean code and sound design. It means doing right by our partners, by our peers and by our community.\u003c/p\u003e\n\u003cp\u003eWe’re a curious and humble group of people who love to build things. Learning is the key to our culture, and we’re always looking for new skills to pick up and ways to hone our craft. We bring that same curiosity to our clients, digging into their needs so we can make sure our design and development projects look great, work great and push client businesses forward. Our clients look to us as a strategic partner, and we make decisions that affect their long-term success.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe've Helped\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eNorthwestern University research facilities perform and advance clinical research\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAccuWeather prototype and design new features for their weather applications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eTyson Foods deploy Design Thinking methods to create one of Time magazine's top 10 smartest, most sustainable products of 2018\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMore than 25,000 people participate in Chicago Ideas Week each year\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePharmaceutical companies ensure that medicines and vaccines are manufactured and stored properly\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePechaKucha build a global community of storytellers, in over 1100 cities around the world\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eRoger Ebert solidify his legacy as a film critic\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBut the work is just part of what makes Table XI a fun place to be. We make time for people to follow their interests, whether that's volunteering at Code Platoon, speaking at RailsConf, learning a new framework or writing books. If there's something you're passionate about, we want to help you pursue it so you can teach it to the rest of us. Our weekly Lunch and Learns have covered everything from an X-Files approach to design, React/Redux basics, culinary skills for home cooks, to website performance testing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEveryone on Our Team Enjoys\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eDaily gourmet meals cooked in-house with vegetarian, gluten-free, and other options available\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe promise of minimal travel\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA casual loft office that pairs an open floor plan with quiet rooms\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCompetitive salary\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAetna health insurance\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e401k plan, including employer matching\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe Take Equality Seriously\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTable XI is proud to be an equal opportunity workplace and is committed to equal opportunity employment without regard to race, religion, color, gender (including gender identity, change of sex and transgender status), sexual orientation, age, disability, ancestry, national origin, military or veteran status, marital status, genetic information or any other characteristic protected by applicable law.\u003c/p\u003e\n\u003cp\u003eAll offers of employment are conditioned upon the candidate’s completion of a Form I-9 and delivery of appropriate documentation to establish the candidate’s identity and legal authorization to work in the United States.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here: \u003ca href=\"https://tablexi.bamboohr.com/jobs/view.php?id=20\"\u003ehttps://tablexi.bamboohr.com/jobs/view.php?id=20\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDkwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a0a542ad87474a6e974fea0c1622df64a402917b/tableXI_logo_large.jpg"},{"id":"f90ad85c-87fa-4af7-b882-f0c5daf06bf8","type":"Full Time","url":"https://jobs.github.com/positions/f90ad85c-87fa-4af7-b882-f0c5daf06bf8","created_at":"Mon Nov 11 14:45:53 UTC 2019","company":"VONQ","company_url":"http://www.vonq.com","location":"Rotterdam","title":"Senior PHP Developer","description":"\u003cp\u003e\u003cstrong\u003eBuild and improve a product that helps companies attract more qualified applicants, using a data-driven recommendation engine, that’s what Engineering at VONQ does. We are a growing organization in the transition to a software-driven business, and YOU can make an impact on that! You are a true PHP expert and you get excited when it comes to practices such as domain driven design, event sourcing \u0026amp; CQRS. Sounds like you? Apply now at VONQ for the position of Senior Software Engineer in Rotterdam!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSenior PHP Developer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRotterdam, 32-40 hr, ASAP\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour every day in a nutshell\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou start your day with your colleagues around the team board discussing what the goal for today should be. It seems that having the backend endpoint ready for the new API is tops, so you get down to it.\u003c/p\u003e\n\u003cp\u003eAfter a small design conversation, it's clear that some refactoring needs to happen, as our understanding of the problem improved. No worries! You're ready to pair up and have that PR before lunch.\u003c/p\u003e\n\u003cp\u003eIn the afternoon you have a one-on-one with the CTO, Bart, and you discuss to which industry-related event you'd like to go next. Perhaps you dare to give a presentation this time?\u003c/p\u003e\n\u003cp\u003eAfter that, you get to check some Pull Requests made by your colleagues and before the day ends, that endpoint is building, deploying and sending the right metrics! Today's been a good day, now ready to go home.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow you get the job done\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePHP is your native language and you use Symfony, MySQL and Elasticsearch\u003c/li\u003e\n\u003cli\u003eYou’ll work in a multidisciplinary team: pairing, code reviews and giving/receiving feedback is something you’ll do regularly\u003c/li\u003e\n\u003cli\u003eYour job includes more than only coding, that’s why you’ll work closely together with the Product Manager \u0026amp; Business stakeholders to actually give direction to the things you build\u003c/li\u003e\n\u003cli\u003eSince you get a lot of space and freedom for new initiatives, you turn good ideas into actions. For example, improving or implementing things you find important or interesting on the spot!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou will be part of an international and experienced Engineering department consisting of Frontend- and Backend Developers, Data- and DevOps Engineers, an Agile Coach and a CTO.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat our perfect picture looks like\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis describes the ideal candidate, but above all, we value people that are eager to grow, autonomous, work together, and love to get things done! Furthermore, we think you need:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ year working experience as a PHP expert and an Agile mindset\u003c/li\u003e\n\u003cli\u003eExperience with MySQL\u003c/li\u003e\n\u003cli\u003eExperience with practices such as Domain Driven Design, Test-driven Development, Continuous- Integration, Deployment \u0026amp; Delivery\u003c/li\u003e\n\u003cli\u003eExcellent English communication skills\u003c/li\u003e\n\u003cli\u003eA passion for software architecture \u0026amp; craftsmanship\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus points:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with event sourcing and CQRS\u003c/li\u003e\n\u003cli\u003eExperience with Symfony and Elasticsearch\u003c/li\u003e\n\u003cli\u003eExperience with REST API design and API based business\u003c/li\u003e\n\u003cli\u003eExperience as Scrum Master or team lead\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThere is more! We offer:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA good salary and 8% holiday allowance\u003c/li\u003e\n\u003cli\u003e100% commuting expenses compensation\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eUnlimited (paid!) holidays\u003c/li\u003e\n\u003cli\u003ePension contribution\u003c/li\u003e\n\u003cli\u003eTime and budget for training, and more!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOh, and we have legendary company outings, beers on Friday and a lot of FUN!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAre you ready to make an impact and build together with us on a dream product for recruitment marketing? We can’t wait for your application!\u003c/strong\u003e Apply for Senior Software Engineer at VONQ in Rotterdam by clicking on the \u003ca href=\"https://vonq.redirect.your-jobresponse.com/senior_php_developer_rotterdam/244865/V819/solliciteren\"\u003elink\u003c/a\u003e. Questions? You can reach out to \u003ca href=\"mailto:info@vonq.com\"\u003einfo@vonq.com\u003c/a\u003e!\u003c/p\u003e\n\u003cp\u003eAgencies hold your horses: unsolicited CV’s are dropped by our SPAM filters.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.redirect.your-jobresponse.com/senior_php_developer_rotterdam/244865/V819/solliciteren\"\u003eClick here to apply!\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmwyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4af27c3991b30079c74f4416103a16c2a96e5871/vonq.jpg"},{"id":"f92cd538-2d20-46b0-b17b-699907f1de7b","type":"Full Time","url":"https://jobs.github.com/positions/f92cd538-2d20-46b0-b17b-699907f1de7b","created_at":"Mon Nov 11 12:48:15 UTC 2019","company":"Microsoft","company_url":"https://www.microsoft.com/","location":"Dublin, Ireland","title":"Site Reliability Engineers","description":"\u003cp\u003eSREs are people who take engineering-based approaches to solve operations problems: we like infrastructure, we like seeing how big complicated things work, and most importantly, we gain great satisfaction from making it better. We have backgrounds in lots of things -- of course, Computer Science, System Administration, Networking, Mathematics, and Engineering generally, but you can also find folks who've worked in Physics, Chemistry, Biology, Statistics, and even English. \u003c/p\u003e\n\u003cp\u003eSREs build, monitor, and maintain the systems and infrastructure that ensure our customers can quickly access their data and run workloads whenever and wherever they need to. We identify service problems and areas for improvement, and we follow up by fixing those problems. Our work is key to the success of many of the Microsoft services you'll have heard of, and a number you haven't. There are very few bits of Microsoft which aren't touched by SREs in some way or other. \nSREs come in two kinds: SRE-SWE (people with a software engineering background), and SRE-SE (people with a systems engineering background). \u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://tiny.cc/e372fz\"\u003ehttp://tiny.cc/e372fz\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkYyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--87847144adbe802455f5028fd7b459b206611c6a/MSFT_logo_rgb_C-Gray_200x200%5B2%5D.jpg"},{"id":"b9296bee-6947-42a6-b1f7-f718e19581ac","type":"Full Time","url":"https://jobs.github.com/positions/b9296bee-6947-42a6-b1f7-f718e19581ac","created_at":"Sun Nov 10 20:38:21 UTC 2019","company":"Kipsu","company_url":"http://www.kipsu.com","location":"Minneapolis","title":"DevOps Engineering Manager","description":"\u003cp\u003eAs consumers, we have plenty of ways to talk online about the service we have received but we don’t have the same friction-free ways to engage in-the-moment with real people at the businesses we visit. Kipsu provides a new way for businesses and guests to engage through real-time digital channels, transforming what it feels like to give and receive great service.\u003c/p\u003e\n\u003cp\u003eAt Kipsu, we love the work we do and how we do it. We have deliberately built an Engineering team (25 people at a company of 70) that is tight-knit, non-dogmatically agile and embraces talented individuals who want to make a difference. We are passionate about technology but realize that our greatest asset is our people. We are looking to hire a DevOps Manager who shares our passion and is ready to take on the exciting and complex challenges of a rapidly growing software company.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSummary\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe DevOps Manager position encompasses technical and people leadership duties to ensure that Kipsu's technical teams are able to smoothly deliver work from the development phase to a stable and secure production environment. The DevOps Manager at Kipsu reports to the VP of Engineering and occupies a \"Player-Coach\" role by coaching, mentoring, and guiding people and processes, while also remaining hands-on with implementation. Like any engineer here, the DevOps Manager is a “utility player” who wears multiple hats and is expected to operate dynamically within our evolving organization.\u003c/p\u003e\n\u003cp\u003eWe host our systems on AWS, running more than twenty microservices today and expanding our use of containerization as we go. We practice immutable infrastructure, infrastructure as code, and configuration as code. Our talented and enthusiastic team of Software Engineers believes in DevOps and has expertise with our infrastructure and automation across the team. Team members also run regular working groups in security, database, infrastructure, and front-end technologies to continuously and proactively improve our practices in those areas.\u003c/p\u003e\n\u003cp\u003eKipsu has facilitated hundreds of millions of messages between real people, resulting in genuine, human conversations as part of great service experiences. Come make an impact with us as we reach the next milestone together.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGuide the company's technical strategies and act as primary owner and subject matter expert in the following areas:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eInfrastructure - servers (production, development, marketing), network infrastructure, field-deployed hardware\u003c/li\u003e\n\u003cli\u003eExecution of deployments to production and testing environments\u003c/li\u003e\n\u003cli\u003eSystem monitoring and alerts\u003c/li\u003e\n\u003cli\u003ePerformance monitoring and testing\u003c/li\u003e\n\u003cli\u003eContinuous integration and deployment pipelines\u003c/li\u003e\n\u003cli\u003eInfrastructure and network security\u003c/li\u003e\n\u003cli\u003eConfiguration management\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eImplement changes to our systems as needed, particularly for larger, \"step function\" changes to our systems and processes\u003c/p\u003e\n\u003cp\u003eAct as a manager to a small team of software engineers (our squads are typically three to four in size) and provide mentoring and technical leadership in DevOps across the Engineering team\u003c/p\u003e\n\u003cp\u003ePlan and guide development projects from inception to delivery, managing expectations and communicating appropriately throughout\u003c/p\u003e\n\u003cp\u003eCommunicate technical concepts within Engineering and to the executive level as needed\u003c/p\u003e\n\u003cp\u003eProvide input and feedback on requirements, technical design, and code changes, especially in the following areas:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMicroservices, new service design, interservice communication, and resiliency\u003c/li\u003e\n\u003cli\u003eDatabase\u003c/li\u003e\n\u003cli\u003eConfiguration\u003c/li\u003e\n\u003cli\u003eNew infrastructure \u0026amp; changes to existing infrastructure and networking\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eContribute to the development processes and workflows used by Engineering\u003c/p\u003e\n\u003cp\u003eFoster and promote a collaborative culture of learning on the Engineering team\u003c/p\u003e\n\u003cp\u003eCommunicate with suppliers, vendors, and technical contacts at customer partners as necessary\u003c/p\u003e\n\u003cp\u003ePlan and monitor costs of hosting and scaling our systems\u003c/p\u003e\n\u003cp\u003eCreate documentation on technical designs, seeking feedback and engaging with peers for input\u003c/p\u003e\n\u003cp\u003eRespond promptly and appropriately to emergencies and incidents of system instability or other issues\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKnowledge/Skills/Abilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficiency with scripting and programming languages\u003c/li\u003e\n\u003cli\u003eAdvanced knowledge of AWS or other cloud computing platforms\u003c/li\u003e\n\u003cli\u003eKnowledge of infrastructure-as-code or configuration-as-code tools like Ansible, Terraform, etc.\u003c/li\u003e\n\u003cli\u003eKnowledge of security principles in networking, cloud computing, web application development\u003c/li\u003e\n\u003cli\u003eKnowledge of principles used to scale a highly available web or application platform\u003c/li\u003e\n\u003cli\u003eProficiency with relational databases and familiarity with data warehouses and big data concepts\u003c/li\u003e\n\u003cli\u003eProficiency in system architecture and design, microservice architecture, and interservice communication\u003c/li\u003e\n\u003cli\u003eAbility to mentor other engineers while maintaining individual responsibilities\u003c/li\u003e\n\u003cli\u003eA “continuous improvement” mindset; independently studying knowledge gap areas and taking advantage of Kipsu's professional development program\u003c/li\u003e\n\u003cli\u003eStrong technical communication skills; ability to interface, collaborate and partner effectively and strategically with other Kipsu teams\u003c/li\u003e\n\u003cli\u003eAbility to break down complex problems into manageable pieces that can be continuously deployed to production\u003c/li\u003e\n\u003cli\u003eA proactive mindset; communicating early and often around suspected shortfalls in deliverables or timelines\u003c/li\u003e\n\u003cli\u003eResourcefulness; ability to research and answer own questions, using creativity to tackle problems with non-obvious solutions\u003c/li\u003e\n\u003cli\u003eAbility to stay positive, be self-motivated, and work through complexity and ambiguity when needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequired Experience\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s or master's degree, or equivalent experience\u003c/li\u003e\n\u003cli\u003e5+ years of work experience in Software Engineering, DevOps, or operations\u003c/li\u003e\n\u003cli\u003eDemonstrated history of strong performance on complex or ambiguous projects\u003c/li\u003e\n\u003cli\u003eStrong experience utilizing Amazon Web Services (AWS) or other cloud computing platforms\u003c/li\u003e\n\u003cli\u003eExperience building and hosting web applications, preferably designing or influencing architecture\u003c/li\u003e\n\u003cli\u003eExperience with agile software development methodologies\u003c/li\u003e\n\u003cli\u003eKnowledge of unit testing, integration testing, and QA automation tools and techniques, and how they can be incorporated into development and deployment processes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOne last thing– At Kipsu, we believe that our values, success, and future as a leader in our industry require a vibrant and diverse workforce. This is one of the many challenges we seek to solve, and we are intentional and active in recruiting talent that comes from all walks of life and building an environment that is inclusive to all backgrounds. We need your contribution to our team. Please, consider rolling up your sleeves and joining us on our journey.\u003c/p\u003e\n\u003cp\u003eSerious applicants will submit both a resume and cover letter. In your cover letter, please answer the following questions.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIn your experience, what distinguishes an organization that practices DevOps successfully from one that does not?\u003c/li\u003e\n\u003cli\u003eHow has your perspective as an engineer changed since the start of your career?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe look forward to hearing from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to: \u003ca href=\"mailto:bfortin@kipsu.com\"\u003ebfortin@kipsu.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"fefb9fbe-b02b-455d-a1d7-ae0bbe936993","type":"Full Time","url":"https://jobs.github.com/positions/fefb9fbe-b02b-455d-a1d7-ae0bbe936993","created_at":"Fri Nov 08 10:56:57 UTC 2019","company":"Dental wings","company_url":"https://www.straumann.com/en/dental-professionals.html","location":"Berlin","title":"Senior Softwareentwickler (m/w/x) für CAD-Anwendungen (Java)","description":"\u003ch2\u003eSenior Softwareentwickler (m/w/x) für CAD-Anwendungen (Java)\u003c/h2\u003e\n\u003cp\u003eBerlin, Deutschland\nVollzeit\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUnternehmensbeschreibung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDental Wings ist ein führender Anbieter digitaler Lösungen für die Dentalbranche. Zu unseren Haupttätigkeitsfeldern zählen dentale Scananwendungen, Software für Implantatplanung und geführte Chirurgie, Design von Zahnersatz, Lösungen zur Fertigungsanbindung sowie Tools für die Kommunikation der eingebundenen Experten und Fachleute. Unsere Produkte werden von führenden Dentalunternehmen weltweit in über 50 Ländern vertrieben. Der Hauptsitz des Unternehmens befindet sich in Montreal, Kanada. Außerhalb Kanadas unterhalten wir Geschäftsstellen in Berlin und Chemnitz (Deutschland) sowie Lyon (Frankreich) und in China. Dental Wings beschäftigt mehr als 150 Mitarbeiter.\u003c/p\u003e\n\u003cp\u003eZur Verstärkung unseres Teams am \u003cstrong\u003eStandort Berlin-Adlershof\u003c/strong\u003e suchen wir in unbefristeter Anstellung einen \u003cstrong\u003eSenior Softwareentwickler (m/w/x) für CAD-Anwendungen (JAVA).\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eStellenbeschreibung\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eGUI und Backend Development für die nächste Generation unserer Desktop CAD Produkte\u003c/li\u003e\n\u003cli\u003eDesign und Realisierung von User Workflows im Team in enger Zusammenarbeit mit dem Product Owner\u003c/li\u003e\n\u003cli\u003eVerbessern und Erweitern unseres Sourcecodes\u003c/li\u003e\n\u003cli\u003eUnterstützen des Übergangs von Legacy zu State-Of-The-Art\u003c/li\u003e\n\u003cli\u003eCode Reviewing - nicht nur auf Richtigkeit, sondern auch mit Blick auf Qualität und Langzeitwert\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifikationen\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMindestens 5 Jahre Berufserfahrung mit sehr guten Kenntnissen in Java, C# oder verwandten Sprachen\u003c/li\u003e\n\u003cli\u003eDen Anspruch soliden, wart- und testbaren, performanten Code zu schreiben\u003c/li\u003e\n\u003cli\u003eEine Passion für skalierbare Software Architektur und System Design\u003c/li\u003e\n\u003cli\u003eGute Kommunikationsfähigkeiten zur erfolgreichen, bereichsübergreifenden Zusammenarbeit\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eZusätzliche Informationen\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eSo arbeiten wir\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWir nutzen SCRUM/Kanban mit täglichen Stand-ups an unserem SCRUM Board. Unser TechStack umfasst Eclipse, JUnit, Git, Gerrit, Sonar, Jenkins, Redmine und Slack. Zum GUI-Design nutzen wir JavaFX und OpenGL 4.5 zur 3D Visualisierung.\u003c/p\u003e\n\u003ch2\u003eDas bieten wir\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSpannende und innovative Projekte für renommierte Kunden aus der Medizintechnik\u003c/li\u003e\n\u003cli\u003eKurze Entscheidungswege und ein sympathisches, kompetentes Team aus EntwicklerInnen und ZahntechnikerInnen\u003c/li\u003e\n\u003cli\u003eModernes Büro mit familiärer Arbeitsatmosphäre\u003c/li\u003e\n\u003cli\u003eKein Dresscode\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten und der Möglichkeit von Homeoffice\u003c/li\u003e\n\u003cli\u003eIndividuelle Weiterbildungsmöglichkeiten\u003c/li\u003e\n\u003cli\u003eZahlreiche Benefits: Teamfrühstück, kostenfreie Getränke, frisches Obst, Firmenfitness, Inhouse Sprachkurs (Englisch), Bezuschussung Kinderbetreuung, Kantine und ÖPNV, Team Events\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eHaben wir Dein Interesse geweckt?\u003c/h2\u003e\n\u003cp\u003eDann freuen wir uns darauf, Dich kennen zu lernen. Bitte sende Deine vollständigen Bewerbungsunterlagen mit Gehaltsvorstellung und frühestem Eintrittstermin an \u003ca href=\"mailto:office.berlin@dental-wings.com\"\u003eoffice.berlin@dental-wings.com\u003c/a\u003e oder nutze gern unser Bewerbungsportal über \u003ca href=\"https://straumanngroup.redirect.your-jobresponse.com/senior_softwareentwickler_m_w_x_fuer_cad_anwendungen_java_berlin/258303/V819/anwenden\"\u003ediesen Link\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eBitte sende Deine vollständigen Bewerbungsunterlagen mit Gehaltsvorstellung und frühestem Eintrittstermin an \u003ca href=\"mailto:office.berlin@dental-wings.com\"\u003eoffice.berlin@dental-wings.com\u003c/a\u003e oder nutze gern unser Bewerbungsportal über \u003ca href=\"https://straumanngroup.redirect.your-jobresponse.com/senior_softwareentwickler_m_w_x_fuer_cad_anwendungen_java_berlin/258303/V819/anwenden\"\u003ediesen Link\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXgyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f5560fd03fe0eec32a54cd8f34e78ce720aade32/dental%20wings.jpg"}]